[
  {
    "title": "Basic D&D: Caverns of Thracia",
    "desc": "*Owlbear’s Rest & Cthulhu Present…* The Caverns of Thraciaby Jennell JaquaysCome and experience one of the classic early D&D adventure modules. Explore a branching, non-linear, reactive dungeon inhabited by multiple factions and loot their stuff ! Utilizing Basic D&D for simple character creation and a rules light approach.Casual drop-in/drop-out play — come when you can! No RPG experience necessary!📅 Every other Saturday, 5–9 PM (No session 8/9)💲 $10 per player per session📍 In the Druid's Grove at Owlbear’s RestGrab your dice. Explore the depths. Steal from lizard cultists.The Caverns await…",
    "date": "11-15-2025",
    "start_time": "05:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Aug 08, 2026 on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/basic-d-d-caverns-of-thracia-08-08-2025-15-40-31",
    "venue_name": "Owlbear’s Rest",
    "street": "506 Main Street",
    "city": "Suite 26A",
    "state": "ME",
    "zip_code": "04092",
    "phone": "(207) 591-7019",
    "email": "info@owlbearsrest.com",
    "website": "https://owlbearsrest.com/"
  },
  {
    "title": "Ryan Blotnick Quartet",
    "desc": "Tinder Hearth is so excited to host dear friend and frequent collaborator Ryan Blotnick for an evening of original compositions and improvisations with his quartet. Guitarist and composer Ryan Blotnick has long balanced a searching intelligence with a natural lyricism, whether navigating open improvisation, writing for film, or sculpting finely wrought original tunes. His quartet-featuring Tyler Wood on keyboards, Adam Chilenski on bass, and Otto Hauser on drums-extends that sensibility into a collective conversation that's as fluid as it is grounded. Their music, spacious yet deeply rooted, thrives on close listening and collective interplay.Blotnick first emerged in New York's modern jazz scene, praised by Jazz Times as \"one of the bright lights\" of his generation, and has since built a career that bridges jazz, world music traditions, and cinematic soundscapes. His playing—at once lyrical and daring-has graced stages from Copenhagen to New York and found its way into award-winning films at Sundance, SXSW, and DOC NYC. Now based in Maine, he continues to compose and perform widely, exploring new sonic terrain with his quartet and local groups such as SOULBENDERS, Katherine Perkins and Danny Fisher-Lochhead's Large Ensemble.Wood, originally from Presque Isle, Maine, has carved out a multifaceted career as a musician, producer, and recording engineer. After early forays into piano, trumpet, and drums, he landed in Brooklyn, where he toured and recorded with artists such as Luke Temple, Glass Ghost, Chester French, and Joan As Police Woman. A co-founder of the indie-soul project Oh My Goodness, Wood also works internationally as an audio engineer, capturing folkloric traditions around the globe with Remix <-> Culture.Chilenski brings a deep groove and inventive sensibility honed in New York's vibrant scene, where he has performed with the exotica band Kolumbo, Groove Collective, and songwriters such as Jonah Smith, Luke Temple (Here We Go Magic) and Mikael Jorgensen (Wilco).Hauser, a versatile and sought-after drummer, has worked with an extraordinary range of-from folk icons Vashti Bunyan and Michael Hurley to rock luminaries like Jeff Tweedy and The War on Drugs. With over a hundred albums to his credit, his drumming is celebrated forTogether, the quartet creates music that is nuanced, melodic and spontaneous-drawing from jazz, folk, rock, and improvised traditions.",
    "date": "11-15-2025",
    "start_time": "05:00 PM",
    "end_time": "09:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/ryan-blotnick-quartet-02-11-2025-23-42-56",
    "venue_name": "Tinder Hearth",
    "street": "1452 Coastal Road",
    "city": "Brooksville",
    "state": "",
    "zip_code": "",
    "phone": null,
    "email": null,
    "website": null
  },
  {
    "title": "First Light at The Halo at the Point",
    "desc": "First Light is a bold new creation by 3AM Theatre (NYC) blending contemporary circus, physical theatre, and modern dance with kinetic sculpture, immersive lighting, and an original soundscape to deliver a singular, genre-defying experience.Visually striking and emotionally charged, the work draws audiences into a journey of explorers set out to ascend the tallest mountain known to exist. Their ambition soon becomes a reckoning with memory, loss, and the unseen forces that shape our fate.Guided by six virtuosic performers, First Light explores the human condition through themes of ambition, loss, transcendence, and empathy. As the characters rise and falter, are lost and found, their physical odyssey becomes a meditation on perseverance, connection, and acceptance. The production challenges the boundaries of live performance, merging world-class circus artists with live musicians and a site-specific stage design that fully integrates the unique architecture of The Halo at Thompson's Point, transforming its space into an immersive theatrical environment that blurs the line between audience and performer.Join us for a pre-show cocktail at 6:30 PM, featuring a live music set by Book Kennison, whose sound shapes the atmosphere of the evening. The performance begins promptly at 7:00 PM and runs approximately one hour and fifteen minutes, including a twenty-minute intermission. After the performance, stay for a meet-and-greet with the artists, accompanied by a DJ set by Kyle Driggs.",
    "date": "11-15-2025",
    "start_time": "06:30 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/first-light-at-the-halo-at-the-point-21-10-2025-09-24-34",
    "venue_name": "Halo at the Point",
    "street": "20 Van Aken Way",
    "city": "Portland",
    "state": "ME",
    "zip_code": "04102",
    "phone": null,
    "email": null,
    "website": "https://www.thompsonspoint.com/halotatthepoint"
  },
  {
    "title": "The Black & White Ball",
    "desc": "Returning once again to the stunning Mechanics' Hall Ballroom, Prismatic Productions & Mechanics’ Hall present The Black & White Ball. Coming off the heels of the sold-out Prismatic Ball, we are thrilled to bring the second large-scale ballroom event in 2025. This edition features 8 high-impact categories, with a special performance by a recently departed local favorite who will be returning to shut down the catwalk!This time, we are looking for show-stopping effects in full black and white - no color on the runway! Each category is calling for something specific, so make sure you come correct and deliver what the judges will be looking for. Every category calls for a black and white effect unless mentioned otherwise, so stun us with your coordination and creativity!Hosted by Aquarius Funkk & VegadonnaDJs: Red Tide & Disco DungeonJUDGES: TBACHECK THE DETAILED CATEGORY DESCRIPTIONS HERE!SCHEDULEBlock 1:Roll CallBest DressedBizarreBlock 2:FaceBodyHands PerformanceBlock 3:Tag Team RunwayFoot & EyewearVogue Performance----This event is created for and by Black & Brown Trans, Queer & Gender Non-conforming people. Ballroom has historically been a space for this community to gather and express themselves freely, to provide support and mutual aid, and to ensure our survival.In the spirit of community, we invite spectators and participants of all identities to attend. We encourage attendees who have the means to sponsor a ticket for a member of the QTBIPOC community to contribute using our donation option or directly buy a ticket for someone they know who would benefit from attending. You can make a suggested donation of $25-$50+ to support the attendance of those who need it most.If you are a community member who is unable to afford a full-price ticket, please contact @prismatic.prod on IG or hello@prismatic.productions for information about free and sliding-scale ticketsPARKING & TRANSPORTATIONThe Greater Portland Metro’s Congress & Casco Street Stop is directly in front of our building, served by routes 1, 7, 8, and 9B.Parking is available at the Arts District Garage, which has entrances on Casco and Brown Street, with a rate of $5 per hour. Metered street parking is available on Congress, Casco, Cumberland, Free Street, and other nearby streets. Free hourly street parking is available between Parris and Alder Street.ACCESSIBILITYTo enter our building, patrons will need to navigate a single step, or use a modular ramp. There is a wheelchair-accessible elevator (33\" wide),If you need accessibility accommodations/questions please contact us at programming@mainemechanics.org or 207-773-8396.",
    "date": "11-15-2025",
    "start_time": "07:00 PM",
    "end_time": "11:59 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/the-black-white-ball-02-10-2025-09-13-21",
    "venue_name": "Mechanics' Hall Ballroom",
    "street": "519 Congress St.",
    "city": "Portland",
    "state": "ME",
    "zip_code": "04101",
    "phone": null,
    "email": null,
    "website": null
  },
  {
    "title": "WHS Fall Musical: Grease",
    "desc": "Windham High School Drama is excited to present Grease, the high energy musical set at Rydell High in 1959. Join the Pink Ladies and Burger Boys for a fun evening of classic songs that we all know and love like Summer Nights and Greased Lightening.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Nov 16, 2025 on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/whs-fall-musical-grease-21-10-2025-09-26-28",
    "venue_name": "Windham Performing Arts Center",
    "street": "Windham High School",
    "city": "406 Gray Road",
    "state": "ME",
    "zip_code": "04062",
    "phone": "FMI: 207-893-0909",
    "email": null,
    "website": null
  },
  {
    "title": "Gospel Messiah: A Refugee Oratorio",
    "desc": "This event runs Friday, November 14 - Sunday, November 16. (2:00 p.m. matinee and 7:00 p.m. evening show on Saturday, November 15). Talk-back with performers on Saturday, November 15 at 8:30 p.m.Portland and Los Angeles-based arranger/organist Jack Maeby, with support from theatrical director Carol Tanzman, reimagines The Messiah, Handel's masterpiece, as a secular gospel music oratorio from the lens of immigrants and refugees in crisis zones. By using the experiences and talents of local refugee students and adults, as well as musicians and singers conversant with gospel music, the program aims to present an inclusive vision of the immigrant/refugee journey that is also an enlightening and dynamic musical experience.The Gospel Messiah is more relevant than ever, given the ever-increasing number of refugees seeking shelter worldwide. Enjoy an integrated performance created by the local artistic community, including musicians, singers, actors, and spoken word poet Moon Machar. The power of Handel's music in a dynamic gospel interpretation will create a riveting theatrical experience you won't soon forget! The project will be produced and performed at The Hill Arts.",
    "date": "11-15-2025",
    "start_time": "07:00 PM",
    "end_time": "08:15 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/gospel-messiah-a-refugee-oratorio-02-11-2025-01-32-46",
    "venue_name": "The Hill Arts",
    "street": "76 Congress Street",
    "city": "Portland",
    "state": "ME",
    "zip_code": "04101",
    "phone": "2078999487",
    "email": "gerry.shannon@thehillarts.me",
    "website": "https://www.thehillarts.me"
  },
  {
    "title": "Cosmogenesis: The Story of Us (True North Theatre)",
    "desc": "True North Theatre is proud to announce a very special fall 2025 presentation: the world premiere of COSMOGENESIS: THE STORY OF US by Rebecca-Sophia Strong and directed by Angela Bonacasa. This fulldome, immersive multi-media event will be presented at the Versant Power Astronomy Center and Maynard Jordan Planetarium in November.Lotus, a Chinese-born college student, embarks on a journey of self-discovery as she grows more and more curious about who her biological mother was and wants to embrace her own culture more. Along the way, she is joined by a new group of friends – students and instructors – who encourage her to unravel the mysteries of her life against the backdrop of astronomy and the universe around her.This world-premiere event runs November 7th - November 15th, with performances Fridays at 7:00pm and Saturdays at 2:00pm and 7:00pm. [Please note there will be no Sunday performances for this production.] Performances will be held at the Versant Power Astronomy Center and Maynard Jordan Planetarium, 167 Rangely Road, on the University of Maine Campus in Orono.For more information, or to pre-order your tickets, visit our Linktree (linktree.com/TrueNorthTheatre).COSMOGENESIS: THE STORY OF US is proudly supported by our season sponsors, Griffin & Jordan, Attorneys at Law.True North Theatre was founded in October of 2016 in Orono, Maine, by a group of people committed to high quality productions and a positive working environment.  Our mission is to entertain, educate, and inspire through high quality productions that highlight the breadth, depth, and complexity of the human experience. We strive to be recognized as an active, vibrant place for actors and designers to experiment, learn, and share their love of theatre while producing professional quality productions that encompass a variety of genres and styles.  As theatre artists, our company strives to embody joy, inclusiveness, tradition, innovation, and respect. True North Theatre is a 501(c)(3) non-profit organization.",
    "date": "11-15-2025",
    "start_time": "07:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Nov 15, 2025 on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/cosmogenesis-the-story-of-us-true-north-theatre-22-10-2025-09-22-35",
    "venue_name": "Versant Power Astronomy Center - University of Maine",
    "street": "167 Rangeley Road",
    "city": "Orono",
    "state": "ME",
    "zip_code": "04469",
    "phone": "2075811341",
    "email": "planetarium@maine.edu",
    "website": "https://astro.umaine.edu"
  },
  {
    "title": "Irving Berlin’s White Christmas",
    "desc": "ALL PERFORMANCES OF Irving Berlin's White Christmas ARE IN 2025Show dates are November 14, 15, 21, 28, 29, 2025 at 7:30pm + November 16, 22, 23, 30, 2025 at 2pmBased on the timeless and beloved film, White Christmas follows Veterans Bob Wallace and Phil Davis, who have a successful song-and-dance act after World War II. With romance in mind, the two follow a duo of beautiful singing sisters en route to their Christmas show at a Vermont lodge, which just happens to be owned by Bob and Phil's former army commander. White Christmas is an uplifting, wholesome musical that will delight audiences of all ages.Irving Berlin's White ChristmasBased Upon the Paramount Pictures FilmWritten For the Screen by Norman Krasna, Norman Panama and Melvin FrankMusic and Lyrics by Irving BerlinBook by David Ives and Paul BlakeOriginal stage production directed by Walter RobbieOrchestrations by Larry BlankVocal and Dance Arrangements by Bruce PomahacPresented by arrangement with Concord Theatricals www.concordtheatricals.comTickets: $36 - $38Prices include a per ticket handling fee. A portion of all ticket fees are designated to support the Youth Arts Access Fund. Tickets are nonrefundable.This event is eligible for the Youth Arts Access Fund.ASL interpreted performance on November 16, 2025. Seats marked \"L\" (orchestra right) have an excellent sightline to the interpreter(s).2025 Season Pass: Receive a 20% discount when you purchase tickets to all four 2025 stage shows in the same order! (The Cottage, Matilda, Deathtrap, White Christmas)",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/irving-berlins-white-christmas-24-02-2025-09-28-10",
    "venue_name": "Waterville Opera House",
    "street": "93 Main Street",
    "city": "Waterville",
    "state": "ME",
    "zip_code": "04901",
    "phone": "207-873-7000",
    "email": "boxoffice@watervillecreates.org",
    "website": "watervillecreates.org"
  },
  {
    "title": "American Patchwork Quartet",
    "desc": "American Patchwork Quartet vocalist Falu Shah; guitarist and vocalist Clay Ross; drummer Clarence Penn; and bassist Moto Fukushima reimagine traditional American folk songs through the lens of four U.S. citizens with different cultural backgrounds. APQ weaves dynamic guitar work, Indian classical vocals, and a jazz-driven rhythm section into a richly textured sound. Musical storytelling at its finest, APQ is a deliberately designed homage to America’s past and a showcase of its dynamic present, celebrating our shared identity and the musical threads that bind us. Sponsored by Camden Maine Stay Inn and 40 Paper. Choose-your-own reserved tickets are $36 in advance, $40 day-of-show, via camdenoperahouse.com and (207) 236-3154.",
    "date": "11-15-2025",
    "start_time": "07:30 PM",
    "end_time": "09:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/american-patchwork-quartet-24-09-2025-11-29-01",
    "venue_name": "Camden Opera House",
    "street": "29 Elm Street",
    "city": "Camden",
    "state": "ME",
    "zip_code": "04843",
    "phone": null,
    "email": null,
    "website": "http://www.camdenoperahouse.com"
  },
  {
    "title": "Mad Horse Theatre presents The Squirrels",
    "desc": "The Squirrels is a tragi-comical epic of prejudice and greed among squirrels living in a very divided tree.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/mad-horse-theatre-presents-the-squirrels-08-10-2025-10-24-57",
    "venue_name": "Mad Horse Theatre Company",
    "street": "24 Mosher Street",
    "city": "South Portland",
    "state": "ME",
    "zip_code": "04106",
    "phone": "2977474148",
    "email": "madhorsetheatre@gmail.com",
    "website": "http://madhorse.com"
  },
  {
    "title": "Made: Maine Makers at Ticonic Gallery",
    "desc": "Formerly known as the Holiday Bazaar, Made is a curated seasonal marketplace that highlights the artistry and craftsmanship of Maine makers, offering visitors a unique selection of locally handmade goods.Thank you to our sponsors Kennebec Savings Bank, the City of Waterville, Central Maine Newspapers, and Back Office Solutions!",
    "date": "11-15-2025",
    "start_time": "11:00 AM",
    "end_time": "07:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/made-maine-makers-at-ticonic-gallery-22-10-2025-09-23-33",
    "venue_name": "Waterville Creates",
    "street": "93 Main St",
    "city": "Waterville",
    "state": "ME",
    "zip_code": "04901",
    "phone": null,
    "email": null,
    "website": null
  },
  {
    "title": "A Christmas Carol",
    "desc": "SHOWTIMES: Friday - 11/14 7pm, Saturday - 11/15 2pm & 7pm, Sunday - 11/16 2pmDickens’s Christmas fairytale offers a message of hope and redemption.Rich miser Ebenezer Scrooge hates Christmas and all it entails. On Christmas Eve, spirits appear and take Scrooge to see poignant scenes from his past, joyful holiday celebrations in the present, and horrifying future events. In response, Scrooge changes his life to embody the holiday spirit all year round.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/a-christmas-carol-03-11-2025-20-23-09",
    "venue_name": "Wiscasset Middle High School",
    "street": "272 Gardner Road",
    "city": "Wiscasset",
    "state": "ME",
    "zip_code": "04578",
    "phone": null,
    "email": null,
    "website": null
  },
  {
    "title": "Sidle House Exhibition: ‘S.N.O.W. ‘25’",
    "desc": "Sidle House Gallery’s third annual small new original works exhibition,  ‘S.N.O.W. ‘25,’ will be on view November 6 thru 30.The exhibition includes 92 pieces selected from more than 200 submissions, featuring artists from within and outside of Maine - all works made in 2025. Highlighting both emerging artists and those with well-established studio followings; the show includes painters, ceramicists, photographers, and multi-media artists. Recurring themes in this collection evoke foraging, time, place, patterns, elements, companions loved and forgotten, oracles, and warnings.  Featuring small works at the end of the season is an opportunity for collectors and enthusiasts to acquire pieces at a more accessible scale and price. Visitors will see work by artists Cynthia J. Ahlstrin, Diana Arcadipone, Emily Barton, Jaden Kyung-Moon Bauch, Diana Baumbach, Amy Belleza, Charles Beneke, Amy Bernhardt, Eben Blaney, Emily Blashke, Carter Blease,  Ben Boothby, Toby Bottorf,  Jess Brayboy, Jessyca Broekman, Marcie Jan Bronstein,  Alex Bruehl, Annie Buchholz, Tim Christensen, Debra Claffey, Kenny Cole, Jodi Colella, Shanna Compton, Lindsay Deifik, Matt Demer, Ross Dener, Anna Dibble, Molly Dillon, Tara Dixon, Michel Droge, Christopher Dudle, Ingrid Ellison, Alicia Ines Etheridge, Josh Ferry, Julie Fischer McCarter, Emily Freeman, Lea Freni, Jessica Gandolf, Leah Gauthier, Kate Gerwig, Eileen Gillespie, Jenna Girolamo, Eva Rose Goetz, Eliza Goodwin, Candice Gosta, Jose Gouveia, Abigail Gray Swartz, Frances Hamilton, Chloe Hammond, Anne Hebebrand, Joe Hemes, Emily Hopkins, Tom Hubbard, Deanna Jacome, Nina Jerome, Jon Kashner, Kate Katomski, Jim Kelly, Keri Kimura, Lydia Kinney, Michele Kirchner, Amy Kustra, Justine Lasdin, Jeanne Maguire, Cathleen Mahan, Kristin Malin, Kelly McConnell, Jordann McKenna, Janice L. Moore, Marjorie Moore, Haley Nannig, Heather Newton Brown, Court Normandin, Rachael O’Shaughnessy, Isabella Pardales, Roxanne Pizzuto, Redford Reece, Michael Rich, Emily Sabino, Chloe Sailor, Bronwyn Sale, Jennifer Schmitt, Susan Smith, Alecia Sudmeyer, Caroline Sulzer, Sharon Townshend, Carlie Trosclair,  David Wade, Keita Annie Whitten Foster, Jennifer Lee Wiebe, Holden Willard, Sherre Wilson Liljegren, and Annie Lloyd Witte.This exhibition is on view for a limited time. Gallery hours have been extended to include Thursdays, Fridays, Saturdays and Sundays through November 30. Visitors are encouraged to arrange a viewing appointment during off hours by calling or texting gallerist Maddy Vertenten at 512-771-1149.",
    "date": "11-15-2025",
    "start_time": "03:00 PM",
    "end_time": "06:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/sidle-house-exhibition-s-n-o-w-25-02-11-2025-22-27-49",
    "venue_name": "Sidle House Gallery",
    "street": "20 Bartol Island Rd",
    "city": "Freeport",
    "state": "ME",
    "zip_code": "04032",
    "phone": null,
    "email": null,
    "website": null
  },
  {
    "title": "Sidle House Exhibition: ‘S.N.O.W. ‘25’",
    "desc": "Sidle House Gallery’s third annual small new original works exhibition,  ‘S.N.O.W. ‘25,’ will be on view November 6 thru 30.The exhibition includes 92 pieces selected from more than 200 submissions, featuring artists from within and outside of Maine - all works made in 2025. Highlighting both emerging artists and those with well-established studio followings; the show includes painters, ceramicists, photographers, and multimedia artists. Recurring themes in this collection evoke foraging, time, place, patterns, elements, companions loved and forgotten, oracles, and warnings.  Featuring small works at the end of the season is an opportunity for collectors and enthusiasts to acquire pieces at a more accessible scale and price. Visitors will see work by artists Cynthia J. Ahlstrin, Diana Arcadipone, Emily Barton, Jaden Kyung-Moon Bauch, Diana Baumbach, Amy Belleza, Charles Beneke, Amy Bernhardt, Eben Blaney, Emily Blashke, Carter Blease,  Ben Boothby, Toby Bottorf,  Jess Brayboy, Jessyca Broekman, Marcie Jan Bronstein,  Alex Bruehl, Annie Buchholz, Tim Christensen, Debra Claffey, Kenny Cole, Jodi Colella, Shanna Compton, Lindsay Deifik, Matt Demer, Ross Dener, Anna Dibble, Molly Dillon, Tara Dixon, Michel Droge, Christopher Dudle, Ingrid Ellison, Alicia Ines Etheridge, Josh Ferry, Julie Fischer McCarter, Emily Freeman, Lea Freni, Jessica Gandolf, Leah Gauthier, Kate Gerwig, Eileen Gillespie, Jenna Girolamo, Eva Rose Goetz, Eliza Goodwin, Candice Gosta, Jose Gouveia, Abigail Gray Swartz, Frances Hamilton, Chloe Hammond, Anne Hebebrand, Joe Hemes, Emily Hopkins, Tom Hubbard, Deanna Jacome, Nina Jerome, Jon Kashner, Kate Katomski, Jim Kelly, Keri Kimura, Lydia Kinney, Michele Kirchner, Amy Kustra, Justine Lasdin, Jeanne Maguire, Cathleen Mahan, Kristin Malin, Kelly McConnell, Jordann McKenna, Janice L. Moore, Marjorie Moore, Haley Nannig, Heather Newton Brown, Court Normandin, Rachael O’Shaughnessy, Isabella Pardales, Roxanne Pizzuto, Redford Reece, Michael Rich, Emily Sabino, Chloe Sailor, Bronwyn Sale, Jennifer Schmitt, Susan Smith, Alecia Sudmeyer, Caroline Sulzer, Sharon Townshend, Carlie Trosclair,  David Wade, Keita Annie Whitten Foster, Jennifer Lee Wiebe, Holden Willard, Sherre Wilson Liljegren, and Annie Lloyd Witte.This exhibition is on view for a limited time. Gallery hours have been extended to include Thursdays, Fridays, Saturdays and Sundays through November 30. Visitors are encouraged to arrange a viewing appointment during off hours by calling or texting gallerist Maddy Vertenten at 512-771-1149.   Contact:Maddy Vertenten, Sidle House GalleryEmail: maddy@sidlehouse.comPhone: 512.771.1149",
    "date": "11-15-2025",
    "start_time": "03:00 PM",
    "end_time": "06:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/sidle-house-exhibition-s-n-o-w-25-06-11-2025-15-13-53",
    "venue_name": "Sidle House Gallery",
    "street": "20 Bartol Island Rd",
    "city": "Freeport",
    "state": "ME",
    "zip_code": "04032",
    "phone": null,
    "email": null,
    "website": null
  },
  {
    "title": "An Evening of Tarot and Typewriter Poetry",
    "desc": "Please join Stevie Trevino, creator of Stevie’s Poem Store, for an evening of tarot and typewriter poetry at Something Witchy58 Exchange Street ~ PortlandSaturday Nov 15 from 4 - 7pm",
    "date": "11-15-2025",
    "start_time": "04:00 PM",
    "end_time": "07:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/an-evening-of-tarot-and-typewriter-poetry-12-11-2025-10-29-22",
    "venue_name": "Something Witchy",
    "street": "58 Exchange Street",
    "city": "Portland",
    "state": "ME",
    "zip_code": "04101",
    "phone": "8014133446",
    "email": "somethingwitchyllc@yahoo.com",
    "website": "https://www.facebook.com/profile.php?id=61565933136343&amp;sk=events"
  },
  {
    "title": "Gardens Aglow",
    "desc": "November 15, 2025 through January 3, 2026All Day EventNovember 15–January 3, Thursday–Sunday, plus select datesfrom 4–9 p.m.(Closed Thanksgiving, Christmas Eve, Christmas Day, New Years Eve, and New Years Day)The planning for our next Gardens Aglow is well underway, and we can’t wait to see you there! Experience this year’s theme, Nature in Motion, and see the Gardens come alive after dark. See the landscape transformed into a glowing journey through scenes depicting the flora and fauna of Maine’s forests, shorelines, and meadows—and don’t miss some fun new surprises in this year’s display!Tickets should be purchased online or over the phone, 207-633-8000.",
    "date": "11-15-2025",
    "start_time": "04:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/gardens-aglow-12-11-2025-10-35-41",
    "venue_name": "Coastal Maine Botanical Gardens",
    "street": "105 Botanical Gardens Drive",
    "city": "Boothbay",
    "state": "ME",
    "zip_code": "04537",
    "phone": "2076338000",
    "email": "cmbg@mainegardens.org",
    "website": "http://MaineGardens.org"
  },
  {
    "title": "Cafe USCA - Games, Food, Storytelling",
    "desc": "Upper Saco Cultural Alliance (USCA) serves the Fryeburg area with community gathering activities.  Cafe USCA is an afternoon of drop-in activities including board games, a light fare potluck dinner and adult story time where we share personal tales on a theme.  November 15th theme is \"Experiences with a Flat Tire\".",
    "date": "11-15-2025",
    "start_time": "04:00 PM",
    "end_time": "08:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/cafe-usca-games-food-storytelling-14-11-2025-09-24-49",
    "venue_name": "Fryeburg New Church Fellowship Hall",
    "street": "12 Oxford Street",
    "city": "Fryeburg",
    "state": "ME",
    "zip_code": "04037",
    "phone": "(802)8660177",
    "email": "uppersacoca@gmail.com",
    "website": "uppersacoca.org"
  },
  {
    "title": "Winter Wonders at Sandy Hill Farm",
    "desc": "New England's largest walk-through light show. 1 mile trail, over 2 million lights and trees wrapped heights of over 90 feet.Note: our schedule varies and does not operate daily. It is on our website. Thanks!",
    "date": "11-15-2025",
    "start_time": "04:15 PM",
    "end_time": "08:30 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/winter-wonders-at-sandy-hill-farm-09-09-2025-08-57-36",
    "venue_name": "Sandy Hill Farm",
    "street": "34 sandy hill lane",
    "city": "Eliot",
    "state": "ME",
    "zip_code": "03903",
    "phone": "2074757360",
    "email": "support@sandyhillmaine.com",
    "website": "sandyhillmaine.com"
  },
  {
    "title": "Black Mountain of Maine Fundraiser: Dinner, Silent & Live Auction!",
    "desc": "Join us for Friends of Black Mountain of Maine’s Annual Fundraising Auction — now bigger & better than ever! This year, we’re kicking things off with a fundraising dinner & silent auction featuring special items you won’t want to miss, followed by a live auction!Dinner by Mainely Plates & Platters* Limited tickets available — guarantee your seat with dinner! * Includes VIP seating for the live auction & a chance to bid on exclusive silent auction items.* Tickets: $30 per person / $50 per couple (live auction paddle not included).* Dinner tickets in advance only. Tickets will not be available at the door.Schedule:4:30 PM – Doors open for Dinner & Silent Auction guests.5:00–6:30 PM – Dinner & Silent Auction6:30 PM – Doors open for Live Auction guests. Free admission.7:00 PM – Live Auction begins (paddles $2)All Evening: Last Run Pub Open & Sweet Treats available for purchase.Don’t miss this fun night of amazing food, bidding, & community — all to support Black Mountain of Maine!Tickets on Sale Soon!",
    "date": "11-15-2025",
    "start_time": "04:30 PM",
    "end_time": "09:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/black-mountain-of-maine-fundraiser-dinner-silent-live-auction-03-09-2025-09-23-04",
    "venue_name": "Black Mountain of Maine",
    "street": "39 Glover Road",
    "city": "Rumford",
    "state": "ME",
    "zip_code": "04276",
    "phone": "207-364-8977",
    "email": "bmommarketing@gmail.com",
    "website": "http://www.skiblackmountain.org/index.php"
  },
  {
    "title": "Saturdays: Live Music in the Brewhouse! (FREE)",
    "desc": "Come on out to our tasting room to enjoy great music, tasty bevs & good vibes. No ticket required, but we'd love to know you're coming! Here's the current lineup:8/23 Skip BaileySkip Bailey is a Maine singer songwriter who plays salt of the earth music for salt of the earth people. His unique place-based sound combines folk, country, and maritime influences into tunes that you'll find yourself humming for days!8/30 Dan CloutierThis guitar-strumming storyteller is aiming to steal your heart with lyrical honesty. Dan Cloutier has sold out shows throughout New England. Expect beloved covers and originals too! He just released an album called, \"The Iceberg\" - spending the last year traveling to Greenland, and Newfoundland to record music and make videos about these adventures.9/6 This or BetterOne of Portland's most popular duos, Natalie and Max are “This or Better.” A folk acoustic duo with beautiful harmonies, fingerstyle guitar picking and a charismatic vibe that have stolen the hearts of many. Their repertoire includes original music and prime selections from the classics: John Prine, Dolly Parton, Buck Owens, Johnny Cash, June Carter, Willie Nelson, Townes Van Zandt and so many more. They are a heart-filled act any audience will enjoy!9/13 Sam CutlerSam Cutler is a singer songwriter who spent his formative years in New York City before moving to Portland in 2022. His music bounces between genres, sometimes more folk, sometimes more blues, with lyrics that reflect his humor and wit.",
    "date": "11-15-2025",
    "start_time": "05:00 PM",
    "end_time": "07:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/saturdays-live-music-in-the-brewhouse-free-25-08-2025-09-39-25",
    "venue_name": "Allagash Brewing Company",
    "street": "50 Industrial Way",
    "city": "Portland",
    "state": "ME",
    "zip_code": "04103",
    "phone": "800.330.5385",
    "email": null,
    "website": "https://www.allagash.com/visit/"
  },
  {
    "title": "Mad Horse Theatre Presents REALLY September 4th - 28th",
    "desc": "REALLY is a play about mourning,  intimacy, and the conflict between goodness and greatness as seen through the lens of photography.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "03:45 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 4 weeks through Sep 28, 2025 on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/mad-horse-theatre-presents-really-september-4th-28th-22-08-2025-12-24-01",
    "venue_name": "Mad Horse Theatre Company",
    "street": "24 Mosher Street",
    "city": "South Portland",
    "state": "ME",
    "zip_code": "04106",
    "phone": "2977474148",
    "email": "madhorsetheatre@gmail.com",
    "website": "http://madhorse.com"
  },
  {
    "title": "Otherlands Trio | Dimensions in Jazz",
    "desc": "Otherlands Trio is a new creative formation featuring veteran instrumentalist/composers Stephan Crump, Darius Jones, and Eric McPherson. Their dynamic, ever-evolving, magnetically charged music emerges from a pursuit of ego dissolution and spiritual communion.Workshop at 4:00pmAnd before their bios:Join Otherlands Trio for a workshop before their show, taking you behind the scenes into how they make music together! Learn about their approach to collective improvisation, aka spontaneous composition, and ensemble connection and development. Trio members will talk about their individual and collective processes and philosophies, and will play some to demonstrate. Open to the public for anyone who is interested, reservation and ticket purchase not required for the workshop.RSVP here: https://forms.gle/F9EVwMRcv3EnFZMV8Stephan Crump • acoustic bassDarius Jones • alto saxophoneEric McPherson • drums“A massive veteran trio…bassist Stephan Crump and alto saxophonist Darius Jones are not just immense players, they’re also two of the city’s great creative music composers, pushing it into wondrous, unexpected but also inviting spaces.”– DadaStrain“As a bassist and composer, Mr. Crump avoids obvious routes but manages never to lose his way” – The New York TimesStephan Crump is a Grammy-nominated bassist and composer, collaborator and bandleader, soloist and educator, based in New York City since 1994. A Memphis native, Crump fell for New York’s fecund scenes during his first semester at Amherst College, when he would drive hours to play late-night, weekday gigs in the West Village. He knew this is where he’d make his life and career.Working beyond genre, he has become a crucial component of multiple New York music communities in and beyond jazz. For two decades, Crump recorded and toured as a third of Vijay Iyer’s acclaimed trio, helping to build that band’s global reputation. Meanwhile, many of his own ensembles—Rhombal, with Tyshawn Sorey, Ellery Eskelin, and Adam O’Farrill; Secret Keeper, with Mary Halvorson; Rosetta Trio, with Jamie Fox and Liberty Ellman—prize versatility and voicings in a manner that more traditional configurations often do not.His Borderlands Trio, with pianist Kris Davis and drummer Eric McPherson, brings this same mentality to a more familiar setting. Other collaborators have included Miguel Zenón, Gordon Gano, Patti Austin, Johnny Clyde Copeland, Wadada Leo Smith, Jim Campilongo, David Gilmore, Sam Newsome, Steve Lehman, Cory Smythe, Ingrid Laubrock, Okkyung Lee, Mat Maneri, and Ches Smith.Crump’s physical and emotional connection to the bass is abundant through the new sextet Slow Water, which explores ecology and environment through composition and group communication. He teaches On Magnetism, a course in connecting more deeply through one’s instrument, after a lifetime of doing just that, and lives still in Brooklyn with his wife and collaborator, the singer Jen Chapin, and their two sons.A native of NYC, Eric McPherson came to prominence apprenticing with legendary saxophonist and educator, Jackie Mclean, and innovative pianist and composer Andrew Hill. Those foundational experiences cultivated Eric into one of the leading drummers in contemporary creative music. Eric continues the legacy of the musical giants who came before him. As well as performing and teaching internationally with an array of today’s leading contemporary creative musicians, Eric teaches privately and at the University of Hartford’s, Jackie Mclean institute.Darius Jones has created a recognizable voice as a critically acclaimed saxophonist and composer by embracing individuality and innovation in the tradition of African-American music.Jones has been awarded the Van Lier Fellowship, Jerome Foundation Commission, Jerome Artist-in-Residence at Roulette, French-American Jazz Exchange Award, and the Fromm Music Foundation commission at Harvard University. Jones has released a string of diverse recordings featuring music and images evocative of Black Futurism. His work as a new music composer for voice culminated in a major debut performance at Carnegie Hall in 2014. Jones has collaborated with artists including Gerald Cleaver, Oliver Lake, William Parker, Andrew Cyrille, Craig Taborn, Wet Ink Ensemble, Jason Moran, Trevor Dunn, Dave Burrell, Eric Revis, Matthew Shipp, Marshall Allen, Nasheet Waits, Branford Marsalis, Travis Laplante, Fay Victor, Cooper-Moore, Matana Roberts, JD Allen, Matthew Shipp, Nicole Mitchell, Georgia Ann Muldrow, and many more. The New York Times named Jones among the Best Live Jazz Performances of 2017 for his Vision Festival performance with Farmers by Nature. In 2018, Darius premiered across the United States a major new composition entitled LawNOrder, a dramatic commentary on social justice and American politics. Jones’ music is a confrontation against apathy and ego, hoping to inspire authenticity that compels us to be better humans.",
    "date": "11-15-2025",
    "start_time": "07:30 PM",
    "end_time": "08:45 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/otherlands-trio-dimensions-in-jazz-11-09-2025-15-10-49",
    "venue_name": "Portland Conservatory of Music",
    "street": "28 Neal Street",
    "city": "Portland",
    "state": "ME",
    "zip_code": "04102",
    "phone": "(207) 775-3356",
    "email": "info@portlandconservatoryofmusic.org",
    "website": "http://www.portlandconservatoryofmusic.org"
  },
  {
    "title": "ACAT: Becky Nurse of Salem, by Sarah Ruhl",
    "desc": "What does Latin, ritual dance, sound engineering, and film making have to do with Becky Nurse? Come find out, and see what our cast and crew have been up to in ACAT's upcoming production of Becky Nurse of Salem by Sarah Ruhl!Performance Dates: November 14, 15 & 21, 22 @ 7:30PMNovember 16 & 23 @ 2:00PM$15 for adults, $12 for seniors and studentsTickets available online or at the door!Ticket link: https://www.eventbrite.com/e/acat-becky-nurse-of-salem-by-sarah-ruhl-tickets-1874479270959?aff=oddtdtcreator\"Becky Nurse of Salem\" is presented by arrangement with Concord Theatricals on behalf of Samuel French, Inc.",
    "date": "11-15-2025",
    "start_time": "07:30 PM",
    "end_time": "09:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/acat-becky-nurse-of-salem-by-sarah-ruhl-06-11-2025-09-21-21",
    "venue_name": "The Playhouse at Waterville Station",
    "street": "17 Railroad Square",
    "city": "Waterville",
    "state": "ME",
    "zip_code": "04901",
    "phone": "2073192656",
    "email": "adcavand@hotmail.com",
    "website": "https://theplayhouse.me"
  },
  {
    "title": "MARGARET CHASE SMITH: Mrs. Smith Goes To Washington",
    "desc": "Coming NOVEMBER 13-22 to Footlights Theatre: MRS. SMITH GOES TO WASHINGTON by Linda Britt and starring Jackie Oliveri as Margaret Chase Smith. RESERVATIONS: (207) 747-5434. $25. ABOUT: A bold and timely play starring Jackie Oliveri as Margaret Chase Smith—Maine’s trailblazing congresswoman and senator who stood tall in a time of political fear and silence. The first woman elected to both the U.S. House and Senate, Smith was a proud Republican, a Skowhegan native, and a centrist who believed in consensus over chaos. This tour-de-force celebrates a political pioneer who brought out the best in people… and in politics. THU 7, FRI 730, SAT 2 & 730",
    "date": "11-15-2025",
    "start_time": "07:00 PM",
    "end_time": "08:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/margaret-chase-smith-mrs-smith-goes-to-washington-04-11-2025-09-35-21",
    "venue_name": "Footlights Theatre",
    "street": "190 US Route 1",
    "city": "Falmouth",
    "state": "ME",
    "zip_code": "04105",
    "phone": "(207) 747-5434",
    "email": "footlightsinfo@aol.com",
    "website": "http://www.thefootlightstheatre.com"
  },
  {
    "title": "Disco Fever Dance Party",
    "desc": "Come join the Downeast Dancers for our Disco Night Dance Party 11/15/25!!!  Ellsworth YMCA, with a hustle dance lesson 7-7:30 PM, open dancing afterwards. Don't miss the fun.  Come on out and shake the dance floor!!! FMI 244-5286",
    "date": "11-15-2025",
    "start_time": "07:35 PM",
    "end_time": "09:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/disco-fever-dance-party-28-10-2025-11-14-42",
    "venue_name": "YMCA Ellsworth",
    "street": "125 State Street",
    "city": "Ellsworth",
    "state": "ME",
    "zip_code": "04605",
    "phone": "2072445286",
    "email": "plnbuie@yahoo.com",
    "website": null
  },
  {
    "title": "Rose Cousins and Melissa Ferrick",
    "desc": "Two fabulous female singer songwriters one one stage.   Melissa Ferrick and R0se Cousins Melissa and her career as an artist and trailblazer. 30 years into a prolific career as a genre and gender-defying songwriter, Melissa Ferrick continues to disrupt normative categorization. Indie, Alternative, Folk, Punk…. from Ipswich, Massachusetts.Rose Cousins an acclaimed Canadian folk singer, songwriter, and multi-instrumentalist Rose Cousins’ songwriting plumbs the depths of the human condition. Her work has garnered her two JUNO Awards, two Canadian Folk Music Awards, eleven East Coast Music Awards and one Grammy nomination.",
    "date": "11-15-2025",
    "start_time": "08:00 PM",
    "end_time": "10:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/rose-cousins-and-melissa-ferrick-06-11-2025-09-30-21",
    "venue_name": "Stone Mountain Arts Center",
    "street": "695 Dug Way Road",
    "city": "Brownfield",
    "state": "ME",
    "zip_code": "04010",
    "phone": "207-935-7292",
    "email": "info@stonemountainartscenter.com",
    "website": "stonemountainartscenter.com"
  },
  {
    "title": "American Legion \"Charles E. Sherman Jr. Hall\" Post #36 Bi-Weekly Breakfast Buffet",
    "desc": "This American Legion Post #36 Breakfast Buffet has been a tradition spanning many years now. Aside from a few minor unforeseen and unavoidable changes, most everything else remains the same. All who enter the Legion Hall doors on a Breakfast Buffet Sunday, will get a great meal for a fair price/donation, get to see old friends and/or family, or meet someone interesting for the first time. The menu items have satisfied many folks over the years, and I have no doubt that this year will be no different. So come and enjoy the Legion Buffet Breakfast this season, enjoy the food, enjoy the camaraderie, and learn how you (Yes, You) can play a key role in this year's breakfast season - or next year's season. There are a number of very important people who make these breakfasts a success each year, if you have any interest in becoming a volunteer or member of the breakfast crew - ask for the least important person in the mix (Christopher) when you arrive for breakfast. These breakfast buffets take place every other Sunday starting on April 2, 2025.",
    "date": "11-16-2025",
    "start_time": "07:30 AM",
    "end_time": "09:00 AM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Nov 02, 2025 on Sunday",
    "url": "https://www.mainepublic.org/community-calendar/event/american-legion-charles-e-sherman-jr-hall-post-36-bi-weekly-breakfast-buffet-24-03-2025-09-34-38",
    "venue_name": "American Legion Post #36",
    "street": "25 Industrial Park Drive",
    "city": "Boothbay",
    "state": "ME",
    "zip_code": "04537",
    "phone": "207-633-4487",
    "email": null,
    "website": null
  },
  {
    "title": "Annual 2-day Makers Market Christmas Arts and Craft Show",
    "desc": "Join us Maine Made Crafts and newenglandcraftfairs.com for the Annual 2-day Christmas Makers Market Arts & Craft Show at our South Portland holiday shopping bonanza this year with our exciting event taking place at the South Portland High School Saturday & Sunday Nov 15 & 16, 2025, 9-4 PM both days.This show brings together a wide variety of talented artists and crafters, showcasing their unique creations. From handmade jewelry and home decor to original artwork, personalized gifts, & fresh made cheeses, wood products, to soaps and rubs, you'll find something special for everyone on your holiday shopping list, all at prices you can afford.Mark your calendar for the Annual Makers Market Arts & Craft Show, South Portland High School, 637 Highland Ave, South Portland, Me 04106 Saturday & Sunday Nov 15 & 16, 2025 9-4 PM both Saturday & Sunday.Explore the Cafeteria & hall filled with creativity and inspiration, chat with the artists themselves, and discover one-of-a-kind treasures that you won't find anywhere else. Whether you wish to support local artisans and makers, find an ideal holiday gift, or simply enjoy a pleasant day out, the Annual 2-day Christmas Makers Market Arts & Craft Show on November 15 & 16, 2025, from 9:00 AM to 4:00 PM on both days, is the perfect destination. Don't miss out on this fantastic opportunity for holiday shopping at the South Portland High School. We stay open until 4PM for all our customers.For more information call Steven or Lois @ 706-843-9188, STpromo37@aol.com or LTpromo@aol.com",
    "date": "11-16-2025",
    "start_time": "09:00 AM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/annual-2-day-makers-market-christmas-arts-and-craft-show-07-02-2025-17-49-41",
    "venue_name": "South Portland High School",
    "street": "637 Highland Ave",
    "city": "South Portland",
    "state": "ME",
    "zip_code": "04106",
    "phone": null,
    "email": null,
    "website": "www.southportlandmusicboosters.org"
  },
  {
    "title": "KCCV's 5th Annual Holiday Craft Fair",
    "desc": "Join us for a festive two-day shopping event featuring over 80 local sellers offering a wide variety of products, including handcrafted items, baked goods, jewelry, home décor, and more. Whether you're looking for unique holiday gifts or something special for yourself, you're sure to find it here.Event Features: • Photos with Santa • 50/50 Cash Raffle • Item Raffles • On-Site ConcessionsShow Dates: November 15th - 16th | 9 AM - 4 PMAdmission: FREELooking to be a vendor? Click the following link to learn more: https://www.kccvmaine.org/seller-application",
    "date": "11-16-2025",
    "start_time": "09:00 AM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/kccvs-5th-annual-holiday-craft-fair-23-10-2025-15-09-21",
    "venue_name": "Augusta Civic Center",
    "street": "76 Community Drive",
    "city": "Augusta",
    "state": "ME",
    "zip_code": "",
    "phone": null,
    "email": null,
    "website": null
  }
]