[
    {
        "url": "https://www.mainetourism.com/event/%e2%80%9cpapa-had-he-hair%3f%e2%80%9d%3a-george-washington%e2%80%99s-relics-and-revolutionary-war-memory-in-early-maine/10668/",
        "title": "“Papa, Had He Hair?”:  George Washington’s Relics and Revolutionary War Memory in Early Maine",
        "descriptionTab": "Join us for the inaugural\nWilliam David Barry Memorial Lecture\n, established through the generous 2024 gift from the\nH. H. & J. Holverson Trust\nin his memory. We are excited to welcome\nDr. Jamie L. Brummitt\n, historian of American religion and material culture and author of the forthcoming\nProtestant Relics in Early America\n(Oxford University Press, 2025), who will explore how relics, remembrance, and reverence shaped early American identity through stories and artifacts from Maine and beyond. The morning will include celebratory remarks and refreshments following the program.\nThe William David Barry Memorial Lecture Series Fund honors the influential career of historian and author William \"Bill\" Barry (1946–2023). Known for his pioneering research at the Portland Museum of Art and the Maine Historical Society (MHS), Barry expanded the understanding of Maine’s role in American history through work that reached from Maine to Hawaii to Washington, D.C.\nThe fund supports annual or biennial lectures and scholarly events at MHS, featuring visiting or MHS-affiliated speakers. The series highlights innovative Maine-related historical research, especially on lesser-known topics or emerging research methods. It upholds Barry’s commitment to \"speak the truth as shown by research.\"",
        "email_address": "info@mainehistory.org",
        "location": "489 Congress St.\nPortland, ME 04101",
        "start_time": "10:00 AM",
        "end_time": "12:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/200-hour-yoga-alliance-certified-in-person-yoga-teacher-training/10535/",
        "title": "200-hour Yoga Alliance-certified in-person Yoga Teacher Training",
        "descriptionTab": "Let us embrace you in the transformative experience of our 200-hour Yoga Alliance-Certified Yoga Teacher Training!\nEmpower your path through a container shaped by a legacy of healing. Our training takes place annually and is offered by three dedicated yogis with a combined 75+ years of yoga-teaching experience. Amrita, Ajeet, and Lindsay provide training that is rich in yogic practice, theory, techniques, and personal attention, as they reverently and joyfully infuse a depth of lived experience into the program.\nHighlights of Yoga Teacher Training at Sewall House Yoga Retreat\nSmall, personalized training\n: Limited to 6 participants, ensuring one-on-one attention and deeply supportive learning\nCertified program\n: Yoga Alliance‑certified 200‑hour format, eligible for RYT registration upon completion\nMixed‑style curriculum\n: Includes Hatha, Kundalini, Iyengar, Ashtanga, Nidra, yoga philosophy, pranayama, meditation, anatomy, and ethics\nTeaching practice included\n: Each trainee leads three one‑hour teaching sessions during the program for hands‑on learning\nExperienced instructors\n: Led by a team totaling 75+ years of teaching experience\nHistoric & serene setting\n: Sewall House, a restored family home in Island Falls, Maine, offers a quiet New England retreat in a small town surrounded by rivers, lakes, and woods",
        "email_address": "info@sewallhouse.com",
        "location": "Sewall House - Yoga Retreat\n1027 Crystal Rd.\nIsland Falls, ME 04747",
        "start_time": "",
        "end_time": "",
        "date": "June 8, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/2025-holiday-sip-and-shop/10466/",
        "title": "2025 Holiday Sip and Shop",
        "descriptionTab": "Join us for our second annual Holiday Sip and Shop at the Castine Historical Society! We have a great selection of Castine and Maine-themed gifts to meet all of your holiday needs. Enjoy complementary wine and snacks while you shop. The event will take place at the Abbott School, 17 School Street, Castine, Maine.\nYou can also shop our\nwebsite\n24/7 for gifts sent straight to your door!",
        "email_address": "",
        "location": "Castine Historical Society\n13 - 17 School St.\nCastine, ME 04421",
        "start_time": "3:00 PM",
        "end_time": "6:00 PM",
        "date": "December 10, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/2025-polar-express/10786/",
        "title": "2025 Polar Express",
        "descriptionTab": "HIS is the Polar Express!\nAll aboard…. to the North Pole!\nMaine Narrow Gauge warmly invites you to experience the Polar Express™ Train Ride! This magical train runs on select dates every holiday season.\nThe Polar Express™ Train Ride is the largest annual fundraiser for the Maine Narrow Gauge Railroad Co. & Museum. This theatrically-driven Christmas train has become an annual tradition for thousands of families, drawing over 23,000 passengers in 2023!\nThe fun begins at Portland’s Ocean Gateway Marine Terminal. Browse holiday and train-themed souvenirs. Before you know it, an enchanting scene is enacted at the station with live actors – they set the scene before your journey to the North Pole and invite you to come on the train.\nThe Conductor boards passengers onto the nine historic passenger coaches decked out for the holidays. Once on board, children are handed authentic golden tickets by the Conductor. Costumed chefs appear and serve hot chocolate and cookies to everybody on the train. Christmas music fills the cars as the steam locomotive blows its whistle, the wheels start turning, and your roundtrip ride to the North Pole begins.\nOnce at the North Pole, a very special guest boards the train and hands out the first gift of Christmas. The train begins its return journey back to Portland. Upon arrival, the atmosphere feels a little more magical, and passengers are inspired to\nbelieve\nin things that they can’t see.",
        "email_address": "info@mainenarrowgauge.org",
        "location": "Maine Narrow Gauge Railroad Co. & Museum\n49 Thames St\nPortland, ME 04101",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/2025-village-holidays-celebration-and-sale/10592/",
        "title": "2025 Village Holidays Celebration and Sale",
        "descriptionTab": "Kick off the holiday celebrations and welcome Santa as he visits the Village Green to light Bar Harbor's Christmas Tree. Where children of all ages will have the opportunity to see Santa. After Santa heads back to the north pole, stick around and support our local businesses by shopping during the village holidays sale.",
        "email_address": "",
        "location": "Bar Harbor Chamber of Commerce\n2 Cottage St.\nBar Harbor, ME 04609",
        "start_time": "",
        "end_time": "",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/250-years-of-an-american-christmas/10670/",
        "title": "250 years of an American Christmas",
        "descriptionTab": "Join cultural historian Pamela McColl, the author of\n’Twas the Night: The Art and History of the Classic Christmas Poem\n, as she explores the\nheartfelt stories, and poems of an American Christmas - 250 years in the making. McColl shines a spotlight on contributions by writers Henry Wadsworth Longfellow, Sophie May, Clement Clarke Moore, Emilie Poulson, Katherine Lee Bates and Harriet Beecher Stowe.  This engaging presentation will include the reading of excerpts and poems of these accomplished national treasures and promises to be a perfect cozy addition to your holiday activities this winter!\nAbout the speaker:\nPamela McColl\nis an award-winning author, publisher, and lecturer. She has spoken at over 150 museums across America, sharing with audiences her knowledge of the development of Christmas in America from a literary and art viewpoint. After studying art and history at the University of Manitoba, McColl worked for 25 years as a corporate art consultant. In the 1990’s she formed a publishing company devoted to bringing books of social and historical significance to the public. Her 2025 release,\nWondrous Mrs. Claus - A Literary and Pictorial Review of the Christmas Character\n, along with her other books, will be available at the Maine Historical Society gift shop, and she will be signing copies.",
        "email_address": "info@mainehistory.org",
        "location": "489 Congress St.\nPortland, ME 04101",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/35th-annual-holiday-light-parade/6576/",
        "title": "35th Annual Holiday Light Parade",
        "descriptionTab": "Holiday Light Parade\nTHEME: Elf\nDecember 7th, 2024\nParade begins at 6pm\nMain Street, Presque Isle, Maine\nThe Central Aroostook Chamber of Commerce will host the 35th Annual Holiday Light Parade on December 7th, 2024.\nIt is traditionally held on the first Saturday in December each year. The parade begins at 6:00 PM.\nThe line-up will begin at 4:30 PM at the UMPI campus. The parade will continue down Main Street, ending at the far entrance of the North Street Plaza.\nThe Chamber will uphold tradition and have the only Santa Claus on their float.\nPlease note; that any extra Santa’s will disqualify your entry.\nAbsolutely no candy throwing, it may be handed out.\nCategories for judging include:\nParade Champion\nBest Business\nBest Non-Profit\nBest Faith-Based\nBest General Float\nBest Youth Float\nPlease display a sign that clearly and boldly states the name of your business, organization, or club on the DRIVER’S SIDE of your float.\nJudging will take place as you pass the Reviewing Stand on Main Street. You must register for your float to be judged.\nIt is not necessary to have your entry completely planned before registering with the Chamber.\nJust inform us of your decision to enter so we may compile the Line-up.\nThere is no fee to enter.\nClick here to register your float:\nhttps://centralaroostookchamber.com/.../holiday-light.../",
        "email_address": "info@centralaroostookchamber.com",
        "location": "Central Aroostook Chamber of Commerce\n3 Houlton Rd.\nPresque Isle, ME 04769",
        "start_time": "6:00 PM",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/35th-annual-national-toboggan-championships/10405/",
        "title": "35th Annual National Toboggan Championships",
        "descriptionTab": "The Snow Bowl has that friendly small-town feel, and still rivals the best mountains in Maine, with nearly 1,000 feet of vertical elevation, 15 trails, 11 glades and two terrain parks. We also offer lessons and equipment rental for all ages.\nOwned by the Town of Camden, the Snow Bowl is managed and operated by full time on-site town staff along with a complement of nearly 100 seasonal employees and volunteers.\nTHE WORLDS\nHeld every five race years, the first place winner in the 4-Person division in any year prior to the upcoming Worlds year (35th) is eligible to race. Each eligible team must be comprised of at least one original team member to qualify. The fastest single run of the qualifying teams determines the final standings and the winner.",
        "email_address": "",
        "location": "Camden Snow Bowl\n20 Barnestown Road, P.O. Box 1207\nCamden, ME 04843",
        "start_time": "",
        "end_time": "",
        "date": "February 6, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/36th-annual-augusta-last-minute-christmas-arts-%26-craft-show-part-1om-augusta-armory)/5346/",
        "title": "36th Annual Augusta Last Minute Christmas Arts & Craft Show Part 1om Augusta Armory)",
        "descriptionTab": "Maine Made Crafts will host its 35th Annual Last Minute Christmas Arts &\nCraft Fair at the Augusta Armory Part 1 with artists & crafters from Maine and New England Saturday December 13, 9-4 PM & Sunday December 14, 9-4 PM, located at 179 Western Ave., Augusta I-95 exit 109.\nIt's the perfect time to finish your holiday gift purchases from our talented artisans selling their one-of-a-kind gifts from wood items, quilt work, knits & crochet, jams & jellies, dolls, jewelry, and much more all at prices you can afford.\nGive a gift with meaning,\ngive a gift of quality,\ngive a gift made in the USA at our craft show at the Augusta Armory, from food to knits to lamps and everything in between.\nWe stay open until 4PM for all our customers.\nFor more information call Steven or Lois @ 706-843-9188,\nSTpromo37@aol.com\nor\nLTpromo@aol.com\nPromoted by Maine Made Crafts www.newenglandcraftfairs.com",
        "email_address": "LTpromo@aol.com",
        "location": "179 Western Ave.,\nAugusta, ME, ME 04330",
        "start_time": "9:00 AM",
        "end_time": "4:00 PM",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/38th-annual-augusta-last-minute-arts-%26-craft-show-part-2/5347/",
        "title": "38th Annual Augusta Last Minute Arts & Craft Show Part 2",
        "descriptionTab": "Maine Made Crafts/newenglandcraftfairs.com will host its 38th Annual Last Minute Christmas arts &\nCraft Fair at the Augusta Armory December 20 & 21 2025 (our very last craft show of the season) featuring quality artists & crafters from Maine and New England selling their one-of-a-kind products that you will be proud to give as gifts.\nEach show will have a few of the same and many different crafters all at the Augusta Armory, 179 Western Ave, Rt 202 by the airport on Saturday & Sunday December 20 & 21, 2025 9-4 PM both days.\nIt's the perfect time to pick up your holiday gifts purchased from our talented artisans from wood items, quilt work, knits & crochet, jams & jellies, dolls, jewelry, games, photography, authors selling & signing their work, and much more all at prices you can afford at the last craft show of the 2025 season.\nAll quality crafters are invited to display their work at our shows.\nWe stay open until 4PM for our customers.\nGive a gift with meaning,\nGive a gift of quality,\nGive a gift made in the USA at New England Craft Fairs at the Augusta Armory. Purchase all your Christmas gifts in one place. Buy local and save. don't forget this is the last show of the season & this is the show many wholesalers visit for the following year.\nFor more information call Steven or Lois @ 207-946-7079, STpromo37@aol.com or LTpromo@aol.com",
        "email_address": "LTpromo@aol.com",
        "location": "179 Western Ave\nAugusta, ME 04330",
        "start_time": "9:00 AM",
        "end_time": "4:00 PM",
        "date": "December 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/40-years-of-celt/10465/",
        "title": "40 Years of CELT",
        "descriptionTab": "40 years of the Cape Elizabeth Land Trust. The program will start at 6:30 in the Community Room at Thomas Memorial Library. It is free and open to the public. Light refreshments will be served.",
        "email_address": "",
        "location": "Cape Elizabeth Historical Pres Society\nFort Williams Park, 1000 Shore Road, Bldg 326\nCape Elizabeth, ME 04107",
        "start_time": "6:30 PM",
        "end_time": "",
        "date": "November 18, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/40th-annual-wells-maine-christmas-parade/9266/",
        "title": "40th Annual Wells Maine Christmas Parade",
        "descriptionTab": "Annual Wells Christmas Parade\nStep-off at 2pm at Wells Plaza, travels north to Wells Junior High School\nThe parade promises lots of holiday cheer and good will to everyone as the most wonderful time of the year dawns near.\nFree to enter & Free to watch.\nSponsored by the Wells Chamber of Commerce.",
        "email_address": "wellachamber@wellschamber.org",
        "location": "Wells Chamber of Commerce\nWells Plaza\nWells, ME 04090",
        "start_time": "",
        "end_time": "",
        "date": "December 14, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/44th-annual-christmas-prelude/10383/",
        "title": "44th Annual Christmas Prelude",
        "descriptionTab": "Christmas Prelude: 44 Years of Magic\nHGTV called Kennebunkport the #2 Christmas Town in America\nCountry Living called Kennebunkport one of the Top 20 Christmas family vacation destinations IN THE WORLD!\nPicture a Hallmark Christmas movie coming to life: The festive lights, the greenery, the towering tree in the center of the square, the community coming together.\nThe good news is that the world doesn’t only exist in the movies: You can experience it in Kennebunkport each year during Christmas Prelude.\nTree lightings, Santa arriving by lobster boat, caroling at the Franciscan Monastery, a beautiful fireworks display, a lively street festival, and more are just some of the highlights of the 11-day event. So make Christmas part of your holiday traditions and watch the magic come alive!",
        "email_address": "",
        "location": "Kennebunk-Kennebunkport-Arundel Chamber of Commerce\n16 Water St.\nKennebunk, ME 04043",
        "start_time": "",
        "end_time": "",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/46th-annual-christmas-in-new-england-arts-and-crafts-show/10461/",
        "title": "46th Annual Christmas in New England Arts and Crafts Show",
        "descriptionTab": "The 46th Annual Christmas in New England Arts and Craft Show is back at the Augusta Civic Center, November 29th & 30th, 2025!\nShow Hours\n: Saturday & Sunday | 9-4 PM\nAdmission\n: Adults $5, children 12 and under Free\nAre you interested in becoming a vendor for the show? Click the following link for more information:\nhttps://www.newenglandcraftfairs.com/showfees.html\nFor questions, call Lois at 706-843-9188 or Steven at 207-946-7079. Or email,\nLTpromo@aol.com",
        "email_address": "",
        "location": "Augusta Civic Center\n76 Community Dr.\nAugusta, ME 04330",
        "start_time": "5:00 PM",
        "end_time": "7:30 AM",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/48th-annual-christmas-in-new-england-arts-%26-craft-show/5344/",
        "title": "48th Annual Christmas in New England Arts & Craft Show",
        "descriptionTab": "Welcome to the 48th Annual Thanksgiving Weekend Christmas in New England Arts & Craft Show!\nJoin us on\nSaturday, November 29, 2025\n& Sunday,\nNovember 30, 2025\nat the\nAugusta Civic Center\nfor a delightful celebration of the holiday season. This cherished event brings together talented artisans and crafters from all over New England to showcase their unique creations.\nGet ready to immerse yourself in a festive atmosphere filled with an array of handmade crafts, beautiful artwork, and\none-of-a-kind gifts\n. From intricate jewelry and hand-stitched textiles to stunning pottery and captivating paintings, there is something for everyone at this arts and craft show.\nExplore a wide variety of\nhandcrafted treasures\nfrom talented artisans and crafters from all over New England,\nIndulge yourself\nin the joy of holiday shopping as you explore the various booths and discover treasures that will make perfect gifts for your loved ones. Whether you're seeking a special piece of decor for your home or a personalized gift that will leave a lasting impression, you'll find it here.\nAside from the incredible selection of crafts, the event offers a wonderful opportunity to\nconnect with fellow art enthusiasts\nand engage in conversations with the talented artisans themselves. Gain insights into their creative processes and inspirations, and perhaps even find inspiration for your own artistic endeavors.\nMake sure to fuel your shopping adventures with delicious treats from the food vendors scattered throughout the venue. Enjoy\nmouthwatering snacks\n, hot beverages, and seasonal goodies that will keep you energized throughout the day.\nSo mark your calendars\nand don't miss out on this beloved annual tradition.\nJoin us at the Augusta Civic Center on November 29, & November 30, 2025\n, for a day filled with holiday cheer, artistic wonders, and the joy of finding that perfect handmade gift.\nGive a gift made in the USA at our largest craft show of the season at the Augusta Civic Center. You will always see different crafters at all our craft shows along with your favorites. For more information call Steven or Lois @ 706-843-9188 or 207-946-7079, STpromo37@aol.com or LTpromo@aol.com\nNovember 29, & November 30, 2025\nwith over 130 booths both big and small, where all quality artists and craftsmen are always invited to display their work..",
        "email_address": "LTpromo@aol.com",
        "location": "76 community Dr.,\nAugusta, 04330",
        "start_time": "9:00 AM",
        "end_time": "4:00 PM",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/4th-annual-festival-of-baskets/10646/",
        "title": "4th Annual Festival of Baskets",
        "descriptionTab": "Join us for the Chamber's largest fundraiser!\nDonate a basket of at least $50 in value to be raffled off to the lucky winner. Or buy tickets for a chance to win!\nWinners chosen at random and do not need to be present to win.\nNovember 11 - December 13\nTuesday-Friday 9-4:30pm\nwith two Saturdays Dec. 6 and 13, 10-1pm\nTickets\n$1 each, 3/$2, or 10/$5\ndrawing held on Dec. 13",
        "email_address": "info@stjohnvalleychamber.org",
        "location": "St. John Valley Chamber of Commerce\n356 Main St.\nMadawaska, ME 04756",
        "start_time": "9:00 AM",
        "end_time": "4:00 PM",
        "date": "November 11, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/a-charlie-brown-christmas-heather-pierson-trio-2025/10137/",
        "title": "A Charlie Brown Christmas-Heather Pierson Trio 2025",
        "descriptionTab": "Heather, piano and vocals; Shawn Nadeau, bass; and Craig Bryan, drums) shares their interpretation of Vince Guaraldi’s iconic soundtrack of “A Charlie Brown Christmas”, additional Guaraldi compositions, and other holiday favorites.\nThe musical score for “A Charlie Brown Christmas”, composed by the late\nVince Guaraldi\nand first broadcast in December of 1965, is just as poignant and touching as the story and includes the hugely popular hit “Linus and Lucy”. His gentle jazz riffs established musical trademarks that, to this day, still prompt smiles of recognition. The Heather Pierson Trio performs the entirety of the Charlie Brown Christmas album as recorded by the Vince Guaraldi Trio, as well as other Guaraldi compositions.",
        "email_address": "info@denmarkarts.org",
        "location": "Denmark Arts Center\n50 West Street\nDenmark, ME 04022",
        "start_time": "7:00 PM",
        "end_time": "8:30 PM",
        "date": "December 11, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/a-christmas-carol/10387/",
        "title": "A Christmas Carol",
        "descriptionTab": "This holiday season, immerse yourself in the enchanting world of Charles Dickens’s beloved tale, “A Christmas Carol,” as it comes to the historic Brick Store Museum on Sunday, November 23, 2025, at 5:00 PM.  With its rich history and classic charm, this timeless production promises to kindle the festive spirit and touch your heart with its powerful message of redemption and goodwill.\nVeteran actor Johnny Kinsman will perform an elaborate reading of Dickens’s cherished story featuring the miserly Ebenezer Scrooge, his spirited encounters with the Ghosts of Christmas Past, Present, and Yet to Come, and the heartwarming transformation that follows. The story will come alive with the musical talents of violinist Justin Ouellet and soprano Ann Moss to enhance the magical experience.\nBring your loved ones to share in the joy and wonder of a Dickens Christmas, and enjoy a heartwarming evening that will become a cherished holiday tradition.\n(Recommended for ages 6+)\n+\nIf you are a Museum Member, your tickets are discounted! Use your Member Code for $5 off each ticket. You can find your your code in the\nMember Portal\n.",
        "email_address": "",
        "location": "Brick Store Museum\n117 Main St.\nKennebunk, ME 04043",
        "start_time": "5:00 PM",
        "end_time": "7:00 PM",
        "date": "November 23, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/a-colonial-christmas/10742/",
        "title": "A Colonial Christmas",
        "descriptionTab": "Join us for Tate House Museum’s annual one-day only event of the season:\nA Colonial Christmas\non Saturday, December 13 from 12:00 noon to 5:00 PM with holiday-themed interpretations in the Tate House from 12 noon- 3:00 pm. During this 3-hour Open House, visitors will experience the Tate House seasonally decorated for the period, hear performers in 18th  century attire describe colonial customs and traditions around the holidays in a merchant-class British household, and enjoy colonial games.\nNEW\nthis year: stories of the Tate family experience during the unrest of the American Revolution following the bombardment of the town on October 18, 1775.\nVisitors will enjoy live harp and lute music by the\nColonial Troubadours\n, and learn about and sample special foods and drinks made for Christmas, New Years, and Twelfth Night celebrations.\nHave your photo taken under our lovely green arbor over the Tate House door and visit our Colonial Shop with many new gifts from 12-6 pm.\nJoin our colonial tavern keeper as he prepares and shares the popular colonial drink\n“\nFLIP” in 18th century fashion from 3:00-4:00 pm.\nNEW\nthis year, help us\nBurn the Tea\nto protest the King’s tax on tea, an event that happens annually in\nLexington on Dec 13, 1775\n.\nAdmission prices are: $18 adults, $12 children (ages 7-17, 6 and under free) $45 family of four (2 adults and 2 children). THM and SNA members as well as Homeschools and Girl/Boy Scouts receive $2-5 off ticket prices ($16 for adults, $10 for children, and $40 for families)\nNew memberships\nat the event receive half price entry ($9 with individual membership at $35, and $22 for a family with a new $50 family membership)\nTickets are available at tatehouse.org and will also be sold at the door.\nA tree lighting at Means House with carol singing will be hosted by the Stroudwater Neighborhood Association from 4:00-5:00 pm.  Participation is this part of the event is free and open to the public.\nCome out to celebrate the holiday season and support the educational mission of Tate House Museum!",
        "email_address": "hkhurd@tatehouse.org",
        "location": "Tate House Museum\n1267 Westbrook St.\nPortland, ME 04102",
        "start_time": "12:00 PM",
        "end_time": "5:00 PM",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/acadia-birding-festival/10739/",
        "title": "Acadia Birding Festival",
        "descriptionTab": "Join us for the 27th Annual Acadia Birding Festival on Mount Desert Island and surrounding areas on May 28th-May31st. We will have keynote speakers Sophie Osborn and Nick Lund. Choose from our extensive list of exciting field trips on our preliminary 2026 schedule. Definitely bring your binoculars. In addition, you might consider bringing a notepad/sketch pad, camera, and scope if you have one. Bring warm clothes, rain gear, and mosquito repellent.  The weather can be cool or hot. Typically in late May and early June we can expect temperatures in the 60s and 70s. It could be clear or rainy.  If you are signed up to do the Pelagic Seabird Boat Trip, bring WINTER clothes.  It is always cold out on the water. You must register online prior to the festival. Pre-registration will open in March, and selection of events in early April. All communication will be by email. To learn more about how registration works, please visit the\nREGISTRATION page\n.\nDon't miss our\nPELAGIC SEABIRD BOAT TRIP\nSaturday\nMay 30, 2026\nPUFFINS, GANNETS, RAZORBILLS, MURRES, TERNS, SHEARWATERS, STORM-PETRELS, and more\nA PARK PASS IS REQUIRED if you plan to drive your car into Acadia National Park. Many of our field trips are in the Park. If the trip name includes the letter \"(ANP)\" then the trip is in Acadia National Park, and you need a park pass. You can purchase a pass online at\nhttps://www.nps.gov/acad/planyourvisit/fees.htm\nor buy at the ANP Visitor's Center in Hulls Cove, or the Southwest Harbor Chamber (inside the Harbor House on Main St) as well as a few other locations on MDI. If you are 62 or over, you can purchase an ANNUAL PASS for $20. Otherwise, a week-long CAR PASS (for anyone) is $35. If you already have a senior National Park Pass, then there is no need to buy another pass.",
        "email_address": "",
        "location": "Acadia Birding Festival\nCauseway Club, 10 Fernald Point Rd\nSouthwest Harbor, ME 04679",
        "start_time": "",
        "end_time": "",
        "date": "May 28, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/accessible-beginner-birding-at-gilsland-farm/10763/",
        "title": "Accessible Beginner Birding at Gilsland Farm",
        "descriptionTab": "The Accessible Beginner Bird Walks are inclusive, accessible, and designed for true beginner birders. Our route will be a loop covering approximately 900 feet. We’ll travel slowly on flat gravel and compacted lawn. We’ll make frequent stops, with seats available at all stops. There is an opportunity to turn around through the building after our first stop at a bird feeder. This outing will focus on watching birds at our feeders and looking over the pond and meadow. There will be instructions for using binoculars and tips for birding by ear. Binoculars will be provided. Accessible bathrooms are located inside the Nature Center, and there will be van-accessible parking close to the building.\nClick here for a map of our route with stops.\nPlease reach out to Field Naturalist Stacia Brezinski with questions or concerns:\nsbrezinski@maineaudubon.org\n.\nTuesdays 9/9, 10/7, 11/18 (8-9:30 am)",
        "email_address": "",
        "location": "Time:\n8:00 AM to 9:30 AM",
        "start_time": "",
        "end_time": "",
        "date": "November 18, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/aging-naturally-powerfully-and-beautifully/10524/",
        "title": "Aging Naturally, Powerfully, and Beautifully",
        "descriptionTab": "For Women who are preparing for, or currently experiencing, the Change of Life\nJoin three experienced, older yoginis — Donna “Amrita” Davidge, Linda Rowe, Ajeet Khalsa — who will share their knowledge and expertise, as well as their own experiences, in a personalized, heartfelt, and safe environment.\nDonna’s experience with many forms of yoga, Linda’s expertise in Ayurveda, and Ajeet’s knowledge of the Power of Herbs combine to form this Aging Naturally, Powerfully, and Beautifully special retreat. You will find it to be a rich opportunity to explore tools you can use during all phases of menopause, so you can grow into aging with power and beauty.",
        "email_address": "info@sewallhouse.com",
        "location": "Sewall House - Yoga Retreat\n1027 Crystal Rd.\nIsland Falls, ME 04747",
        "start_time": "",
        "end_time": "",
        "date": "July 2, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/allagash-brewery-tours/8475/",
        "title": "Allagash Brewery Tours",
        "descriptionTab": "Sample 4 specialty beers while enjoying the incredible ambiance of The Cellars at Allagash, located at 100 Industrial Way (adjacent to our public Tasting Room). Tours happen multiple times a day, see website link for booking information.\nThis is a production space so sadly dogs are not allowed. If one of your guests is not planning on drinking, select Designated Driver to purchase a discounted ticket.\n*Sorry, we can't accommodate visitors under 21, even when accompanied by 21+ individuals.",
        "email_address": "info@allagash.com",
        "location": "Allagash Brewing Company\n50 Industrial Way\nPortland, ME 04103",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/almost-maine/10416/",
        "title": "Almost Maine",
        "descriptionTab": "In an almost town that is so far north in Maine that it’s almost Canada, we discover a community that is almost getting through the winter.  On a cold, clear night filled with stars, we see nine stories where connections are forged and split, where hearts are bound and broken, and where magic appears along with the northern lights.  John Cariani’s beloved Maine masterpiece is back on our stage after nearly 20 years, reminding us all of the power of love and the importance of belief.",
        "email_address": "",
        "location": "Penobscot Theatre Company\n131 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "January 29, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/an-evening-with-morgan-myles/10615/",
        "title": "An Evening with Morgan Myles",
        "descriptionTab": "Morgan Myles is a Nashville powerhouse with a five-octave range, who rose to prominence with a third-place finish on NBC’s “The Voice”, 30+ million views on YouTube, and a standing ovation at her Grand Ole Opry debut. A multi-instrumentalist and touring artist, she has opened for Luke Bryan, Jake Owen, and Kane Brown, performing over 100 shows a year. Her authenticity and hard-earned success have garnered attention from major outlets like Billboard, American Songwriter, Rolling Stone, and CMT, setting her apart from the cookie-cutter country starlets.\nMyles is now set to release new music with KZZ Music/Blue Élan, embracing a more grounded artistic expression after years of navigating Nashville's rules. Her music defies genre boundaries, blending country, rock, soul, and Americana, reflecting influences from Carole King to the Queens of the Opry stage. According to pop sensation Camila Cabello, “Morgan is country, and she always has been, but she’s her own versatile expression of it.” With a focus on connection through her storytelling, Myles is primed to turn her recent success into a career that resonates deeply with everyday lives.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "7:30 PM",
        "end_time": "",
        "date": "November 21, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/annual-christmas-by-the-sea/10384/",
        "title": "Annual Christmas by the Sea",
        "descriptionTab": "Welcoming the holiday season, this 39th annual event is a cherished tradition for many Ogunquit visitors and residents. The Christmas by the Sea festival includes tree and bridge lightings, concerts, craft shows, children's activities, a parade, bonfire, fireworks, Santa and so much more. Take a look below for our most updated event schedule and interactive event map!",
        "email_address": "",
        "location": "Ogunquit Chamber of Commerce\n20 Shore Road\nOgunquit, ME 03907",
        "start_time": "",
        "end_time": "",
        "date": "December 12, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/annual-fall-book-sale-at-maine-maritime-museum/10693/",
        "title": "Annual Fall Book Sale at Maine Maritime Museum",
        "descriptionTab": "Unique? Rare? One-of-a-kind?\nOut-of-print books?\nWhat will you find?!\nTaking place Friday–Sunday in Sewall Hall, shop our annual fall book sale. You look forward to it every year! Remember: admission is never required to shop the museum store, and our hours are always 9:30 am – 5:00 pm.\nDonations to the annual book sale will be accepted from September 1—October 30.",
        "email_address": "",
        "location": "Maine Maritime Museum\n243 Washington St.\nBath, ME 04530",
        "start_time": "9:30 AM",
        "end_time": "5:00 PM",
        "date": "November 21, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/annual-makers-market-christmas-arts-%26-craft-show/5348/",
        "title": "Annual Makers Market Christmas Arts & Craft Show",
        "descriptionTab": "Join us Maine Made Crafts and newenglandcraftfairs.com for the Annual\n2-day Christmas Makers Market Arts & Craft Show a\nt our South Portland holiday shopping bonanza this year with our exciting event taking place at the\nSouth Portland High School\nSaturday & Sunday Nov 15 & 16, 2025, 9-4 PM both days.\nThis show brings together a wide variety of talented artists and crafters, showcasing their unique creations. From handmade jewelry and home decor to original artwork, personalized gifts, & fresh made cheeses, wood products, to soaps and rubs, you'll find something special for everyone on your holiday shopping list, all at prices you can afford.\nMark your calendar for the\nAnnual\nMakers Market Arts & Craft Show,\nSouth Portland High School, 637 Highland Ave, South Portland, Me 04106\nSaturday & Sunday Nov 15 & 16, 2025​ 9-4\nPM both Saturday & Sunday.\nExplore the Cafeteria & hall filled with creativity and inspiration, chat with the artists themselves, and discover one-of-a-kind treasures that you won't find anywhere else.\nExplore the Cafeteria & hall filled with creativity and inspiration, chat with the artists themselves, and discover one-of-a-kind treasures that you won't find anywhere else. Whether you wish to support local artisans and makers, find an ideal holiday gift, or simply enjoy a pleasant day out, the Annual\n2-day Christmas Makers Market Arts & Craft Show\non\nNovember 15 & 16, 2025\n, from 9:00 AM to 4:00 PM on both days, is the perfect destination.\nDon't miss out on this fantastic opportunity for holiday shopping at the South Portland High School.\nWe stay open until 4PM for all our customers.\nFor more information call Steven or Lois @ 706-843-9188, STpromo37@aol.com or LTpromo@aol.com",
        "email_address": "LTpromo@aol.com",
        "location": ", 637 Highland Ave,\nSouth Portland, ME 04106",
        "start_time": "9:00 AM",
        "end_time": "4:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/another-kick-in-your-dickens/10420/",
        "title": "Another Kick in Your Dickens",
        "descriptionTab": "A Christmas Carol like you’ve never seen it before—because it changes every night.\nThis adults-only holiday comedy from ImprovAcadia and Penobscot Theatre Company is back after two sold-out runs in 2018 and 2022. With improvised songs, wild plot twists, and more wigs than sense, this unscripted spin on the Dickens classic is fast, filthy, and full of holiday cheer.\nDon’t miss your shot to laugh your way through the most unpredictable Christmas show in Maine!",
        "email_address": "",
        "location": "Penobscot Theatre Company\n131 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "December 4, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/art-in-bloom-2026/10569/",
        "title": "Art in Bloom 2026",
        "descriptionTab": "Art in Bloom has become a can’t-miss event for PMA members, art and floral enthusiasts, and visitors throughout the region. Featuring floral work by designers, artists, farmers, and florists from across southern Maine, the museum comes alive with fragrant blooms, extravagant displays, and incredible floral installations of all types—each inspired by an artwork from the museum’s collection.",
        "email_address": "",
        "location": "Portland Museum of Art\n7 Congress Sq.\nPortland, ME 04101",
        "start_time": "10:00 AM",
        "end_time": "8:00 PM",
        "date": "March 25, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/art-in-focus/10727/",
        "title": "Art in Focus",
        "descriptionTab": "Engage directly with works of art in the Farnsworth Art Museum through\nArt in Focus\non the fourth Wednesday of the month at noon. Docent educators lead a 20-minute deep dive discussion to invite guests to look slowly and explore one work of art in the galleries. These interactive gallery conversations allow you to consider an artwork thoughtfully and thoroughly.\nPre-registration is not required. Inquire at the Visitor Services desk upon your arrival for more information.",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "12:30 PM",
        "date": "November 26, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/artist-visit%3a-elise-morissette/10683/",
        "title": "Artist Visit: Elise Morissette",
        "descriptionTab": "Visit the Children’s Museum of New Hampshire today during the morning play session, 9am–Noon, and meet one of our Gallery 6 artists, Elise Morissette, at 10:30am. Elise will guide visitors as they try some Suminagashi—Floating Ink Art! Try this relaxing style of printmaking where water carries ink in swirls and colorful rings. No experience necessary and perfect for all ages. The fun is included with museum admission and free for Members. Elise’s work is currently on view in the museum’s Gallery 6 “Stroll the Rainbow” art exhibition.",
        "email_address": "neva@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street\nDover, NH 03820",
        "start_time": "10:30 AM",
        "end_time": "12:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/baby-storytime/10601/",
        "title": "Baby Storytime",
        "descriptionTab": "Babies (ages 6 months–2 years) and their caregivers are welcome to join Baby Storytime at the Children’s Museum of NH! This weekly program features songs, rhymes, movement ideas, and books for babies and their caregivers and introduces important pre-literacy skills along the way! This drop-in program and informal playgroup is a great way to socialize with other babies and caregivers. Want to join in? Simply reserve spots in the museum’s morning play session that correspond to the date of the Baby Storytime you want to join—it’s included with museum admission and, as always, free for Members! Reserve online at\nhttps://childrens-museum.org/programs/toddlerfest/",
        "email_address": "neva@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street, 6 Washington Street\nDover, NH 03820",
        "start_time": "9:30 AM",
        "end_time": "10:00 AM",
        "date": "October 1, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/ballroom-series%3a-katherine-blanford/10605/",
        "title": "Ballroom Series: Katherine Blanford",
        "descriptionTab": "Originally hailing from Kentucky, Katherine Blanford is known for her human Golden Retriever presence on stage. After racking up millions of views on her Don’t Tell Comedy set, Katherine hit the road sharing confessions of her southern family secrets and awkward adolescent years across the country and internationally.\nKatherine has appeared twice on The Tonight Show starring Jimmy Fallon, and After Midnight with Taylor Tomlinson. Most recently, Katherine was featured on Deadline’s “Comedians Ready to Break Out in 2025” and selected\nto be a New Face at the prestigious 2025 Just For Laughs Festival.\nKatherine released her debut special, Catholic Cowgirl, with 800LB Gorilla Records in December 2024.\nNot bad for a girl whose parents are cousins.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "December 3, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/balsam-wreath-making-workshop-at-fields-pond/10783/",
        "title": "Balsam Wreath Making Workshop at Fields Pond",
        "descriptionTab": "In this class, we will learn how to make holiday wreaths, using balsam, white pine, and cedar. We will also go over how to make swags and garlands.\nSupplies provided: Balsam tips, 12-inch ring, wire, 2.5-inch ribbon for a bow, and other natural decorations.\nMembers $50, nonmembers $65",
        "email_address": "kgayton@maineaudubon.org",
        "location": "Fields Pond Audubon Center\n216 Fields Pond Rd.\nHolden, ME 04429",
        "start_time": "10:00 AM",
        "end_time": "12:00 PM",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/birch-bark-basketmaking-workshop-at-fields-pond/10785/",
        "title": "Birch Bark Basketmaking Workshop at Fields Pond",
        "descriptionTab": "Introduction to Birch Bark Baskets\nThis class will cover all the steps in making a birch bark basket. We will head out into the woods and learn how to identify the trees, how to collect the bark from downed trees, how to process the bark, and finally, how to make a basket.\nThe course fee will cover all materials and instruction.\nMembers $50, nonmembers $65",
        "email_address": "kgayton@maineaudubon.org",
        "location": "Fields Pond Audubon Center\n216 Fields Pond Rd.\nHolden, ME 04429",
        "start_time": "1:00 PM",
        "end_time": "4:00 PM",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/bird-chatter%3a-wintering-birds-of-western-mount-desert-island/10744/",
        "title": "Bird Chatter: Wintering Birds of Western Mount Desert Island",
        "descriptionTab": "This session of Bird Chatter will begin indoors at Wendell Gilley Museum. After a brief update on the latest bird news, participants will car caravan to a local hotspot or two, led by field ornithologist Seth Benz. The destination depends upon area bird activity – tentative stops include the Southwest Harbor Coast Guard Station and Seawall Beach/Picnic Area. Grebes, loons, and sea ducks are likely species to share the spotlight. And at least one prediction, from the Finch Research Network, forecasts a good finch incursion in 2025 – think Crossbills!\nBring binoculars; a spotting scope will be provided. Binoculars are available to borrow from the Gilley with advance notice; make a note in the comments section when you sign up. Be sure to dress in layers suitable for the weather. Group size is limited to 14.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "9:00 AM",
        "end_time": "12:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/bird-walk-at-gilsland-farm/10760/",
        "title": "Bird Walk at Gilsland Farm",
        "descriptionTab": "Join us for a weekly bird walk at Gilsland Farm, led by Maine Audubon’s Staff Naturalist Doug Hitchcox and others. Meet in the parking lot, in front of the Visitor Center, where we’ll begin a slow walk around the property to look and listen for birds using Gilsland’s diverse habitats.\nFree, no registration required.\nThe walk typically covers between 1 to 2 miles (1.5 – 3 km). Waterproof shoes are recommended as the paths can be damp with dew in the mornings and icy when frozen. Please bring your binoculars, but we do have extra pairs if you need them, just ask the walk leader when you arrive. A list of recent sightings from Gilsland Farm can be found here:\nhttps://ebird.org/\nhotspot/L251783\nWalks are free.\nNote: NO walk on Thanksgiving (November 27). In December, walk time shifts to 8-10 am.",
        "email_address": "",
        "location": "Time:\n7:00 AM to 9:00 AM\nRecurrence:\nRecurring weekly on Thursday",
        "start_time": "",
        "end_time": "",
        "date": "November 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/blank-space-a-taylor-swift-tribute-band/10334/",
        "title": "Blank Space A Taylor Swift Tribute Band",
        "descriptionTab": "Blank Space is the ultimate Taylor Swift tribute band, dedicated to recreating the magic of the Eras Tour with authenticity and passion. Featuring stunning costumes, flawless choreography,  and all of Taylor’s greatest hits, Blank Space delivers a world-class experience for Swifties of all ages.\nBlank Space is not just a concert—it’s a celebration of music, connection, and the unparalleled artistry of Taylor Swift. Whether you’re a lifelong Swiftie\nor a casual listener, Blank Space invites you to sing, dance, and relive every moment of Taylor’s\nincredible career.\nTickets on sale on August 11th!",
        "email_address": "",
        "location": "Husson University\n1 College Circle\nBangor, ME 04401",
        "start_time": "4:00 PM",
        "end_time": "",
        "date": "November 23, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/bob-marley-comedy/10620/",
        "title": "Bob Marley Comedy",
        "descriptionTab": "“Marley’s brand of high energy and off beat observation of everyday life things has captured the minds of fans of all ages including teenagers to grandparents in their 80’s. Making his first television appearance on Comedy Central, he is now one of the few comics to do the complete late night circuit including The Late Show with David Letterman, The Tonight Show with Jay Leno, Late Night with Conan O’Brien.\nThis event held inside in our Upstairs Listening Room.\n\"A joy explosion\" - \"The most fun we've had in years\" - Experience the holiday tradition that transforms Christmas entertainment into pure magic.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "8:00 PM",
        "end_time": "",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/boothbay-harbor-region-sculpture-trail/1343/",
        "title": "Boothbay Harbor Region Sculpture Trail",
        "descriptionTab": "The Boothbay Harbor Region (one hour north of Portland), is situated along the Rocky Coast of Maine and is well known for its picturesque and exquisite beauty. Every year, hundreds of thousands of visitors and summer residents travel to the Region to enjoy its natural beauty, the quaint charm of the Harbor, great food, shopping and a robust arts community.\nThe Sculpture Trail, established in 2017 by the\nBoothbay Harbor Region Chamber of Commerce\n, exhibits completed sculptures outside local businesses and institutions in downtown Boothbay Harbor, and will soon extend throughout the peninsula. As part of Sculpture Boothbay's partnership with the Boothbay Region Land Trust, one of the first sculptures on the Trail outside of the downtown corridor will be placed at Oak Point Farm following the\nPoints of View Art Auction in 2017\n.\nPrinted guides for the Sculpture Trail can be found at\nBoothbay Harbor Region Chamber of Commerce\nlocations and throughout the region.​\nAll sculptures on the trail are for sale. Sales can be arranged directly with the artists.\nContact information is provided on the\ninteractive map\nand in the printed guide.\n207-633-2353",
        "email_address": "lisa@boothbayharbor.com",
        "location": "207-633-2353\nEmail",
        "start_time": "",
        "end_time": "",
        "date": "June 1, 2018"
    },
    {
        "url": "https://www.mainetourism.com/event/boothbay-lights/10771/",
        "title": "Boothbay Lights",
        "descriptionTab": "Boothbay Lights is a celebration of signature Holiday events in the Maine mid-coast towns of Boothbay and Boothbay Harbor! The towns sparkle with thousands of lights.\nLodging\n,\nshopping\n, and\ndining\nare open with plenty of fun\nthings to do\nfor the whole family.\nWith 6 sparkling weeks, there’s always something happening! Come early to explore our unique shops, visit the giant pot buoy tree, and savor something warm and wonderful at our local restaurants.\nEarly Bird Sale & Pajama Party | Lighted Firetruck Parade Giant Pot Buoy Tree | Gardens Aglow | North Pole Express | Santa Arrives by Boat | Lighted Boat Parade | Sparkle Fireworks | Gingerbread Spectacular | Holiday Fairs\n& MORE!\nIf you're coming for Gardens Aglow on a\nFriday or Saturday\nbe sure to\nmake the most of your visit\nand\npark downtown\nto skip the traffic and parking hassle! - Shop Dine and Sparkle with us at our boutiques and restaurants, and maybe raise a glass of holiday cheer! Then board the convenient\nFREE SHUTTLE\nfrom the\nBoothbay Harbor Town Office\nright to the doors of Gardens Aglow (advance tickets required).",
        "email_address": "lisa@boothbayharbor.com",
        "location": "Boothbay Harbor Region Chamber of Commerce\n192 Townsend Ave., Rt. 27\nBoothbay Harbor, ME 04538",
        "start_time": "",
        "end_time": "",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/camden-christmas-by-the-sea/10782/",
        "title": "Camden Christmas by the Sea",
        "descriptionTab": "Since 1986, the premiere holiday celebration for Camden-Rockport-Lincolnville!\nChristmas by the Sea occurs on the first official weekend of every December (Fri-Sun)\nDecember 5, 6, 7, 2025",
        "email_address": "christmasbythesea@camdenareabusinessgroup.com",
        "location": "Camden Area Business Group\nMain Street\nCamden, ME 04843",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/can-am-crown-international-sled-dog-races/10513/",
        "title": "Can-Am Crown International Sled Dog Races",
        "descriptionTab": "We invite you to a rare place where you can witness the most challenging sled dog race in the eastern United States. We have organized high quality racing events designed for the enjoyment of mushers, spectators, and dog teams. All three Can-Am Crown races (the 250, 100, and 30 mile races) now have highly accessible starts on Fort Kent's Main Street and comfortably viewed finishes at Lonesome Pine ski lodge in Fort Kent. The Can-Am Crown 250 also has designated spectator points in the towns of Portage Lake and Allagash. For logistic and safety reasons, checkpoints west of Portage Lake and south of Allagash are closed to the public. Racing events in Fort Kent are planned to have maximum accessibility and visibility. There are no fees to view the races. Bring your camera!\nRelax! As you visit our friendly towns along the way, you may want to pause for refreshment and talk with the local folks. Enjoy the easy pace of life and the helpful and friendly people. You'll find everything you need for a uniquely enjoyable experience.\nLeave the World Behind\nAt some point in your travels you will realize that you have left the ordinary world behind. Watch out for moose! You are in north country now. When you get to Fort Kent you may begin to feel exhilarated by the beautiful scenery, the camaraderie of the people, the eagerness of the dog teams, and the anticipation of the imminent adventure.\nWeekend Centerpiece\nAt 250 miles, Maine's Can-Am Crown International Sled Dog Race is the longest and highest caliber race in the eastern United States. For the men and women who challenge themselves and their teams of dogs, it represents great adventure, accomplishments and reward. It is a course for experts and those moving up in the exciting sport of sled dog racing, with winners claiming their share of a $29,000 purse!\nThe Upper St. John Valley is a classic setting for the CAN-AM CROWN 250. The race course runs deep into the famous Allagash Wilderness region, a setting which embodies much of Maine's heritage and natural splendor.\nCelebrate\nHighlighting your visit to the St. John Valley, the Can-Am Crown organization arranges a festive dinner and awards ceremony after each racing event. Dress casually.",
        "email_address": "",
        "location": "Aroostook County Tourism\n11 W. Presque Isle Rd.\nCaribou, ME 04736",
        "start_time": "8:00 AM",
        "end_time": "",
        "date": "February 28, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/christmas-at-nickels-sortwell-house/10431/",
        "title": "Christmas at Nickels-Sortwell House",
        "descriptionTab": "Nickels-Sortwell House\n, 121 Main Street, Wiscasset, ME\nCome see Nickels-Sortwell House in holiday splendor, including a stunning tree decorated with hundreds of vintage ornament and a solarium transformed into a fantasy space filled with wonders. Take a self-guided tour of the first floor, then have a warm drink and snack in the old kitchen before checking out the Holiday Shop in the Barn and other Wiscasset Holiday Marketfest activities.",
        "email_address": "",
        "location": "Historic New England\nCastle Tucker, 2 Lee St.\nWiscasset, ME 04578",
        "start_time": "10:30 AM",
        "end_time": "3:00 PM",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/christmas-in-the-valley-craft-fair/7495/",
        "title": "Christmas in the Valley Craft Fair",
        "descriptionTab": "Christmas in the Valley in the River Valley\nKkick off the holiday festivities with the Christmas in the Valley Craft Fair on Dec. 7th.\nOn Saturday, Dec. 7th, the Christmas in the Valley Craft Fair sponsored by the River Valley Chamber of Commerce takes place at Mountain Valley High School in Rumford from 9-2pm.   50 crafters will feature their crafts and wares.    $1 donation at the door will help provide food baskets for families of high school kids @ Mountain Valley High.\nThe Christmas in the Valley Raffle this year will be a Gift Certificate Basket valued over $700.00\nTickets are $5.  Stop by the Christmas in the Valley booth and purchase your tickets.  If you want to get tickets but can’t go to the fair stop by Erik Designs on 108 in Rumford and purchase them there.\nDon’t forget to get your tickets for the Chinese Auction where each crafter present will donate one of their wares to be raffled off to one of you very lucky people.\nAs always, the kitchen will be stocked with breakfast and lunch menu items so plan on having breakfast and lunch with us at the fair.   Diane and her team always have great food to serve.\nThe Cookie Walk is returning with the Sophomore Class of MVHS. taking over the reins. Lots of assorted cookies for you to choose from for your holiday gatherings.\nNEW this year will be a gift-wrapping station manned by the Junior Class of MVHS.  One stop shopping with gift-wrapping too.\nThe Kids Corner, back this year will be hosted by the National Honor Society of MVHS.  There will be projects for the kids and Mr. &Mrs. Frosty will make an appearance at the fair.",
        "email_address": "info@rivervalleychamber.com",
        "location": "799 Hancock St\nRumford, ME 04276",
        "start_time": "9:00 AM",
        "end_time": "2:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/christmas-prelude-trolley-rides/9851/",
        "title": "Christmas Prelude Trolley Rides",
        "descriptionTab": "Come out to the Seashore Trolley Museum for a special winter treat! Ride in heated trolleys decked out in live holiday greens on our private heritage railroad, check out several exhibits and displays including the new model railroad building, shop in the Museum Store, and enjoy delicious hot chocolate! Only $14/person; children 2 and under that will be sitting on laps on the trolley ride are free.\nSanta\nwill also be on campus during four event days–see below for times! Complimentary hot chocolate and marshmallows to roast around our outdoor fire pit are also included in the price of admission.\nThis event will be held Friday-Sunday December 5-7 and 12-14. The start time on your ticket is the time your trolley ride will depart; we depart promptly at each departure time. Our winter trolley rides are roughly 25 minutes in length and journey through our beautiful, wooded campus. You and your family/group are welcome to arrive before or stay after your ride to enjoy the museum’s outdoor exhibits and our climate-controlled Craft Room inside our Visitors Center, which will also have (real) gingerbread house village on display created by local Gingerbread Artist Kathy Locke. The Museum will be open from 9:30AM-5:30PM. The last trolley ride departs from the Visitors Center at 5PM each day.\nThis event will be held rain, light snow or shine.\nSanta will be on campus and available for photos during the following dates and times:\nSunday, 12/7 from 3PM-5:30PM; and Friday-Sunday December 12-14 from 9:30AM-12PM and 1PM-5:30PM.\nOur heritage railway is approximately 3 miles from downtown Kennebunkport and does not connect with downtown Kennebunkport. Our trolleys are the real deal and operate on a railroad, not paved roads — the “trolleys” that travel on the roads are imitation trolleys built to look like the trolleys that operated in the early 1900s, the original trolleys that we have preserved and now operate on our heritage railway (please see photos above and below).\nAccessibility\n: Seashore Trolley Museum has a Mobilift to help guests with mobility challenges access our trolleys.\nRefund Policy\n: In the event of a blizzard or other significant weather event, we may cancel our event and refund your tickets/transfer your tickets to another event day if you wish. We anticipate this event will sell out quickly. Therefore, refunds will only be granted up to seven (7) days in advance of your event date, unless someone in your group has tested positive with COVID-19. We would be happy to offer a free Family Day Pass\nin exchange for event tickets that are unable to be used for other reasons. This pass can be used on any General Admission day at the Museum during our 2026 or 2027 season.\nFor questions, please email events@trolleymuseum.org or call\n(207) 967-2800\nx101.\nThank you for supporting our event!",
        "email_address": "events@trolleymuseum.org",
        "location": "Seashore Trolley Museum\n195 Log Cabin Rd.\nKennebunkport, ME 04046",
        "start_time": "9:00 AM",
        "end_time": "5:30 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/cinderella/10415/",
        "title": "Cinderella",
        "descriptionTab": "The timeless enchantment of this classic fairytale comes to life just in time for the holidays.  In a far off kingdom, a young girl, Cinderella,  is made to serve her wicked stepmother and her cruel stepsisters.  Despite her situation, Cinderella remains kind and good and hopeful that a wish might be granted and that her life might be transformed.  Will she make it to the Ball to meet the Prince?  It’s possible!  Kings and Queens, Princes and Fairy Godmothers, mice and magic  all come together to tell this heartwarming tale, with extraordinary songs by Rodgers and Hammerstein and all of the hopeful magic you need for the holiday season.",
        "email_address": "",
        "location": "Penobscot Theatre Company\n131 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "December 4, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/client-gathering/3015/",
        "title": "Client Gathering",
        "descriptionTab": "Clients come together to share their experiences. This is a monthly event. Please feel free to contact Karen for any questions that you may have.\nReservations are required to join.\nSee you in our healing home\nBlessings",
        "email_address": "karen@alphaomegaconnections.com",
        "location": "Alpha Omega Connections\n1A Mountain View Lane\nCape Neddick, ME 03902",
        "start_time": "2:00 PM",
        "end_time": "4:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/coastal-maine-botanical-gardens-lights-aglow/10398/",
        "title": "Coastal Maine Botanical Gardens Lights Aglow",
        "descriptionTab": "Experience Nature in Motion at Gardens Aglow and see the Gardens come alive after dark!\nNew England’s premier light show transforms the landscape into a glowing journey through scenes depicting the flora and fauna of Maine’s forests, shorelines, and meadows.\nDuring Gardens Aglow, warm up in our Cafe with comfort food favorites and hearty warm bowls. Grab a hot cocoa, coffee, or quick snack, and end on a sweet note with freshly baked cookies or gluten-free brownies.\nStop by the Snack Shack for warm hot cocoa (add a splash of Bailey’s or Schnapps), freshly brewed coffee, or a local beer or wine. Enjoy tasty grab-and-go snacks like popcorn, donuts, Bixby Bars, and cookies—a perfect way to fuel up for your Gardens Aglow adventure!",
        "email_address": "",
        "location": "Coastal Maine Botanical Gardens\n105 Botanical Gardens Dr.\nBoothbay, ME 04537",
        "start_time": "4:00 PM",
        "end_time": "9:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/comfort-and-joy%3a-christmas-in-olde-new-england-tours-of-the-wadsworth-longfellow-house/10669/",
        "title": "Comfort and Joy: Christmas in Olde New England tours of the Wadsworth-Longfellow House",
        "descriptionTab": "“…the coal & wood are still burning warmly and tempt me to sit awhile longer…”\n~ Anne Longfellow Pierce in a letter to her sister Mary on December 24, 1850\nLooking to warm your hands and your heart this season? Keep a cozy and very merry holiday with us at MHS! Tour the Wadsworth-Longfellow House with all the trimmings for a 19th-century Christmas and learn about the New England holiday traditions of long ago.  What yummy treats might the Longfellows have enjoyed this time of year?  Did they hang stockings for St. Nicholas on Christmas eve? What games did they play and which songs did they sing?  After touring the house, stop by our museum shop to find unique gifts for everyone on your list and receive a 10% discount on your purchases!\nTickets for these special holiday tours of the Wadsworth-Longfellow House include a guided tour of house and access to the MHS Museum Galleries.  Tours are limited to 12 guests, will last approximately 45 minutes, and will depart from the Museum Store at 11 AM, 1 PM, 2 PM, and 3 PM on Saturday, November 29 and Saturday, December 6, 13, and 20.  Ticketholders will receive a 10% coupon good towards any purchases they make in the Museum Store on the day of their visit.",
        "email_address": "info@mainehistory.org",
        "location": "489 Congress St.\nPortland, ME 04101",
        "start_time": "11:00 AM",
        "end_time": "3:00 PM",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/community-open-house-%26-art-show/10482/",
        "title": "Community Open House & Art Show",
        "descriptionTab": "Gather as a community and enjoy the creative spirit of MDI at the Wendell Gilley Museum for the Museum's annual Community Open House & Art Show on\nSunday, Dec. 14,\nfrom\n1 to 4 p.m\n.. Admission is free and light refreshments will be served.\nWe will have a special one-day-only exhibit of art created at the Gilley in 2024, everything from bird drawings by third-graders to bird carvings by long-time carvers.\nFree and open to all. No registration required; just drop by!",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "1:00 PM",
        "end_time": "4:00 PM",
        "date": "December 14, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/creative-nature-club/10753/",
        "title": "Creative Nature Club",
        "descriptionTab": "Ages 6-10\nMonthly on Saturdays September-May\n9:30am-12:30pm\nat Langlais Art Preserve\nWhat do we notice when we slow down and observe nature closely? How can creative responses to our local ecology help us feel connected to the more-than-human world? Each month at Creative Nature Club, we’ll explore a new ecological theme and make art inspired by our discoveries.\nThis program is free but registration is required to reserve your child’s spot. Sign up for five or more sessions and get a Creative Nature Club Field Kit!",
        "email_address": "",
        "location": "Price:\nfree, registration is required\nTime:\n9:30 AM to 12:30 PM\nRecurrence:\nRecurring weekly on Saturday",
        "start_time": "",
        "end_time": "",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/crown-of-america-maine-preliminary-pageant/10479/",
        "title": "Crown of America, Maine Preliminary Pageant",
        "descriptionTab": "Your Pageant Journey Starts HERE!\nDreaming of the stage but not sure where to begin? Ready to take your confidence to the next level and compete for a state title? The Crown of America™ Maine preliminary is the perfect place to start!\nWe've built our system for YOU—whether you're a complete newcomer to pageantry or a seasoned contestant ready to advance to a national stage. This is more than a competition; it's an experience designed to build lifelong skills, friendships, and confidence. Join us at the Hollywood Casino in Bangor, Maine and compete for the opportunity to represent Maine and the Greater New England area at the national Crown of America™ pageant in Orlando, Florida September 4-6, 2026.\nMAINE PRELIMINARY EVENT\nDate: Saturday, February 7, 2026\nLocation: Hollywood Casino Hotel & Raceway - Bangor, ME\nCOMPETE IN:\nPhysical Fitness Wear\nFun Fashion\nEvening Gown\nInterview\nOptional: Portfolio Competition\nWin your state title and earn your spot to compete at the Crown of America™ National Pageant in Orlando, Florida! September 4-6, 2026.\nOpen to contestants ages 7 and up! This is your chance to shine.\nReady to learn more or apply? Send us a direct message for all the details and registration information!",
        "email_address": "",
        "location": "Hollywood Casino, Hotel & Raceway\n500 Main St.\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "February 2, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/cruising-with-friends-classic-car-show/4264/",
        "title": "Cruising with Friends Classic Car Show",
        "descriptionTab": "Fifth Annual \"Cruising with Friends\" Car Show!\nSAVE THE DATE!!  Friends of Downtown Sanford and our generous Sanford Businesses are pleased to bring you the \"Cruisin' with Friends\" Car Show, on July 31, 2026.  There will be raffles, a 50/50, various vendor booths, local Food Vendors, Food Trucks, and the Gin Tin (cash bar).  The car show will be 5 - 7:30 pm.  A section of Main Street, between Lebanon/Winter Streets and Washington Street, will be closed for this event.   This event brings in so many cars from many categories, something for everyone!   This event is free for spectators!\nIF YOU ARE ENTERING A CAR\n, please get to Main & Washington Streets OR Main & Lebanon Streets, between 4 & 5, to be let through the barricades and parked before the event starts.  The entry fee for show cars is $20, with a complimentary $5 coupon to the food court.  About 12 trophies are given away by our generous sponsors, plus a People's Choice award!\nThere is a rain date of August 7th if needed.",
        "email_address": "FOD@strongersanford.org",
        "location": "Sanford Regional Economic Growth Council\n917 Main St., Ste. D.\nSanford, ME 04073",
        "start_time": "5:00 PM",
        "end_time": "7:30 PM",
        "date": "July 31, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/darker-the-night-brighter-the-stars/10417/",
        "title": "Darker the Night, Brighter the Stars",
        "descriptionTab": "In a town that is not quite Almost, Maine a younger generation of lovers and dreamers wrestle with their relationships, their identities, and the day to day challenges of living.  On a warm summer night where the Perseid meteor shower fills the dark sky with shooting stars and possibility, these young people connect and collide, asking big questions and seeking out answers in a quest to be seen for who they are.  In a companion piece to his hit Almost, Maine, Playwright John Cariani gives a heartfelt, honest voice to this next generation of Northern Mainers.",
        "email_address": "",
        "location": "Penobscot Theatre Company\n131 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "February 18, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/direct-observation%3a-oil-painting-with-rob-pollien/10736/",
        "title": "Direct Observation: Oil Painting with Rob Pollien",
        "descriptionTab": "This class meets weekly on Thursdays starting April 2 through April 30; there is no class on Thursday, April 23.\nJoin us for an immersive painting experience at the Farnsworth Art Museum, where you will focus on painting from direct observation in oil. This hands-on workshop is designed for painters looking to strengthen their skills and deepen their understanding of value, composition, and paint handling. All sessions are taught in person, creating an intimate environment for real-time guidance and feedback.\nStarting with simple value and color studies in oil, we will progress quickly toward more complex painting problems that focus on color mixing, paint application and developing a systematic, deliberate approach to painting from observation.\nThrough classroom study, critiques and assignments, attention will be given to sound, essential studio practices, helping the students to grow, become “unstuck” and move toward bringing their painting to a higher level.\nArtists of all levels of experience are welcome although the course is recommended for artists with a firm understanding of basic drawing.\nYou may access the materials list here.\nInstructor\nRob Pollien\nearned his MFA from the University of Pennsylvania and attended the Skowhegan School of Painting and Sculpture. In 2019, he was one of Acadia National Park’s Resident Artists. Robert has received support from the Ludwig Vogelstein Foundation, the Monhegan Artists’ Residency Corporation, the Joseph A. Fiore Art Center at Rolling Acres Farm, and the Brush Creek Foundation for the Arts. He has also been awarded the Maine Arts Commission Individual Artist Fellowship for painting. His paintings are in numerous corporate, public, and private collections. He is represented by  Artemis Gallery in Northeast Harbor and the Page Gallery in Camden Maine. Rob has recently retired from teaching at the University of Maine.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "2:00 PM",
        "end_time": "4:30 PM",
        "date": "April 2, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/dr-seusss-the-cat-in-the-hat/10611/",
        "title": "Dr. Seuss's The Cat in the Hat",
        "descriptionTab": "The kids are bored.. again..!\nWhat to do with YOUR Thing One and Thing 2?!\nHere’s an idea:\nBring the whole family to the Worlds Number 1 ‘The Cat in the Hat’ show for an experience they’ll never forget. The story has been around for over 50 years and kids still love it… just like you did!\nTwo bored kids (This was way before iPads). One rainy day (We’ve all had a few of those) And one crazy cat wearing a red-striped hat (Where was the background check for that babysitter?!)\nIn 1957, Dr Seuss used only 200 words to write his classic tale. More than 50 years later, The Cat in the Hat is a much-loved children’s phenomenon. The play was adapted for the stage in 2009 by the National Theatre of Britain. The Cat in The Hat interrupts this rainy afternoon with his unexpected visit to Sally and her brother’s cozy home. Their outspoken and outraged pet Fish is astounded and concerned, but this cat will not be deterred. He will teach us all to make our own fun with nothing but a little imagination. “It’s fun to have fun, but you have to know how” Along with Thing One and Thing Two, the cat will fill the theatre with mischievous humour and madcap style.\nA timeless tale with a twist —this energetic adaptation bursts onto the stage (and maybe into the aisles). Expect laughs, surprises, and just a bit of delightful disorder!",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "6:00 PM",
        "end_time": "",
        "date": "March 10, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/drawing-in-color%3a-interpreting-the-collection-with-helene-farrar/10735/",
        "title": "Drawing In Color: Interpreting the Collection with Helene Farrar",
        "descriptionTab": "Join us for a four-week art workshop exploring materials and processes as we look to the Farnsworth Art Museum Collection for inspiration. Each week will feature a different, playful opportunity to respond to visual “notes” from on-site visits to the museum. We will use collage, build a drawing repertoire, work on paper, paint using water media, dig deeper into color, and experiment with text as texture. Students will enjoy this high energy and unique opportunity to see and make art!\nEach session with give students an exploration of media and a dynamic understanding of how to approach and respond to sources of inspiration.\nHélène Farrar has taught and worked in the visual arts for twenty years while actively exhibiting in commercial, nonprofit, and university galleries in New England, New York City, Pennsylvania, Italy, and England. Farrar has a BA in Studio Art from the University of Maine and a Masters of Fine Art Degree in Interdisciplinary Arts from Goddard College in Vermont. Hélène currently owns and operates her own private art school in Maine out of her “Farmhouse” studio, where she holds varied workshops and classes. Her paintings have most recently been accepted into curated exhibits at the Cape Cod Community College, Fuller Craft Museum, the Saco Museum, the University of New England Art Gallery, and Twiggs Gallery in New Hampshire. Farrar is represented by Archipelago Fine Arts in Rockland, Betts Gallery of Belfast, Cynthia Winings Gallery of Blue Hill, and the Center for Maine Craft in West Gardiner. Her work as an educator has brought her across the state of Maine including the Haystack Mountain School or Crafts.",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "2:00 PM",
        "end_time": "4:30 PM",
        "date": "February 26, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/early-bird-pajama-party-%26-bed-races/10774/",
        "title": "Early Bird, Pajama Party & Bed Races",
        "descriptionTab": "Early Bird Sale & Pajama Party – The Boothbay Harbor Region's Favorite Holiday Kickoff\nShopping in your pajamas? ABSOLUTELY! On the Saturday before Thanksgiving, Boothbay Harbor comes alive for our beloved\nEarly Bird Sale & Pajama Party\n—a cherished tradition for locals and visitors alike.\nGrab your friends, throw on your coziest bathrobe, and join the fun as downtown shops open early with\nhourly discounts\n,\nspecial door prizes\n, and\nholiday giveaways\n. Many shoppers return year after year—some make it a festive family outing, while others turn it into a girls’ weekend getaway complete with\ncozy lodging\n, waterfront dining, and plenty of laughs.\nAnd don’t miss the return of the\nlegendary Bed Races at 10 a.m.!\nCheer on your favorite pajama-clad teams as they race rolling beds down Howard Street by the Boothbay Harbor Town Office (11 Howard Street). It’s as hilarious as it sounds—and not to be missed!\nFrom\nMaine-made gifts\nand\nartisan crafts\nto\ncoastal décor\n,\nholiday treats\n, and\nunique clothing\n, you’ll find one-of-a-kind treasures for everyone on your list. It’s the perfect way to kick off the holiday season, support local businesses, and discover the magic of shopping in a seaside village decked out for the holidays.\nBe sure to check the\nBoothbay Register\nfor Lists of Early Bird Deals and Discounts and Door Prizes!\nCheck out all the fun events during Boothbay Lights - Mid November - December -Boothbaylights.com",
        "email_address": "lisa@boothbayharbor.com",
        "location": "Boothbay Harbor Region Chamber of Commerce\n192 Townsend Ave., Rt. 27\nBoothbay Harbor, 04538",
        "start_time": "6:00 AM",
        "end_time": "4:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/eastport-making-spirits-bright/10740/",
        "title": "Eastport Making Spirits Bright",
        "descriptionTab": "Come visit Santa's workshop along with a kid's scavenger hunt, enjoy a horse & buggy ride, dress your pup for the Reindog contest, watch Santa arrive and march in the parade to the Fisherman statue to have a hot cocoa & smores while the tree lighting and caroling takes place.  Check out the shops and restaurants for specials and hope you spend the day to see downtown lit up with all the holiday decorations!",
        "email_address": "memberseacc@gmail.com",
        "location": "Water Street\nEastport, ME 04631",
        "start_time": "10:00 AM",
        "end_time": "5:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/embracing-shadow%3a-a-healing-retreat-for-women/10523/",
        "title": "Embracing Shadow: A Healing Retreat for Women",
        "descriptionTab": "Peel away layers of societal expectations and personal armor to reveal your sweet, magical Soul during this healing retreat for women in peaceful Island Falls, Maine.\nInspired by a centuries-old myth — The Descent of Inanna — we’ll use guided journeys, along with movement, art, and ritual, to discover and loosen our old layers of being. Once that happens, we’ll be able to hear the wisdom of our shadows and step through the gateway of transformation.\nPresented by Fálki Heiðdóttir at Sewall House Yoga Retreat\nsessions include:\nSomatic Movement\n, which will play with low-to-the-ground, self-directed, non-linear, fluid motion, to encourage connection to internal cues and strengthen the mind-body connection. It’s a way of movement that encourages freedom from preconceived notions and fixed patterns. Somatic movement allows for embodied connection and release of tension.\nBreathwork,\na somatic practice that combines a specific conscious breath pattern with evocative, rhythmic music to induce a state of relaxation and open awareness.\nJournaling\nto guide participants through a creative process of releasing, transforming, and igniting new energy, and documenting that process in a personal journal.\nFálki Heiðóttir\nis a deep-diving, edge-walking, shadow seeker, a trickster, and a story-teller. She is a sacred witness, a deep-listener, and an embodied, human healer. Her work is grounded in 24 years as a professional therapist and life coach and 3 decades as a ritual priestess, intuitive rune reader, and shamanic practitioner. Fálki is a certified yoga teacher, a trained breathwork healer, and a meditation teacher. She is currently studying yoga therapy under Brandt Passalaqua at Breathing Deeply Yoga in Massachusetts. She can often be found in the backyard talking to the Crows or in her studio creating comics about transformation and alchemy.",
        "email_address": "info@sewallhouse.com",
        "location": "Sewall House - Yoga Retreat\n1027 Crystal Rd.\nIsland Falls, ME 04747",
        "start_time": "",
        "end_time": "",
        "date": "May 28, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/entangled-nature%3a-caroline-clare-davis-%26-vanessa-nesvig-artist-reception/10768/",
        "title": "Entangled Nature: Caroline Clare Davis & Vanessa Nesvig Artist Reception",
        "descriptionTab": "Caroline Clare Davis and Vanessa Nesvig,\nEntangled Nature\n– opening November 24, 2025. On view through February 2026.\nReception: Sunday, December 7, 1-3 pm\nBirds and other animals are inherently dependent on species within their ecosystem. Caroline Clare Davis and Vanessa Nesvig paint the interconnected relationships between birds, animals, and the plants in their habitat in different ways. Through close-up observation of the natural world, these artists are inspired to capture the complexity of the ecosystems around us, aiming to inspire conservation and stewardship.",
        "email_address": "",
        "location": "Time:\n1:00 PM to 3:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/evergreen-garland-workshop-with-rachel-alexandrou/10729/",
        "title": "Evergreen Garland Workshop with Rachel Alexandrou",
        "descriptionTab": "Celebrate the beauty and fragrance of Maine’s winter landscape with this hands-on evergreen garland workshop.  In this class, participants will learn how to create lush, textural garlands using a variety of local evergreens and wild botanicals. Each attendee will create their own 5-foot-long garland — perfect for hanging over a mantle, doorway, or as a tablescape.  All materials and tools will be provided, including wire, twine, gloves, clippers, and a selection of evergreens, seed pods, berries, and other foraged finds. This workshop is open to all skill levels.\nRachel Alexandrou (she/her) is an interdisciplinary artist who uses her education in plant science to create experiential work about innovating human relationships to the natural landscape. She has been making wreaths and garlands for a decade. Her botanical work has been featured at the Venice Biennale, Space Gallery (Portland, ME) She teaches foraging and craft workshops around Maine including Haystack Mountain School of Crafts and The Bernard Langlais Preserve and The Seguinland Institute. Her wreath practice was featured in The New York Times.\nLearn more about Rachel and her seasonal, botanical and art practice at: (Instagram) @giantdaughter,\nGiantdaughter.com\nand\nrachelalexandrou.com\n.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "10:00 AM",
        "end_time": "1:00 PM",
        "date": "December 4, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/exploring-our-way%3a-sensory-friendly-playtime/10370/",
        "title": "Exploring Our Way: Sensory Friendly Playtime",
        "descriptionTab": "For some children, a museum visit is challenging and over-stimulating. The Exploring Our Way: Sensory Friendly Playtimes at the Children’s Museum of New Hampshire in Dover are exclusive to families of children with special needs. These reduced admission, low-sensory events are designed for children with autism spectrum or sensory processing disorders to explore the Museum along with their families without the noise, crowds, and stimulation of a typical day. The museum is closed to the public during Exploring our Way playtimes. We limit attendance, turn down sounds and lights, provide a quiet zone with sensory activities, and have noise canceling headphones to borrow. A medical diagnosis is not required.",
        "email_address": "questions@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street\nDover, NH 03820",
        "start_time": "1:00 PM",
        "end_time": "3:00 PM",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/fall-garden-cleanup-gilsland-farm/10762/",
        "title": "Fall Garden Cleanup - Gilsland Farm",
        "descriptionTab": "Volunteer Day: Help our team prepare the gardens for winter. We’ll be doing things like raking leaves, pulling weeds, and removing dead plant material.\nExpect some physical activity, and please come prepared with a water bottle, and appropriate clothing.\nFriday 11/14 12-3 pm",
        "email_address": "",
        "location": "Time:\n12:00 PM to 3:00 PM",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/farnsworth-concert-series%3a-alice-limoges/10732/",
        "title": "Farnsworth Concert Series: Alice Limoges",
        "descriptionTab": "Born and raised on a mountain by the sea in coastal Maine, Alice Limoges was singing before she could walk. With roots grounded in the folk, jazz, and rock traditions of her childhood, Alice’s journey led her through seven years in the New York City music scene before the pandemic guided her back to Maine in 2020. Her artistry is marked by her distinct voice, visceral songwriting abilities, and a spirit reminiscent of a classic troubadour.\nAlice crafts poetic songs reflecting love, homecoming, and mental health, illuminated by her soulful voice. Whether solo or in collaboration, her performances draw listeners into the intimate space of her vulnerable original music. Having released five independent albums, her song\n“No One Underneath”\nstood as a semi-finalist in the 2019 International Songwriting Competition. Notably, she contributed to the Grammy Award winning album\n“Ageless: Songs For The Child Archetype”\nby Jon Samson.\nAlice’s musical journey spans renowned venues like The Cutting Room and Rockwood Music Hall in NYC, as well as festivals and colleges across the northeast. Her expertise extends beyond the stage, guiding aspiring artists through personalized music lessons. Focused on singer-songwriters, Alice imparts technical skill fused with the art of storytelling, drawing from her industry experiences to nurture creativity. Whether sharing her own music or mentoring others, Alice brings beauty and vulnerability into everything she does.\nThose interested in Alice’s process and original music can explore her\nPatreon\n, where Alice releases an exclusive, original song every month.\nWe also are offering a subscription rate to the entire music series;\nplease click here to subscribe to all 8 concerts in the series for a discount.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "February 11, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/farnsworth-concert-series%3a-ari-%26-mia/10734/",
        "title": "Farnsworth Concert Series: Ari & Mia",
        "descriptionTab": "Ari & Mia reference the styles of Southern and Northeastern fiddle music and the early American songbook to create a realm where their own compositions cross paths with older traditions. Their stylish and sophisticated music honors the sounds of Appalachian cottages, rural dance floors, and urban concert halls. Combine this with their innovative approach to songwriting and the result is a captivating sound.\nSince 2008 the sisters have toured across the U.S., Canada, and Australia and are both graduates of New England Conservatory’s Contemporary Musical Arts department. They’ve performed alongside Sarah Jarosz, opened for Cheryl Wheeler and Catie Curtis, and played at venues such as Shalin Liu Performing Arts Center, Falcon Ridge Folk Festival’s Mainstage Emerging Artist Showcase, Club Passim, the Parlor Room, New Bedford Folk Festival, and Jordan Hall. Both award winning songwriters, their newest album, “Sew the City,” released in 2019, was premiered on Billboard Magazine and has been met with critical acclaim. They are working on a new album to be released in 2026.\nWe also are offering a subscription rate to the entire music series;\nplease click here to subscribe to all 8 concerts in the series for a discount.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "April 22, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/farnsworth-concert-series%3a-brian-shankar-adler/10733/",
        "title": "Farnsworth Concert Series: Brian Shankar Adler",
        "descriptionTab": "The next concert in the Farnsworth Concert Series features award-winning percussionist and composer Brian Shankar Adler as he presents a piano trio that blends jazz, Indian classical music, and tango with cinematic improvisations.\nBrian Shankar Adler\nis an interdisciplinary percussionist and composer. Described as “a polyrhythmic force… New York City gritty yet still somehow capable of evoking the delicacy of a summer breeze…” (JazzTimes), his work transcends the terrain between genre and geographic region, asking: how can we find connection through rhythm?\nAdler has performed in caves, forests and adjacent glacial ice fields as well as Carnegie Hall, Kennedy Center, Lincoln Center and The Stone. He has been recorded on over fifty albums including his solo works:\nFor a Gallery on the Moon\n(Chant Records, 2020),\nFourth Dimension\n(Chant Records, 2019), and his recent collaboration:\nAir Space: Cricket Cipher\n(Adhyâropa Records, 2024).\nPlaying primarily a hybrid drum set that includes North Indian tabla, Argentine bombo legüero and found objects, Adler’s work explores the perception of time, the communicative properties of rhythmic gesture and existential questions that reside in the human condition. With equal focus on improvisational and compositional practices, he uses rhythm as a tool for collaboration.\nAn accomplished composer, Adler’s works have been praised as “profoundly exquisite… striking interior chords, where the heart and the mind’s inner ear intersect…” (All About Jazz). He has been commissioned to compose\nA Memory of Fire\n(Palaver Strings),\nEchoes of the Gomero\n(Rasa String Quartet),\nWe Are a Body of Water\n(Bates College Gamelan Orchestra) as well as music for Appleton Rum’s “Find Your Rhythm” ad campaign. As a 2025 CASJ Fellow, Adler collaborated with scientists at Shaw Institute to create Dance of the Cephalopod, a solo percussion piece that explores innovative ways to engage the public through social justice. Adler was a composer-in-residence at Antenna Cloud Farm, Avaloch Farm Institute and Vermont College of Fine Arts. He has been the recipient of numerous awards, including Composer’s Now Grants and ASCAP Plus Awards.\nA Lifetime Arts/National Guild grant winner, Brian Shankar Adler has revolutionized the accessibility of rhythmic pedagogy. In 2013, he published A World of Percussion connecting rhythm, language, mathematics and environment through a study of shared musical concepts from around the globe. Adler is currently on faculties at: Bates, Bowdoin College and Vermont Jazz Center. He is a Vic Firth and Schlagwerk artist and has offered masterclasses and residencies internationally.\nWe also are offering a subscription rate to the entire music series;\nplease click here to subscribe to all 8 concerts in the series for a discount.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "March 18, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/farnsworth-concert-series%3a-callie-brennan/10737/",
        "title": "Farnsworth Concert Series: Callie Brennan",
        "descriptionTab": "The final performance in the Farnsworth Concert Series 2025-2026 season features Callie Brennan, a violinist in the\nPortland String Quartet\n.\nCallie Brennan was raised in Maine, where she spent her childhood writing short stories, practicing fiddle tunes, and tracking mud all through the house. At twelve years old she began studying with Ronald Lantz, who is to thank for her constant cracking of jokes. She attended the PSQ summer chamber music workshop at St. Joseph’s throughout her high school years, and it was because of this experience that she decided to pursue music as a career.\nCallie received a Bachelor’s degree in violin performance from the University of Colorado, Boulder, where she studied with Lina Bahn and Harumi Rhodes. In her third year she traveled abroad to Sydney, Australia, studying under the tutelage of Ole Bohn at the Sydney Conservatorium. In 2016 she moved to London where she completed two Master’s degrees in music and violin performance at The Guildhall School of Music and Drama, and indulged in far too much tea.\nDuring her time abroad Callie performed alongside the London Symphony Orchestra under the baton of Sir Simon Rattle, collaborated with the Australian Chamber Orchestra, and recorded a film soundtrack at Abbey Road Studios. She was invited to play in Scotland, Spain, Italy, and France, in venues such as The Barbican Stage, Royal Festival Hall, and the Sydney Opera House; more recently, Red Rocks Amphitheater and Boettcher Hall in Denver. She has appeared on stage with artists such as Bela Fleck, the Wu Tang Clan, Kristin Chenoweth, Father John Misty, Amos Lee, The Indigo Girls, Leslie Odom Jr., and many others.\nBack in the States, she held title positions with the Spartanburg Philharmonic (Concertmaster), the West Virginia Symphony (principal 2nd), and the Fort Collins Symphony (principal 1st), and section positions in the Colorado Ballet and Colorado Music Festival. Also appearing regularly with the Colorado Symphony and Colorado Opera, she (unfortunately) never did find the time to ski the Rockies – a reality she’ll never be able to live down.\nCallie has an extensive background in chamber music and has trained with ensembles such as the Portland String Quartet, Takács Quartet, Heath Quartet, Endellion Quartet, Chilingarian Quartet, and the Zodiac Trio. She has enjoyed several solo appearances with orchestra, performing the Walton Violin Concerto in Waterloo, London, and more recently, Mozart’s third concerto for violin with the Spartanburg Philharmonic, a concert sponsored by the Habisreutinger Stradivari Foundation.\nHaving recently moved back to Maine, Callie now holds a position with the Portland Symphony Orchestra and has fulfilled her long-time dream of joining the PSQ. When not practicing or dashing off to rehearsal, she spends her time trail running, beach walking, and eating alarming amounts of chocolate.\nWe also are offering a subscription rate for the entire music series;\nplease click here to subscribe to all 8 concerts in the series at a discount.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "May 13, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/farnsworth-concert-series%3a-cassotto-duo/10731/",
        "title": "Farnsworth Concert Series: Cassotto Duo",
        "descriptionTab": "Annemieke and Jeremiah McLane, known as Cassotto Duo, have performed from coast to coast in the United States as well as in Europe. The couple make their own arrangements for piano and accordion which highlight the folk elements in classical compositions. Their music ranges from the 16th to the 21st centuries, including composers such as Bartok, Dvorak, Piazzolla, and Poulenc.\nAnnemieke was born and raised in the Netherlands, studying for her Masters in Piano Performance at the Zwolle Conservatory with Rudy de Heus. She received Student of the Year Award for her final recital, and was collaborative pianist at the conservatories of Zwolle, Arnhem, Rotterdam, Amsterdam for different instrumentalists and vocalists. At the Sweelinck conservatory of Amsterdam she specialized in Art Song Accompaniment. At age 21 she received the National Young Music Talent Award for best accompanist, praised for her touch and coloring. After her Master’s Degree she studied privately with Tan Crone in Amsterdam, and was a  finalist in Paris for the Lily and Nadia Boulanger competition.\nJeremiah McLane\nis an accordionist with a diverse musical background including blues, jazz, Celtic, Québécois, French and other roots influenced music. He has served on the faculties of the State University of New York in Plattsburgh, the Summit School for Traditional Music in Montpelier, and at the Upper Valley Music Center in Lebanon, NH. He also teaches regularly at summer music programs throughout the United States. In 2016 Montpelier Times-Argus music critic Art Edelstein named Jeremiah musician of the year, citing his contributions in teaching, recording and performing. Jeremiah also plays with two traditional music trios: Kalos and Triton.\nWe also are offering a subscription rate to the entire music series;\nplease click here to subscribe to all 8 concerts in the series for a discount.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "January 21, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/farnsworth-concert-series%3a-louisa-stancioff/10730/",
        "title": "Farnsworth Concert Series: Louisa Stancioff",
        "descriptionTab": "The next performance in the Farnsworth Concert Series season features a talented singer-songwriter from right here in Midcoast Maine. Join us for a cozy midday concert featuring a mix of holiday covers and her own original songs.\nBorn and raised in rural western Maine, Louisa Stancioff has emerged as a gifted writer with a cinematic eye for richly detailed, emotionally-charged character studies that grapple with the complexities of loneliness and desire, guilt and forgiveness. Her songs highlight everyday life happenings and the whimsical ways in which serendipity ties us all together.\nA nomadic soul who spent stints living in California, Montana, New York, and North Carolina before returning home to Maine, Stancioff grew up learning traditional Balkan music from her paternal grandfather’s side of the family and reveled in singing American folk and roots tunes with her friends. Backed by her folk rock band, her intelligent and soulful writing pairs with a confident and catchy indie sound drawing on folk, rock, pop, and her own Bulgarian heritage.\nLouisa’s debut album\nWhen We Were Looking\nis out now. Check out the\nOfficial Press Release\n.\nLouisa has toured extensively, playing shows with Blitzen Trapper, The Dead Tongues, Indigo De Souza, Darlingside, Micaela Davis, Pokey Lafarge and many more.\nWe also are offering a subscription rate to the entire music series;\nplease click here to subscribe.\n(Please note; any concerts unattended or that have already happened will not be refunded.)\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "12:00 PM",
        "end_time": "1:00 PM",
        "date": "December 10, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/festive-glow%3a-holiday-spa-night/10393/",
        "title": "Festive Glow: Holiday Spa Night",
        "descriptionTab": "Prepare to sparkle and shine this holiday season before time gets too busy! Join us for a day of indulgence, relaxation, and radiant skin care amidst the enchantment of Christmas as the ultimate way to pamper yourself. Treat your skin to expert care, relax with mini spa treatments, learn valuable skincare tips, and indulge in the festive atmosphere.\nWhether you're seeking a day of self-care or an opportunity to find perfect gifts for the skincare enthusiasts in your life, this event has it all. Embrace the holiday spirit and leave with a radiant glow and a heart full of festive joy.\nEvent Highlights:\n1.\nProsecco & Welcome:\nUpon arrival, be greeted with a glass of bubbly Prosecco to set the tone for a night of celebration and relaxation.\n2.\nSkin Care Demonstrations & Advice:\nOur expert estheticians will provide insightful skin care demonstrations and offer personalized advice to help you achieve and maintain healthy, glowing skin during the festive season.\n3.\nMini Spa Treatments:\nScalp Massage: Relieve holiday stress with a soothing scalp massage that will leave you feeling refreshed.\nEnergy Healing: Experience the rejuvenating benefits of energy healing, restoring balance and vitality.\nFacial Masks: Discover the magic of rejuvenation with festive facial masks tailored to your skin's needs.\n4.\nSugar Scrub Demonstration:\nLearn the secrets to a radiant, winter-ready complexion with a sugar scrub demonstration. You'll have the chance to make your own scrub and take it home as a gift.\n5.\nFestive Food:\nPamper your taste buds too! Savor a delightful spread of festive treats, including sugar cookies, savory bites, and holiday-themed snacks.\n6.\nGift Sets and Retail Shopping:\nExplore our selection of premium skincare products and holiday gift sets, perfect for giving the gift of beauty to yourself or loved ones.\n7.\nTakeaway Gifts:\nAs a token of our appreciation, each guest will receive a special spa takeaway gift.\nLocation:\nTree Spa Pop-Up at Cape Arundel Inn & Resort Club House\n8 Old Fort Avenue Kennebunkport, ME 04046",
        "email_address": "marketing@krcmaine.com",
        "location": "Kennebunkport Resort Collection\n2 Storer St, Suite 200A\nKennebunk, ME 04043",
        "start_time": "4:00 PM",
        "end_time": "7:00 PM",
        "date": "December 10, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/first-friday%3a-share-the-wonder-december/10722/",
        "title": "First Friday: Share the Wonder December",
        "descriptionTab": "First Fridays at the Farnsworth will delight and surprise visitors with unique programming themed to our exhibitions and offering a variety of activities for people of all ages and interests.\nMore information to come about this First Friday. Learn more about First Fridays at the Farnsworth\nhere\n.",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "4:00 PM",
        "end_time": "",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/first-friday-art-walk-december-2024/9001/",
        "title": "First Friday Art Walk - December 2024",
        "descriptionTab": "First Friday Art Walks are monthly community events featuring local artists and venues located in downtown, Bangor, Maine. These Art Walks are produced by volunteers in cooperation with the Bangor Art Society and dozens of local businesses. Art walks typically include a mix of visual, musical, and performing arts spread throughout Downtown Bangor.\nFirst Fridays in Downtown Bangor is a MUST visit event. This celebration in our historic downtown shopping, dining, arts and commerce district is held on the first Friday of every month and gives visitors a chance to experience the work of local artists hosted by Downtown businesses. This celebration of art and artists, held in our historic downtown shopping, dining, arts and commerce district, is held on the first Friday of every month.\nFirst Friday Art Walks are produced by volunteers in cooperation with the Bangor Art Society. Venues and artists change every month.",
        "email_address": "monique@downtownbangor.com",
        "location": "Email",
        "start_time": "4:00 PM",
        "end_time": "7:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/first-friday-art-walk/950/",
        "title": "First Friday Art Walk",
        "descriptionTab": "We invite visitors to take a self-guided stroll through the downtown and University galleries to hear live music, meet local authors and artists, and experience the heart of our community. First Friday's Art Walk is designed to be an event where people can meet, unwind, and enjoy the arts on the first Friday of every month between 4:30- 8 pm\nhttp://centralaroostookchamber.com/first-friday-art-walk/",
        "email_address": "lsirois@centralaroostookchamber.com",
        "location": "207-764-6561\nEmail",
        "start_time": "4:30 PM",
        "end_time": "9:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/first-friday-june/3646/",
        "title": "First Friday June",
        "descriptionTab": "First Fridays in Downtown Bangor is a MUST visit event. This celebration in our historic downtown shopping, dining, arts and commerce district is held on the first Friday of every month and gives visitors a chance to shop, drink, participate in activities, see art, listen to music and eat late into the evening.\nFirst Fridays in Downtown Bangor is a MUST visit event. This celebration in our historic downtown shopping, dining, arts and commerce district is held on the first Friday of every month and gives visitors a chance to shop, drink, participate in activities, see art, listen to music and eat late into the evening.\nGALLERIES AND STUDIOS\n9 Central Studios\nFeaturing:\nFrancesca DeSanctis, Oil Painter\nRebecca Krupke Studio\nLocation: 9 Central Street\nHours: 4:00 p.m. - 8:00 p.m\nBirchbrook\nFeatured works by John Leblanc, Diana Young, and Kristborg Whitney\nLocation: 82 Columbia Street\nHours: 4:30 p.m. - 7:00 p.m.\nQueen City Cinema Club\nFirst Friday Pop Up Gallery with Gearbox Arts.\nLocation: 128B Main Street\nHours: 4 p.m. - 12 a.m.\nSohn's Gallery at The Rock and Art Shop\nWorks By Jon Taner\nLocation: 36 Central Street\nHours: Reception at 5, Artists Talk at 5:30, Open until 6\nTop of the Nine\nFirst Friday Artist Showcase - Ben Hanson Ben Hanson is a landscape photographer who has traveled the world taking breathtaking imagery. Join us for some free beverages and snacks while you enjoy Ben's artwork and storytelling.\nLocation: 82 Central\nHours: 5:00 p.m. - 8:00 p.m.\nENTERTAINMENT AND ACTIVITIES\nBirchbrook\nOpen house hosting\nBangor Symphony Orchestra\n. Explore their remarkable collection of Maine art and take in the sounds of BSO members Lynn Brubaker (violin) and Marisa Solomon (cello).\nLocation: 82 Columbia Street\nHours: 5:00 p.m. - 7:00 p.m.\nMexicali Blues\nHenna handpaint by Lauren\nHours: 4:30 p.m. - 6:30 p.m.\nLocation: 1 West Market Square\nNocturnem Draft House\nFirst Friday Jazz with The Bill Barnes Trio\nLocation: 56 Main Street\nHours: 7:00 p.m. - 10:00 p.m.\nThe Maine Tavern\nKaraoke\nLocation: 152 Main Street\nHours: 9:00 p.m. - 1:00 a.m.\nWest Market Square Artisan Coffe\ne\nStory Slam with MC Blane Shaw\nLocation: 24 Broad Street\nHours: 6:30 – 7:30\nFOOD AND DRINK SPECIALS\nBenjamin's Brewer & Benjamin's Pub 2019\n$2 PBR pints, and $6 margaritas!\nHours: 5:00 p.m. - 11:00 p.m.\nLocation: 123 Hammond Street\nUtopia Bangor\nDowntown's own Mediterranean restaurant will be open and serving up wine and food specials\nHours: 4:00 p.m. - 11:00 p.m.\nLocation: 123 Hammond Street\nSHOPPING\nCity Drawers\nFree bra fittings all day!\nHours: 10 a.m. -7 p.m.\nLocation: 213 Exchange Street\nMaine Jewelry & Art\nPop Up Sale: 10% off any \"Maine\" item\nHours: 4 p.m. - 8 p.m.\nLocation: 100 Harlow Street\nValentine Footwear\nJoin us for our First Friday Sip & Shop.\nHours: 4 p.m. - 6 p.m.\nLocation: 115 Main Street\nVisit our website for more information\nhttps://downtownbangor.com/first-fridays",
        "email_address": "info@downtownbangor",
        "location": "Downtown Bangor Partnership\n61 Main St.\nBangor, ME 04401",
        "start_time": "4:00 PM",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/free-muddy-boots-concert%3a-trio-oko/10659/",
        "title": "FREE Muddy Boots Concert: Trio Oko",
        "descriptionTab": "Join us for the second FREE concert of this season’s Muddy Boots Series. This time, children get to hear the glorious strains of harp music. Eclectic harp ensemble Trio Oko is a rare bird in the chamber music world. And its three musicians use the unique instrumentation to dazzle.\nTrio Oko’s members, violinist Emma Powell, cellist Mina Kim, and harpist Charles Overton, are united by a mutual belief in the power of music to create meaningful human connections, which is warmly shared with audiences. Children will love the lush harmonies anchored by the harp. They will learn how it works and how the three instruments make beautiful sound together.\nDesigned to expose children to a variety of musical styles played by some of the nation’s finest musicians, the concerts have a laid back vibe. Audience members are encouraged to move and dance. No need to sit still and no need to register. Join us for a morning of joy and learning!",
        "email_address": "tamara@baychamber.org",
        "location": "5 Mountain Street\nCamden, ME 04843",
        "start_time": "11:00 AM",
        "end_time": "12:00 PM",
        "date": "March 21, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/free-thanksgiving-dinner/9296/",
        "title": "FREE THANKSGIVING DINNER",
        "descriptionTab": "🦃🍂 2025 Thanksgiving Dinner at House in the Woods 🍂🦃\nJoin House in the Woods Military & Family Retreat for a FREE Thanksgiving Day celebration in Lee, Maine! Enjoy delicious food, incredible camaraderie, and the joy of gathering together—all at no cost!\n✨ OPEN TO ALL! ✨\nThis event isn’t just for Veterans—we welcome everyone in our community to join us, bring your family and friends, and celebrate the spirit of gratitude together.\n📅 Thursday, November 27, 2025\n📍 House in the Woods, Lee, Maine\n⏰ Three seating times available:\n🍽️ 12:00 PM | 1:30 PM | 3:00 PM\n🚶 Walk-ins welcome, but reservations will be seated first!\n📞 Reserve your spot today!\n📩 Email: angie.gade@houseinthewoods.org\n📞 Call: 920-517-6749\nThis is our way of saying thank you for all that our community does to support each other and our military families. We can’t wait to celebrate with you!\n#ThanksgivingAtTheWoods #GratefulTogether #CommunityFeast #HouseInTheWoods",
        "email_address": "angie.gade@houseinthewoods.org",
        "location": "House in the Woods Military & Family Retreat\n217 Skunk Hill Road\nLee, ME 04455",
        "start_time": "",
        "end_time": "",
        "date": "November 27, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/free-veteran-coffee-with-vets/9286/",
        "title": "FREE VETERAN COFFEE WITH VETS",
        "descriptionTab": "Join Us for Coffee with Veterans in 2025!\nVeterans, come connect with your military brothers and sisters at House in the Woods Military & Family Retreat in Lee, Maine for our monthly Coffee with Veterans.\n📅 Every 3rd Wednesday of the month\n⏰ 7 AM - 11 AM\n📍 House in the Woods, Lee, Maine\n💰 FREE—No registration required\nWhether you want to chat, play cards, or simply enjoy a cup of coffee in great company, this is a space just for you. All Veterans, from all eras and branches, are welcome!\nWe’re here for YOU, and we are forever grateful for your service.\nhttps://www.facebook.com/events/564344419894201/\nTOGETHER WE HEAL.",
        "email_address": "angie.gade@houseinthewoods.org",
        "location": "House in the Woods Military & Family Retreat\n217 Skunk Hill Road\nLee, ME 04455",
        "start_time": "7:00 AM",
        "end_time": "11:00 AM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/freee-muddy-boots-concert%3a-piano-adventures-with-danny/10661/",
        "title": "FREEE Muddy Boots Concert: Piano Adventures with Danny",
        "descriptionTab": "Pianist Danny Holt is not only a virtuoso performer but also a gifted educator with a flair for making music come alive for young audiences. In this special Muddy Boots family concert, he shares the piano’s amazing range — from whispering melodies to thunderous rhythms — through an interactive, playful program designed for children and their families. Danny encourages young audiences to explore how the piano can sound jazzy, rocky, classical, and everything in between. Expect laughter, curiosity, and hands-on fun with an imaginative and engaging performer.",
        "email_address": "tamara@baychamber.org",
        "location": "5 Mountain Street\nCamden, ME 04843",
        "start_time": "11:00 PM",
        "end_time": "12:00 PM",
        "date": "April 4, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/freeport-sparkle-celebration/10397/",
        "title": "Freeport Sparkle Celebration",
        "descriptionTab": "Each year, Visit Freeport presents one of Maine’s most popular holiday celebrations, Sparkle Celebration. The 2025 festival will kicks off in Freeport on Friday, December 5, 2025 with the Sparkle Celebration Parade of Lights which ends with Santa arriving to bring our famous talking Christmas Tree to life!\nThe fun continues all week with lots of lights and holiday merrymaking including Gift Certificate Giveaways with the Stealth Elf, the Sparkle Stroll with special deals and door prizes, and the Sparkle Frosty Frolic features food trucks, fire pits, holiday tunes, tasty treats, gifts for giving.\nAnd as always, visitors will enjoy great dining and shopping throughout Freeport. MarthaStewart.com named Freeport one of “The Most Charming Small Towns to Visit During the Christmas Season” and says, “There’s simply no better place to do your Christmas shopping than in Freeport, Maine.”",
        "email_address": "",
        "location": "Visit Freeport\n115 Main Street\nFreeport, ME 04032",
        "start_time": "",
        "end_time": "",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/gabbys-dollhouse-live!/10609/",
        "title": "Gabby's Dollhouse Live!",
        "descriptionTab": "Terrapin Station Entertainment and TEG Life Like Touring, in association with Universal Destinations and Experiences, present Gabby’s Dollhouse Live! Presented by Walmart, a brand-new stage show inspired by the magical world of the global preschool sensation from DreamWorks Animation.\nIn this a-MEOW-zing musical show, Gabby unboxes a special acorn that needs the magical touch of a rainbow to grow. But when CatRat causes a color cat-astrophe and breaks the rainbow, Gabby and the Gabby Cats must find the colors again to set things right. Gabby, Pandy Paws and friends travel to the Cat-O-Sphere, Mermaid-Lantis and some favorite Dollhouse locations in search of the colors that will make rebuilding the rainbow, possible. Gabby’s Dollhouse Live! Presented by Walmart brings to life an exciting original story featuring incredible puppets, dynamic staging, a talented live show cast of singer-actor- puppeteers and songs from the beloved series, including “Hey Gabby”, “You Can’t Spell\nMeow Without Me” and “Sprinkle Party”. The U.S. premiere tour kicks off in September 2025. Tickets are on sale now.\nSign-up at www.gabbysdollhouselive.com for access to the pre-sale.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "6:00 PM",
        "end_time": "",
        "date": "February 22, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/gardens-aglow/10743/",
        "title": "Gardens Aglow",
        "descriptionTab": "November 15–January 3, Thursday–Sunday, plus select dates from\n4–9 p.m.\n(Closed Thanksgiving, Christmas Eve, Christmas Day, New Years Eve, and New Years Day)\nThe planning for our next Gardens Aglow is well underway, and we can’t wait to see you there! Experience this year’s theme, Nature in Motion, and see the Gardens come alive after dark. See the landscape transformed into a glowing journey through scenes depicting the flora and fauna of Maine’s forests, shorelines, and meadows—and don’t miss some fun new surprises in this year’s display!\nTickets should be purchased online or over the phone,\n207-633-8000\n.\nTickets rates are:\nAdults: $23, Seniors (65+) and Veterans: $20, Children (3-17): $13, Child under 3: free\nMember Adult: $18.50, Member Child: $10.50\nWe also have special early bird pricing for dates before Thanksgiving. For visits during November 15-26, tickets are:\nAdults: $19, Seniors (65+) and Veterans: $17, Children (3-17): $10, Child under 3: free\nMember Adult: $15, Member Child: $8",
        "email_address": "",
        "location": "Coastal Maine Botanical Gardens\n105 Botanical Gardens Dr.\nBoothbay, ME 04537",
        "start_time": "4:00 PM",
        "end_time": "9:00 PM",
        "date": "November 15"
    },
    {
        "url": "https://www.mainetourism.com/event/gary-hoey/10621/",
        "title": "Gary Hoey",
        "descriptionTab": "In 1995 Gary Hoey created the first ever full album of rock instrumental holiday classics in his bedroom on an 8-track recorder. His love for Christmas music came from his beloved mother, Barbara, and growing up in Boston set the backdrop for many great holiday memories. Gary’s Ho Ho Hoey Rockin’ Holiday Tour has become a cherished holiday tradition for families and radio stations around the world. His success behind instrumental rock Christmas music started\nafter his version of “The Twelve Days Of Christmas” hit the airwaves with its classical arrangement and metal flavor. The show is a unique fusion of holiday cheer and electrifying rock 'n' roll, masterminded by the virtuoso guitarist. Over the years, Hoey has carved a niche for himself not only as a gifted musician with a prolific career spanning various genres but also as the creator of this distinctive holiday extravaganza. These adaptations, while infusing the essence of rock, maintain the spirit and joy of the festive season, making them immensely popular\nwith audiences of all ages.\nAudiences can expect to hear iconic holiday melodies like “You’re a Mean One Mr Grinch,” \"The First Noel,\" “Have Yourself A Merry Little Christmas” and \"Deck The Halls\" which is featured in the movie starring Danny Devito, Gary Ho Ho Hoey's Rockin' Holiday Show includes vibrant lighting, festive stage decor, and sometimes even surprise guest performers. It has also made Hoey fortunate enough to give back in the process, helping the veterans with clothing drives, Toys for Tots and food drives. Hoey’s music is featured in Hallmark greeting cards. Bring the whole family together and celebrate this holiday season as only Gary Ho Ho Hoey can.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/get-to-know-georges-river-at-the-pour-farm/10751/",
        "title": "Get to know George's River at the Pour Farm",
        "descriptionTab": "Meet land trust staff, pick up some trail maps, and enjoy the cozy atmosphere and fresh brews of the Pour Farm in Union!\nGet to know Georges River Land Trust at a conservation happy hour at the Pour Farm in Union from 5pm-7pm on Thursday, November 20th! This event is a great chance to learn who Georges River Land Trust is, where our 23 preserves and 80+ miles of trails are located, and provide feedback about what kinds of trails, events, and materials you want to see from us.\nThe Pour Farm is a brewery in Union, offering fresh beer made with local ingredients. Located at the center of the Georges River watershed, this community hub is nearby to several of the land trust’s preserves and trail networks.\nWe want to hear about your favorite trails, where you want to see more opportunities for access and recreation, why conservation is important to you, and what kinds of events and educational opportunities the land trust can provide. Meet land trust staff, pick up some trail maps, and enjoy the cozy atmosphere and fresh brews of the Pour Farm!",
        "email_address": "",
        "location": "Time:\n5:00 PM to 7:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "November 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/hadestown/10163/",
        "title": "Hadestown",
        "descriptionTab": "An uplifting comeback story like no other,\nTINA – The Tina Turner Musical\nis the inspiring journey of a woman who broke barriers and became the Queen of Rock n’ Roll.\nSet to the pulse-pounding soundtrack of her most beloved hits, this electrifying sensation will send you soaring to the rafters.\nOne of the world’s best-selling artists of all time, Tina Turner won 12 Grammy Awards and her live shows were seen by millions, with more concert tickets sold than any other solo performer in music history.\nFeaturing her much loved songs, TINA – The Tina Turner Musical is written by Pulitzer Prize-winning playwright Katori Hall.\n*** TINA − The Tina Turner Musical\nis recommended\nfor ages 14+. The production includes scenes depicting domestic violence, racist language, loud music, strobe lighting, haze, and gun shots.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "December 11, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/haiku-workshop-with-kristen-lindquist/10439/",
        "title": "Haiku Workshop with Kristen Lindquist",
        "descriptionTab": "Poet and naturalist Kristen Lindquist will be with us at the Gilley in April and again in November to teach an introductory haiku workshop. She’ll share a brief history of this intriguing art form, which originated in Japan more than 500 years ago and evolved as a nature poem. Kristen will share what makes a poem a haiku (it’s probably not what you think), and how haiku are written today in the United States. Then she will guide students through writing their own haiku.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "1:00 PM",
        "end_time": "3:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/harlem-globetrotters-100th-year-tour/10608/",
        "title": "Harlem Globetrotters 100th Year Tour",
        "descriptionTab": "Leaders in breaking barriers and making history, the world-famous Harlem Globetrotters™ today announced that Bangor will be a key stop on the team’s 100 Year Tour—the most legendary tour in Globetrotters history—playing at Cross Insurance Center on Wednesday, February 11\nth\n. This centennial season is a once-in-a-century celebration of 100 Years of jaw-dropping “No Way!” moves, 100 Years of “Wow!” moments, and 100 Years of basketball thrills. From gravity-defying dunks to game-changing tricks, fans will feel the history, the joy, and the fun that only the Globetrotters can deliver. Tickets for Cross Insurance Center will go on sale to the general public on Monday, September 22nd at 10:00am.\nFor the first time, the team will also debut their new 100 Year jerseys, honoring a century of global impact, as they face off against their longtime rivals, the Washington Generals. Fans can also expect all-new surprises like the Golden Basketball by Spalding®, epic pre-game Magic Pass experiences, and an unforgettable 5th Quarter Autograph session (FREE for ALL FANS!)—making this a celebration unlike any other.\nFrom breaking the NBA color barrier with alums like Nat “Sweetwater” Clifton signing a pro contract as a member of the New York Knicks or courting future Hall of Famers like Wilt Chamberlain and Connie Hawkins, or Curly Neal and Meadowlark Lemon dazzling sellout crowds, to ushering women into professional basketball, to enchanting thousands around the world as the first team to globalize the game of basketball, to the current group of men and women who are stars on the court and on every screen, the Globetrotters are unparalleled in their reach, impact, awareness and in what they stand for as ‘Ambassadors of Goodwill.’\nThe current team of elite men and women, holders of an unprecedented 60+ Guinness World Records, including 18 set just last year, the most of any team in any sport, will bring a fresh look of gravity-defying dunks and game-changing tricks against their renowned rivals, The Washington Generals, on February 11\nth\n.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "February 11, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/hiking-club-at-haystack-mountain/10750/",
        "title": "Hiking Club at Haystack Mountain",
        "descriptionTab": "Hiking Club returns! Join us for guided hikes year-round on our 80+ miles of multiuse trails from Montville to Cushing.\nOn Saturday, November 15 we will explore Haystack Mountain, straddling the towns of Liberty and Montville. This hike provides stunning views of Trues Pond and Kingdom Bog. We will hike the 1.1-mile trail on the Liberty side of the mountain. This hike includes moderate to steep incline and will take about two hours total to complete.\nConserved thanks to grassroots efforts by the Friends of Haystack Mountain with support from Midcoast Conservancy, Haystack Mountain was transferred to Georges River Land Trust this summer.\nThis hike is open to all ages! Participants should meet us at 10am at the parking lot beyond the Maine Health clinic in Liberty, in front of the baseball fields. Please wear comfortable hiking shoes and bring plenty of drinking water.",
        "email_address": "",
        "location": "Time:\n10:00 AM to 12:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/hiking-club-at-the-langlais-art-preserve/10752/",
        "title": "Hiking Club at the Langlais Art Preserve",
        "descriptionTab": "Join us for a guided group hike through the woods of the Langlais Art Preserve in Cushing. This special preserve is the former homestead and workshop of sculptor Bernard Langlais. In addition to housing Langlais's sculptures, the preserve welcomed a new woodland trail in 2024. Check out this new trail with us and the beautiful forest that surrounds it. This is a great opportunity to explore the preserve's new woodland trail, an especially magical hike in winter.\nThis hike is open to all ages! Participants should meet us at 10am at the parking lot off Beechwood St (detailed directions to come with your registration). Please wear comfortable hiking shoes and bring plenty of drinking water. Depending on weather, ice grips may be recommended.",
        "email_address": "",
        "location": "Time:\n10:00 AM to 12:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "February 21, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/holiday-bazaar/10468/",
        "title": "Holiday Bazaar",
        "descriptionTab": "Join us for our annual fundraising makers market here at Center for Wildlife on Saturday, Dec. 6th from 11AM-3PM! Shop from a wide variety of local makers and mingle with CFW community! A portion of proceeds and any donations made upon registration all go towards injured and orphaned animals in need at Center for Wildlife.",
        "email_address": "",
        "location": "Center for Wildlife\n375 Mountain Road\nCape Neddick, ME 03902",
        "start_time": "11:00 AM",
        "end_time": "3:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/holiday-concert%3a-amarcord/10478/",
        "title": "Holiday Concert: Amarcord",
        "descriptionTab": "From the musical heart of Leipzig, Germany comes amarcord, a mesmerizing five‑voice ensemble founded in 1992 by members of the famed St. Thomas Boys Choir. Celebrated for its exquisite sound, versatility, and radiant performances, amarcord is widely considered among the world’s premier a cappella groups.\nWith voices that effortlessly traverse musical time and space, from medieval plainsong to folk arrangements, amarcord bridges epochs with artistry and soul. The group’s holiday program includes Gustav Holst’s evocative\nIn the Bleak Mid-Winter\n,\nGod Rest Ye Merry Gentlemen\nand other seasonal songs from around the world as well as medieval plainsong and madrigals.",
        "email_address": "tamara@baychamber.org",
        "location": "Bay Chamber Concerts\n5 Mountain Street\nCamden, ME 04843",
        "start_time": "7:00 PM",
        "end_time": "8:00 PM",
        "date": "December 10, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/holiday-in-history-at-the-nathaniel-lord-thompson-house/10386/",
        "title": "Holiday in History at the Nathaniel Lord Thompson House",
        "descriptionTab": "Step into the magic of the season at one of Kennebunk’s most treasured landmarks — the historic\nNathaniel Lord Thompson House\non Summer Street, home to Kennebunk’s very first Christmas tree in 1854.\nOn\nSunday, December 7, 2025\n, from\n2:00 pm – 5:00 pm\n, enjoy an afternoon of holiday cheer as you explore this beautifully decorated 1845 home. Savor seasonal appetizers and sweet treats while soaking in the festive atmosphere and rich history of this remarkable property.\nThis special event is a rare opportunity to experience the elegance and charm of a 19th-century Kennebunk Christmas, surrounded by twinkling lights, historic architecture, and good company.\nTickets:\n$50 per person\n(Advance purchase recommended; space is limited.)",
        "email_address": "",
        "location": "Brick Store Museum\n117 Main St.\nKennebunk, ME 04043",
        "start_time": "2:00 PM",
        "end_time": "5:00 PM",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/holiday-open-house-%7c-directors-circle-and-contemporaries/10576/",
        "title": "Holiday Open House | Director's Circle and Contemporaries",
        "descriptionTab": "Enjoy festive food and drink while checking names off your list with 20% off at the PMA Store, additional pop-up shops with artisans and jewelers, and gift wrapping!\nMore detail coming soon.",
        "email_address": "",
        "location": "Portland Museum of Art\n7 Congress Sq.\nPortland, ME 04101",
        "start_time": "6:00 PM",
        "end_time": "8:00 PM",
        "date": "December 9, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/holiday-open-house-2025/10141/",
        "title": "Holiday Open House 2025",
        "descriptionTab": "Celebrating the end of our season with a community open house. Lets ring in the holidays together nourished by a full season of art and creativity! Nosh on the potluck our board members provide and raise a glass to toast a full season\nbeverages provided by National Distributors, food from our board of directors, and good company provided by community!",
        "email_address": "info@denmarkarts.org",
        "location": "Denmark Arts Center\n50 West Street\nDenmark, ME 04022",
        "start_time": "5:00 PM",
        "end_time": "7:00 PM",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/holistic-healing-workshop/3528/",
        "title": "Holistic Healing Workshop",
        "descriptionTab": "This is for a small group. Call us for details.\nBy appointment only.",
        "email_address": "hakan@alphaomegaconnections.com",
        "location": "Alpha Omega Connections\n1A Mountain View Lane\nCape Neddick, ME 03902",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/holly-jolly-mixology/10377/",
        "title": "Holly Jolly Mixology",
        "descriptionTab": "Join us in the event barn for a festive evening and learn how to prepare seasonal cocktails with our team of skilled bartenders. From infusing liquors with farm fresh ingredients from our gardens to dehydrating fruit wheels for garnish to making delicious shrubs, Earth at Hidden Pond’s cocktails are some of the best around! Includes three (3) cocktail tastings. Part of Hidden Pond's programming for Christmas Prelude!",
        "email_address": "",
        "location": "Kennebunkport Resort Collection\n2 Storer St, Suite 200A\nKennebunk, ME 04043",
        "start_time": "2:00 PM",
        "end_time": "3:30 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/home-for-the-holidays/10432/",
        "title": "Home for the Holidays",
        "descriptionTab": "Sarah Orne Jewett House\n, 5 Portland Street, South Berwick, ME\nJoin us for a festive day celebrating the Holiday Season at Sarah Orne Jewett House. Participating in South Berwick's Annual\nHome for the Holidays Celebration\n, we are inviting the public to stop by and warm up.\nDrop by the visitor's center to create a Victorian paper craft, sip on mulled cider, and hear a Holiday story read by Linda Becker. Story-time will be offered at 10:30 a.m., 11:30 a.m., and 1:00 p.m. Come sing along with the Garrison Player's Carolers at 12:15 p.m. Free first-floor tours of the gorgeously decorated Sarah Orne Jewett House will be available from 10:00 a.m. to 2:00 p.m.",
        "email_address": "",
        "location": "Historic New England\nCastle Tucker, 2 Lee St.\nWiscasset, ME 04578",
        "start_time": "10:00 AM",
        "end_time": "2:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/homeschool-naturalist-fall-2025-session/10639/",
        "title": "Homeschool Naturalist - Fall 2025 Session",
        "descriptionTab": "Witness the exciting changes fall brings and build your ecological literacy with Fields Pond Audubon Center’s Homeschool Naturalists program! Designed for children ages 6-14, this engaging series will start as a whole mixed age group, then break into age based investigation teams to dive deeper into that week’s theme!\nTogether, we’ll:\nStudy the magic behind fall leaves,\nExplore fall seed dispersal and native plant life cycles\nStudy the role of naturalists in identifying trends and patterns in our natural world.\nLearn how the local habitat prepares for the coming winter\nAnd more!\nEach session combines outdoor exploration, guided hiking, and nature journaling to deepen your connection with the natural world.\nDrop-ins are welcome! Please call ahead to ensure space availability.\nEntire Series (6 sessions): $70 per child\nIndividual sessions: $15 per child\nTwo Thursdays of the month, 10 am-12 pm\nSeptember 11 & 25, October 9 & 23, November 6 & 20",
        "email_address": "",
        "location": "Price:\nDrop-ins are welcome! Please call ahead to ensure space availability.\r\nEntire Series (6 sessions): $70 per child\r\nIndividual sessions: $15 per child\nTime:\n10:00 AM to 12:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "November 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/homeschool-steam%3a-weather/10704/",
        "title": "Homeschool STEAM: Weather",
        "descriptionTab": "Join us for Homeschool STEAM (Science, Technology, Engineering, Art, and Math) at the Children’s Museum of New Hampshire. Our November session theme is Weather. This hour-long drop-off class for grades K–2 (ages 5 to 8) includes science experiments, stories, and hands on take home projects related to each theme. Grown-ups are welcome to stay in the building during class time, and families with siblings may opt to play on the second floor during the class—please note that the museum is closed to the public on Tuesday afternoons.",
        "email_address": "neva@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street\nDover, NH 03820",
        "start_time": "1:30 PM",
        "end_time": "2:30 PM",
        "date": "November 4, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/irving-berlin%e2%80%99s-white-christmas/9294/",
        "title": "Irving Berlin’s White Christmas",
        "descriptionTab": "ALL PERFORMANCES OF Irving Berlin's White Christmas ARE IN 2025\nShow dates are November 14, 15, 21, 28, 29, 2025 at 7:30pm + November 16, 22, 23, 30, 2025 at 2pm\nBased on the timeless and beloved film, White Christmas follows Veterans Bob Wallace and Phil Davis, who have a successful song-and-dance act after World War II. With romance in mind, the two follow a duo of beautiful singing sisters en route to their Christmas show at a Vermont lodge, which just happens to be owned by Bob and Phil's former army commander. White Christmas is an uplifting, wholesome musical that will delight audiences of all ages.\nIrving Berlin's White Christmas\nBased Upon the Paramount Pictures Film\nWritten For the Screen by Norman Krasna, Norman Panama and Melvin Frank\nMusic and Lyrics by Irving Berlin\nBook by David Ives and Paul Blake\nOriginal stage production directed by Walter Robbie\nOrchestrations by Larry Blank\nVocal and Dance Arrangements by Bruce Pomahac\nPresented by arrangement with Concord Theatricals www.concordtheatricals.com\nTickets:\n$36 - $38\nPrices include a per ticket handling fee. A portion of all ticket fees are designated to support the Youth Arts Access Fund. Tickets are nonrefundable.\nThis event is eligible for the\nYouth Arts Access Fund\n.\nASL interpreted performance on November 16, 2025\n. Seats marked \"L\" (orchestra right) have an excellent sightline to the interpreter(s).\n2025 Season Pass:\nReceive a 20% discount when you purchase tickets to all four 2025 stage shows in the same order! (The Cottage, Matilda, Deathtrap, White Christmas)",
        "email_address": "boxoffice@watervillecreates.org",
        "location": "1 Common Street\nWaterville, 04901",
        "start_time": "7:30 PM",
        "end_time": "9:30 PM",
        "date": "November 14, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/jay-bragg-presents%3a-christmas-in-vaudeville/10618/",
        "title": "Jay Bragg Presents: Christmas In Vaudeville",
        "descriptionTab": "Step into a magical world where Christmas dreams come alive through the perfect blend of original holiday compositions and beloved classics, all wrapped in the vintage charm of golden-age variety entertainment. King Kazoo & The Reindeer Band invite audiences from 1 to 92 to experience \"The Merriest Show on Earth\" - a whimsical journey featuring Jay Bragg's award-winning original Christmas music alongside timeless holiday favorites, enhanced by authentic variety show elements including audience participation, kazoo orchestras, and delightful surprises that capture the wonder of Christmas morning.\nAs a true Christmas connoisseur, Jay Bragg has earned international recognition for his holiday artistry, having written and recorded over 20 original Christmas compositions that secured him a publishing contract with Howling Music for film and TV placements. The Boston Globe declared \"Jay Bragg's gift to the world is his original Christmas music,\" and since founding this beloved holiday tradition in 2020, Christmas in New Vaudeville has become Nashville's most anticipated seasonal celebration. Now in its fifth triumphant year, this nationally acclaimed show promises an unforgettable evening where vintage variety entertainment meets contemporary Christmas magic, creating memories that last long after the final jingle bell rings.\n\"A joy explosion\" - \"The most fun we've had in years\" - Experience the holiday tradition that transforms Christmas entertainment into pure magic.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "December 4, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/jewelry-auction%3a-the-unreserved-collection/10784/",
        "title": "Jewelry Auction: The Unreserved Collection",
        "descriptionTab": "Visit us in-person or online for our\nUnreserved Jewelry Auction on December 5th\nat Thomaston Place Auction Galleries! This exciting one-day sale includes over 400 affordable secondhand jewelry pieces, featuring luxury wrist/pocket watches, brooches, pendants, earrings, necklaces, and rings of all stones and metals.\nThis sale will offer bidding in-person, by phone, absentee, or online\n.\nVisit our gallery to view items in-person during the 3-day open\npreview from December 2nd - 4th.",
        "email_address": "info@thomastonauction.com",
        "location": "Thomaston Place Auction Galleries\n51 Atlantic Hwy\nThomaston, ME 04861",
        "start_time": "11:00 AM",
        "end_time": "4:00 PM",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/jingle-bells-pony-rides/10378/",
        "title": "Jingle Bells Pony Rides",
        "descriptionTab": "Join us for a picture perfect day as we celebrate the arrival of the holiday season! This event is scheduled early to allow enough time for processing pictures into christmas cards and gifts!\nIf you would like professional Christmas pictures, they can be purchased the day of the event through \"You First Photography\". She will be set up to take a picture of your little ones with Santa and his Christmas Donkeys! For pictures : Cash, card, and Venmo are accepted the day of the event.\nPony/Horse rides are 10 minutes long. There will be ponies and at least two full sized horses for this event. Riders are guided around one of our large fields.\nDress in your holdiay best and celebrate the start of the holiday season us!\nRiders weights are limited to 175lbs for the safety and comfort of our animals.\nRequirements:\n-Closed Toed Shoes\n-Helmet (provided by Foxx Run Farm)\n-Waiver form signed at time of arrival\nFoxx Run Farm reserves the right to choose the best mount for each rider. Rides are first come, first serve.\nThere will be a Santa letter writing station along with hot cocoa and coffee available. Also available: Face painting, christmas gifts, local honey, and Foxx Run Farm merchandise available for purchase to give you a jump start on your holiday shopping as well!\nDue to a large and amazing turnout last year, pony/horse rides will be pre-purchase only using eventbrite tickets. After last year's sell out event we have added a second day for this event. You can now chose which day works better for your schedule Saturday or Sunday.",
        "email_address": "",
        "location": "Price:\n$28.52\nTime:\n1:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/john-david-adams-bass-baritone-%26-morgan-lee-piano/10662/",
        "title": "John David Adams, bass-baritone & Morgan Lee, piano",
        "descriptionTab": "Distinguished bass-baritone John David Adams joins fellow Bay Chamber Music School faculty member pianist Morgan Lee for an evening of music-making that combines virtuosity, warmth, and imagination. Their program includes Mozart’s concert aria for bass,\nPer questa bella mano\n, K.612, as well as a world premiere of the song set\nNothing Gold Can Stay\nby Maine composer Aaron Robinson.\nJohn is a versatile and accomplished artist, acclaimed as a powerful concert soloist and recitalist, equally praised for opera and stage roles. Morgan is an accomplished performer and educator whose artistry has been heard on the national and international stage, admired for her clarity and expressive range. Join us for a concert that offers the chance to experience artistry that is both timeless and brand new.",
        "email_address": "tamara@baychamber.org",
        "location": "5 Mountain Street\nCamden, ME 04843",
        "start_time": "7:00 PM",
        "end_time": "8:00 PM",
        "date": "April 16, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/journaling-with-jewett/10433/",
        "title": "Journaling with Jewett",
        "descriptionTab": "Sarah Orne Jewett House\n, 5 Portland Street, South Berwick, ME\nJoin us for an evening of journaling. Participants will draw inspiration from examples of Sarah Orne Jewett's own diary entries and learn how journal styles have changed through the years. This workshop will introduce participants to bullet journaling, a style that logs daily events and tasks that is different than a traditional journal. Writers create lists and collections that track daily happenings, fitness goals, hobbies, and anything in between. This is an introductory workshop that explores how you can get started. Participants will leave with a basic bullet journal they can continue working on at home.",
        "email_address": "",
        "location": "Historic New England\nCastle Tucker, 2 Lee St.\nWiscasset, ME 04578",
        "start_time": "6:00 PM",
        "end_time": "7:00 PM",
        "date": "December 28, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/joy-to-the-ville/10708/",
        "title": "Joy to the Ville",
        "descriptionTab": "Embrace the holiday and winter spirit at the eighth annual Joy to the Ville community celebration! Join Waterville Creates, the Colby College Museum of Art, the Waterville Public Library, and the Children’s Discovery Museum as we celebrate the magic of the season with movies, art-making, play, and more!\nHighlights include:\nKringleville Santa Claus visits\nDiwali celebration\nThe Polar Express\nat the Maine Film Center\n3D-printing\nButton-making\nGlass-Blowing demonstration\nPopcorn, pizza, hot cocoa, and more!\nThank you to our sponsors\nKennebec Savings Bank\n,\nCentral Maine Newspapers\n, the\nCity of Waterville\n,\nBack Office Solutions\n,\nAllen Insurance\n, and\nPRO Moving Service\n.",
        "email_address": "office@watervillecreates.org",
        "location": "Waterville Creates\n93 Main St\nWaterville, ME 04901",
        "start_time": "9:30 AM",
        "end_time": "4:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/kinky-boots/10610/",
        "title": "Kinky Boots",
        "descriptionTab": "The boots are back! Kinky Boots will lift your spirits to high-heeled heights! Celebrated with six Tony\nAwards®, including Best Musical, a Grammy Award® for Best Musical Theatre Album, and London’s Olivier\nAward for Best Musical, this big-hearted musical hit will have you strutting out of the theater saying\n“Yeah!”\nKinky Boots captivates and entertains audiences around the world with the dazzling Tony-winning score\nby pop legend Cyndi Lauper, hilarious and uplifting book by four-time Tony Award-winner Harvey Fierstein,\nand original direction and Tony-winning choreography by Jerry Mitchell.\nBased on true events, Kinky Boots follows the journey of two people with nothing in common— or so\nthey think. Charlie Price reluctantly inherits his father’s shoe factory, which is on the verge of bankruptcy.\nTrying to live up to his father’s legacy and save his family business, Charlie finds inspiration in the form of\nLola, a fabulous entertainer in need of some sturdy stilettos. As Charlie and Lola work together to turn the\nfactory around, this unlikely pair finds that they have more in common than they realized… and discover that you change the world when you change your mind.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "March 3, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/l%c3%banasa%3a-irish-christmas/10781/",
        "title": "Lúnasa: Irish Christmas",
        "descriptionTab": "“The hottest acoustic Irish band on the planet” (Irish Echo) makes its annual return to the Camden Opera House, 29 Elm St., to welcome the season with traditional Irish music. Cillian Vallely (uilleann pipes and low whistle), Kevin Crawford (flute, whistles and bodhran), Trevor Hutchinson (standup bass), Colin Farrell (fiddle and whistle), Patrick Doocey (guitar) and special guest Dave Curley will fill the House in a concert sponsored by Camden Maine Stay Inn and 40 Paper. Choose-your-own-reserved-seat tickets are $48 in advance, $54 day-of-show via\ncamdenoperahouse.com\nand (207) 236-3154.",
        "email_address": "",
        "location": "Camden Opera House\n29 Elm Street\nCamden, ME 04843",
        "start_time": "7:30 PM",
        "end_time": "9:30 PM",
        "date": "December 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/l-l-bean-home-for-the-holidays-event/10779/",
        "title": "L.L.Bean Home for the Holidays Event",
        "descriptionTab": "Join us for a unique holiday shopping experience! Our Home Store will be highlighting their favorite gift-giving ideas and holiday inspiration, along with fun activities, demos, and food samples. You’ll be sure to find something special for everyone on your list.",
        "email_address": "",
        "location": "L.L. Bean\n15 Casco St.\nFreeport, ME 04033",
        "start_time": "10:00 AM",
        "end_time": "4:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/lecture%3a-%e2%80%9cmaple-syrup%3a-the-original-liquid-gold%e2%80%9d/10690/",
        "title": "Lecture: “Maple Syrup: The Original Liquid Gold”",
        "descriptionTab": "Join Sean Eager, Proprietor of York, Maine-based\nPorcupine Hill Maple Syrup\n, to learn about sugar making. Sean will discuss all aspects of making maple syrup, including how you can do it in your own backyard with just a few trees  You will learn about identifying and tapping trees, collecting and boiling sap, and more.\nPorcupine Hill Maple Syrup has been operating from Eager’s family-owned land since 2015. Recent leases with the York Land Trust and abutting land owners have allowed for increased production and expansion.\nAfter the talk, Porcupine Hill Maple Syrup will be available for purchase. Just in time for the holidays!",
        "email_address": "",
        "location": "Museums of Old York\n207 York St.\nYork, ME 03909",
        "start_time": "1:00 PM",
        "end_time": "3:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/lighted-boat-parade-blessing-of-the-fleet-and-fireworks!/7730/",
        "title": "Lighted Boat Parade, Blessing of the Fleet and Fireworks!",
        "descriptionTab": "A treasured event in our community: The Lighted Boat Parade starts at 6:45 p.m. with the fireworks to follow in the inner harbor. The boats will enter the Harbor from the west, travel clockwise around the inner Harbor, where the fleet will be blessed by our local clergy, and over to the east side.\nThe Boats will make\ntwo loops around the harbor\n– so the judges (the winners of the Lighted Firetruck Parade) and YOU will be able to take it all in!\nThen “ooh” and “ahh” as the sparkling Fireworks display, put on by the Town of Boothbay Harbor, light up the sky!\nRain Date Sunday\nThe Whale Park, Fisherman’s Memorial, and the 1901 Footbridge are perfect spots for viewing outside and there are plenty of cozy waterfront dining options to watch from too!",
        "email_address": "membership@boothbayharbor.com",
        "location": "30 Commercial Street\nBoothbay Harbor, 04538",
        "start_time": "6:45 PM",
        "end_time": "8:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/lighted-fire-truck-parade/10772/",
        "title": "Lighted Fire Truck Parade",
        "descriptionTab": "Lighted Firetruck & First Responders Parade – Boothbay Lights\nCheer on our hometown heroes as Boothbay Lights kicks off the holiday season with the\nLighted Firetruck & First Responders Parade!\nSATURDAY – NOVEMBER 22, 2025\nHonk your horns and cheer as fire, EMS, and law enforcement teams from across the region roll through town in dazzling, decorated vehicles. The competition is heating up!\nJudges will decide who takes home the\nDalmatian Cup\n, while spectators help crown the\nPeople’s Choice Award\nwinner with their votes.\nWANT TO BE IN THE PARADE? HERE’S THE APPLICATION FOR FIRST RESPONDERS\n📱\nTEXT TO VOTE YOUR FAVORITE:\n207-350-5922\nParade Route:\nThe parade begins at\n4:00 PM\nat the Boothbay Fire Station, makes a stop at\nSt. Andrews Village\n, then travels through town via Oak Street, turning left at the Library and down Townsend Avenue before ending at the\nMeadow Mall\nfor the awards ceremony.\n🎅 Keep your eyes open —\nSanta & Mrs. Claus\nwill make a special appearance!\n✨ After the parade, follow the lights to the\nFirst Responders Chili Cook-Off\ninside Meadow Mall for food, fun, and friendly competition! Details below 👇\nChili Cook-Off\nAfter the\nLighted Firetruck & First Responders Parade\n, the heat turns up! Head over to\nMeadow Mall (Suite F)\nfor a cozy, crowd-pleasing\nChili Cook-Off\nthat’s open to everyone!\nFREE for all First Responders\nas our way of saying thank you.\nJust $10 at the door for the public\n— and that includes unlimited chili tastings and your voting card!\nYou’ll be the judge as\nfirefighters, police, and professional chefs\ngo head-to-head for the coveted\nGolden Spoon Award\n. Each ticket holder gets a\ncolored bracelet\n,\nspoon\n, and\nvoting card\nat entry.\nSample each chili, cast your vote for your favorite, and see who takes home the win!\nAs soon as the votes are tallied, we’ll announce the winners and celebrate our community’s best cooks!\nWHEN: SATURDAY, November 22,\nStarts right after the parade (around 5:00 PM)\nWHERE: Meadow Mall, Suite F – Boothbay Harbor\nCome warm up after the parade with good food, great company, and a whole lot of local pride. This is one tasty way to kick off the Boothbay Lights season — and everyone’s invited!\nLearn more about all the Boothbay Lights festivities →\nwww.boothbaylights.com",
        "email_address": "membership@boothbayharbor.com",
        "location": "Boothbay Harbor Region Chamber of Commerce\n192 Townsend Avenue\nBoothbay Harbor, 04538",
        "start_time": "4:00 PM",
        "end_time": "6:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/lighthouse-van-tour/10712/",
        "title": "Lighthouse Van Tour",
        "descriptionTab": "Skip the city and head straight to the coast on this dedicated lighthouse tour of Maine’s best lighthouses. Explore three iconic beacons that have guided sailors for centuries, each offering a chance to delve into their rich history. While most lighthouses aren’t open for tours, you’ll still get up-close views and plenty of opportunities to admire their stunning architecture and scenic surroundings. As you navigate through Portland’s picturesque coastline, you’ll be surrounded by breathtaking views that are as storied as they are beautiful. This focused, relaxed tour is the perfect way to connect with maritime past while soaking in the charm of Maine’s coastal landscape.\nWhat’s Included\nVisits to three historic lighthouses.\nGuided insights into the history and significance of each site.\nLocally made Maine snack.\nBottled water in transit and water at partner locations.\nWhat’s Not Included\nFood or beverages.\nGratuities for the guide or driver.\nWhat to Bring\nComfortable shoes for walking on uneven surfaces.\nWeather-appropriate clothing.\nA camera for capturing the coastal beauty.",
        "email_address": "dylan@portlandexplorer.com",
        "location": "Portland Explorer Tours\n320 Fore Street\nPortland, ME 04101",
        "start_time": "10:30 AM",
        "end_time": "12:00 PM",
        "date": "November 1, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/limestone-christmas/10724/",
        "title": "Limestone Christmas",
        "descriptionTab": "Join the Limestone Chamber of Commerce on Sunday, December 7 at Rotary Park on Main Street for their Limestone Christmas. The time is from 3:30pm-5:30pm and we will have free snacks, a tree lighting count down - join in caroling around the tree, visit with Santa Claus and Mrs.Claus. Take a turn talking with Santa and pictures are welcome. We can also take your picture for you! Each child will leave with a wrapped gift.",
        "email_address": "ldfchamberlimestonemaine@gmail.com",
        "location": "Limestone Chamber of Commerce\nMain Street, Rotary Park, downtown\nLimestone, ME 04750",
        "start_time": "3:30 PM",
        "end_time": "5:30 PM",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/little-artists%3a-paint/10706/",
        "title": "Little Artists: Paint",
        "descriptionTab": "Join us for Little Artists at the Children’s Museum of New Hampshire. We are excited to invite little artists (ages 3.5–5 years old) to our December session, offered on the first Monday of the month! This 45 minute drop-off class includes a story and an art project to take home. Grown-ups are welcome to stay in the building during class time, and families with siblings may opt to play on the second floor during the class time—please note that the museum is closed to the public on Mondays.",
        "email_address": "neva@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street\nDover, NH 03820",
        "start_time": "10:45 AM",
        "end_time": "11:30 AM",
        "date": "December 1, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/live-irish-music-jam-sessions-at-paddy-murphys/9578/",
        "title": "Live Irish Music Jam Sessions at Paddy Murphy's",
        "descriptionTab": "Paddy Murphy’s Live Irish Jam 6-8pm & Open Mic, 9pm to close!",
        "email_address": "",
        "location": "Downtown Bangor Partnership\n23 Hammond St, Suite 233\nBangor, ME 04401",
        "start_time": "9:00 PM",
        "end_time": "",
        "date": "March 11, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/logger-fest-2026/8177/",
        "title": "Logger Fest 2026",
        "descriptionTab": "Join us for a weekend filled with the rugged spirit of forestry at The Greater Fort Kent Area Chamber of Commerce's Biennial Logger Festival, held in the heart of Fort Kent, ME. This family-friendly event celebrates the rich logging heritage of our community, showcasing the skills, traditions, and spirit of those who work in the industry. From thrilling lumberjack demos to equipment touch a truck's, there's something for everyone to enjoy. Dive into our local history, enjoy live music, and don't miss the chance to taste authentic logger cuisine. It's more than a festival; it's a tribute to the hardworking men and women who helped shape our community.\nHighlights:\nLumberjack Demos: Witness the strength and skill of professional lumberjacks.\nKids: face painting, dancing, touch a truck.\nLive Music & Entertainment: Enjoy a lineup of local bands and solo artists.\nFood & Drink: Savor the flavors of the forest with a variety of vendors offering traditional logger dishes, local craft beers, and specialty cocktails.",
        "email_address": "",
        "location": "Greater Fort Kent Area Chamber of Commerce\n416 W. Main St.\nFort Kent, ME 04743",
        "start_time": "",
        "end_time": "",
        "date": "May 15, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/made%3a-maine-makers-at-ticonic-gallery/10709/",
        "title": "Made: Maine Makers at Ticonic Gallery",
        "descriptionTab": "Formerly known as the\nHoliday Bazaar\n,\nMade\nis a curated seasonal marketplace that highlights the artistry and craftsmanship of Maine makers, offering visitors a unique selection of locally handmade goods.\nThank you to our sponsors\nKennebec Savings Bank,\nthe\nCity of Waterville\n,\nCentral Maine Newspapers\n, and\nBack Office Solutions\n!\nClosed Tuesdays and Federal Holidays.",
        "email_address": "office@watervillecreates.org",
        "location": "Waterville Creates\n93 Main St\nWaterville, ME 04901",
        "start_time": "11:00 AM",
        "end_time": "7:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/main-street-market-presented-by-renewal-by-andersen/10380/",
        "title": "Main Street Market Presented by Renewal by Andersen",
        "descriptionTab": "Kick off shopping season with this showcase of local creativity!\nCome shop and see one-of-a-kind treasures at our third-annual Main Street Market! You won’t want to miss this opportunity to experience the creativity of local artisans, makers, and crafters—and get a head start on your holiday shopping! This event brings together over 60 talented vendors and features something for everyone, from handcrafted soaps and jewelry to festive decor.\nNew this year: you won’t want to miss the Kid Vendor section up on stage! Support Saco’s smallest makers and burgeoning entrepreneurs!",
        "email_address": "",
        "location": "Saco Main Street\nPO Box 336\nSaco, ME 04072",
        "start_time": "9:00 AM",
        "end_time": "3:00 PM",
        "date": "November 30, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/maine-friends-of-music/10738/",
        "title": "Maine Friends of Music",
        "descriptionTab": "Maine Friends of Music returns for a musical celebration of America’s 250th anniversary year. A varied program of American composers will feature soprano Mary Sullivan, pianist and harpsichordist Sean Fleming, flutist Linda Brunner, and bassoonist David DeBolt. The ensemble has been active in mid-coast Maine for over 25 years, and members have accrued many international credits as well.\nJoin us for a delightful summer concert featuring a wonderful variety of compositions, plus free admission to the museum following the performance.",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "2:00 PM",
        "end_time": "3:00 PM",
        "date": "June 25, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/maine-harvest-festival/10311/",
        "title": "Maine Harvest Festival",
        "descriptionTab": "Sample the best of the best from our Maine vintners, brewers and distillers.  Begin your holiday shopping with festival fiber artisans and their masterpieces and enthusiastic Maine chefs and home cooks as they showcase and share their story, demonstrate, sample and sell what makes Maine, Maine.\nBangor’s Cross Insurance Center staff and festival volunteers are anticipating over 5000 happy shoppers who prefer to “Buy Local” as they meet and greet vendors in our 35,000 S.F. Marketplace.\nWe are very proud of our amazing event and happily share that it was recognized in 2015 as the 5th Best Harvest Festival in the country by USA Today and in 2019 by the Greater Bangor CVB with the Eagle Award for the festival's impact on the community and by being name a \"Best Fall Festival In Maine\" by Trips To Discover.  Come see why for yourself!​",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "10:00 AM",
        "end_time": "4:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/maine-made-crafts-annual-santas-coming-to-town-arts-%26-craft-show/5345/",
        "title": "Maine Made Crafts Annual Santas Coming to Town Arts & craft Show",
        "descriptionTab": "We're back, after renovations!\nMaine Made Crafts will host its Annual Christmas Santas Coming to Town Arts & Craft Show at the Westbrook Armory (Renovations are done, come back and see the new look) with artists & crafters from Maine and New England Saturday & Sunday Nov 22 & 23, 9-4 PM both days, Westbrook Armory, 120 Stroudwater St (across from the Westbrook High School).\nIt's the perfect time to pick up or order your holiday gift purchases from our talented artisans selling their one-of-a-kind handmade wood items, quilt work, knits & crochet, jams & jellies, dolls, jewelry, & more just like you remember when we were here last.\nGive a gift with meaning, give a gift of quality, give a gift made in the USA at our craft show at the Westbrook Armory, from food to knits to lamps and everything in between.\nFor more information call Steven @ 207-946-7079, STpromo37@aol.com or LTpromo@aol.com Promoted by Maine Made Crafts www.newenglandcraftfairs.com",
        "email_address": "LTpromo@aol.com",
        "location": "120 Stroudwater St\nWestbrook, ME 04092",
        "start_time": "9:00 AM",
        "end_time": "4:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/maine-music-series%3a-becca-biggs/10657/",
        "title": "Maine Music Series: Becca Biggs",
        "descriptionTab": "Midcoast songwriter\nBecca Biggs\nhas carved out a distinctive voice over the past decade, blending her Tennessee roots with a sound that is intimate and gritty. Her songs balance emotion and storytelling, driven by a voice that resonates with authenticity. For this Maine Music Series concert, Becca is joined by an all-star band of seasoned collaborators: guitarist\nJ.R. Braugh\n, drummer\nSam Yawdik\n, and bassist/guitarist\nZack Bence\n. Together they create a dynamic mix of folk, alt-country, and rock.",
        "email_address": "tamara@baychamber.org",
        "location": "5 Mountain Street\nCamden, ME 04843",
        "start_time": "4:00 PM",
        "end_time": "5:00 PM",
        "date": "February 8, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/make-your-own-bezel-ring-or-pendant/10373/",
        "title": "Make Your Own Bezel Ring or Pendant",
        "descriptionTab": "Learn the basics of tools, safety, soldering, forming, and stone setting to make a ring or pendant.",
        "email_address": "",
        "location": "Artascope\n48 Railroad Square\nYarmouth, ME 04096",
        "start_time": "1:30 PM",
        "end_time": "7:30 AM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/meduxnekeag-river-race/1246/",
        "title": "Meduxnekeag River Race",
        "descriptionTab": "Paddle faster! We hear there are potatoes at the finish line\nKick off high water season with the\nGreater Houlton Chamber of Commerce\non May 3rd!\nRace Information\nSaturday May 3, at 10:00 A.M. at Wellington's on Station Road in New Limerick.\nCheck-in at the race site from 8:00 A.M. to 9:30 A.M.\nRace Briefing at 9:30 A.M. (Must be at briefing to take part in the race!)\nCourse: From Wellington's to the second bridge in downtown Houlton - Approximately 8 miles.\nImmediately Following the race there will be a lunch and awards ceremony in Riverfront Park.\nDirections To Race Start\nFROM THE SOUTH - Take Exit # 291 off 95 in Smyrna- bear right at exit, turn right at Condon's Market which will be on your\nright approximately 5 miles from exit. Race start is on left, approximately 1 mile from market.\nFROM THE NORTH - From Route #1, take right at third set of lights at the Lincoln Agency (Route 2). Turn left at Condon's\nMarket which will be 5.3 miles. Race start is on left, approximately 1 mile from market.\nFor more information, contact Jane Torres,532-4216 or 694-3414 or email: director@greaterhoulton.com",
        "email_address": "director@greaterhoulton.com",
        "location": "207-532-4216\nEmail",
        "start_time": "10:00 AM",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/merry-and-bright-night/10787/",
        "title": "Merry and Bright Night",
        "descriptionTab": "**SANTA ARRIVES AT 6 PM!**\nHeart of Biddeford is thrilled to invite the community to this year’s\nMerry & Bright Night\non\nFriday, December 5, 2025 from 5:30 to 7:30 p.m.\non Adams Street in downtown Biddeford. Gather with friends and family to enjoy an evening of holiday performances, joyful activities, festive lights, and delicious treats that will bring warmth to even the coldest winter night. Plus, don’t miss the\nMerry Makerfair holiday market\ninside the\nformer courthouse building on Adams Street\n—the perfect place to find unique, handmade gifts. We look forward to seeing you there to kick off the holidays in the heart of Biddeford!",
        "email_address": "",
        "location": "Heart of Biddeford\n205 Main St Suite 103\nBiddeford, ME 04005",
        "start_time": "5:30 PM",
        "end_time": "7:30 AM",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/merry-makers-market/10606/",
        "title": "Merry Makers Market",
        "descriptionTab": "Mark your calendars for Saturday, December 20th, and join us at the\nMerry Makers Market\n—your last chance to complete your holiday shopping in style! Skip the ordinary and explore over 100 local artisans offering unique, handcrafted gifts and services. From thoughtful presents for friends to perfect surprises for loved ones, you’ll find something for everyone while supporting talented makers in our community. Don’t miss this festive shopping experience!",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "12:00 PM",
        "end_time": "5:00 PM",
        "date": "December 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/midday-music-series%3a-danny-holt-piano/10660/",
        "title": "Midday Music Series: Danny Holt, piano",
        "descriptionTab": "After his spectacular performance in the series last season,\nDanny Holt\nreturns to Hammer Hall with a solo piano program that bridges concert hall and club. Known for his dazzling virtuosity, Danny performs around the globe in concert halls such as Carnegie Hall, Walt Disney Concert Hall, and the Hollywood Bowl, as well as in clubs and art galleries. He has collaborated with ensembles including the Los Angeles Philharmonic, Blue Man Group, the Bang on a Can All-Stars, and the Calder Quartet, earning acclaim for his adventurous spirit and versatility.\nFor this program, Holt brings together contemporary works influenced by jazz, rock, and popular music. From Jon Batiste’s reimagined Beethoven and Chopin to the driving rhythms of Karen Tanaka’s Techno Etudes to to the boundary-pushing improvisations of Mike Garson (best known for his work with David Bowie and Nine Inch Nails,) Danny crafts a musical journey full of soul and invention.\nCoffee and cookies served before the concert.",
        "email_address": "tamara@baychamber.org",
        "location": "5 Mountain Street\nCamden, ME 04843",
        "start_time": "1:00 PM",
        "end_time": "2:00 PM",
        "date": "April 3, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/midday-music-series%3a-trio-oko/10658/",
        "title": "MIdday Music Series: Trio Oko",
        "descriptionTab": "You probably haven’t heard anything quite like Trio Oko. The eclectic harp trio is a rare bird in the chamber music world. And its three musicians use the unique instrumentation to dazzle.\n“Their concert indeed evoked joy, demonstrated profound communication, and displayed the strengths of each instrument via thoughtful choices of timbre, articulation, dynamic contrast, and balance,” writes\nThe Boston Musical Intelligencer\n. “Three accomplished individuals playing as a seamless ensemble.”\nTrio Oko’s members, violinist Emma Powell, cellist Mina Kim, and harpist Charles Overton, are united by a mutual belief in the power of music to create meaningful human connections. The Boston-based trio met at the Tanglewood Music Center in 2016.\nCoffee and cookies served before the concert",
        "email_address": "tamara@baychamber.org",
        "location": "5 Mountain Street\nCamden, ME 04843",
        "start_time": "1:00 PM",
        "end_time": "2:00 PM",
        "date": "March 20, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/midday-music-series-concerts/10474/",
        "title": "Midday Music Series Concerts",
        "descriptionTab": "This popular series features musicians from across the globe, offering a lunchtime escape from the hubbub of everyday life. From string quartets, to solo pianists to art song, the Midday Music Series never fails to delight",
        "email_address": "tamara@baychamber.org",
        "location": "Bay Chamber Concerts\n5 Mountain Street\nCamden, ME 04843",
        "start_time": "1:00 PM",
        "end_time": "2:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/mixology-at-earth/10375/",
        "title": "Mixology at Earth",
        "descriptionTab": "Join us at Earth and learn how to prepare classic cocktails with our team of skilled bartenders. From infusing liquors with farm fresh ingredients from our gardens to dehydrating fruit wheels for garnish to making delicious shrubs, Earth at Hidden Pond’s cocktails are some of the best around! Includes three (3) cocktail tastings and light bites.\nPart of Earth at Hidden Pond's Hotel Week Programming.",
        "email_address": "",
        "location": "Kennebunkport Resort Collection\n2 Storer St, Suite 200A\nKennebunk, ME 04043",
        "start_time": "2:00 PM",
        "end_time": "3:30 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/moon-lantern-forest-illuminated-trail-walk/10715/",
        "title": "Moon Lantern Forest - Illuminated Trail Walk",
        "descriptionTab": "Step into the Moon Lantern Forest, where hundreds of radiant lanterns light up the night, weaving a magical glow through the trees. Meander along a spellbinding trail, sparkling with tens of thousands of LED, black, and flood lights that unveil charming hobbit houses, elven structures, and delightful surprises. Perfect for families, this non-scary journey features\nHarvest Moon Hollow\n, a festive autumn nook brimming with playful displays inspired by the luminous full moon of the fall equinox. Nearby,\nFrostlight Village\nglimmers with cozy Christmas magic. With a enchanting soundtrack, this immersive experience celebrates light, joy, and togetherness.\nBut Wait, There’s More!\nJoin an interactive scavenger hunt to enhance your Moon Lantern Forest adventure! Follow clues on your smartphone, snap photos of unique landmarks or glowing installations to earn points and compete for the leaderboard’s top spot. Spot whimsical sculptures or hidden symbols for excitement. Share photos with friends!\nJust scan the QR code upon check in and uncover the forest’s secrets with the Moon Lantern Forest Scavenger Hunt!",
        "email_address": "the.nyte.walk@gmail.com",
        "location": "NYTE Walk\n43 Prospect Hill Rd.\nLebanon, ME 04027",
        "start_time": "5:00 PM",
        "end_time": "9:00 PM",
        "date": "October 23, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/mrs-doubtfire/10612/",
        "title": "Mrs. Doubtfire",
        "descriptionTab": "Everyone’s favorite Scottish nanny is headed to Bangor in this internationally acclaimed hit musical critics\ncall “wonderful, heart-warming, and laugh-out-loud funny” (Manchester Evening News) and “a feel-\ngood, family-friendly comedy that delivers” (The Hollywood Reporter). Based on the beloved film, MRS.\nDOUBTFIRE tells the hysterical and heartfelt story of an out-of-work actor who will do anything for his\nkids. It’s “the lovable, big-hearted musical comedy we need right now,” raves the Chicago Tribune – one\nthat proves we’re better together.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "June 25, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/muddy-boots-concert%3a-nora-%26-marlene/10475/",
        "title": "Muddy Boots Concert: Nora & Marlene",
        "descriptionTab": "Join cellist Nora Willauer and pianist Marlene McCarthy for the first FREE concert of this season’s Muddy Boots Series. Designed to expose children to a variety of musical styles played by some of the nation’s finest musicians, the concerts have a laid back vibe. Audience members are encouraged to move and dance. No need to sit still here.\nThrough interactive storytelling and live performance, Nora and Marlene open a window into the relationships between composers and their music, explaining that creativity often grows out of friendship. Expect laughter, curiosity, and a lively introduction to the cello, piano, and the joy of making music together!",
        "email_address": "tamara@baychamber.org",
        "location": "Bay Chamber Concerts\n5 Mountain Street\nCamden, ME 04843",
        "start_time": "11:00 AM",
        "end_time": "12:00 PM",
        "date": "January 24, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/museum-of-beadwork-annual-online-auction/10496/",
        "title": "Museum of Beadwork Annual Online Auction",
        "descriptionTab": "Please join us for our annual MOB Auction. All proceeds go to our General Fund and to supporting programs, exhibits, and the mission of the Museum Of Beadwork.\nDear Bead Friends,\nIt’s time once again for the Museum of Beadwork’s Annual Auction, November 19-23!\nThis online auction is a fun way to support the Museum of Beadwork and its mission and a great way for folks to find wonderful and unique items for themselves and gifts for others. Last year your donated items helped us raise over $12,000 for our general fund.\nThis year, we are aiming to do even better!",
        "email_address": "",
        "location": "Museum of Beadwork\n915 Forest Ave\nPortland, ME 04103",
        "start_time": "",
        "end_time": "",
        "date": "November 19, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/nature-walks-at-gilsland-farm/10755/",
        "title": "Nature Walks at Gilsland Farm",
        "descriptionTab": "On these walks, we’ll explore the woods, meadows, tidal marsh, and pond at Gilsland Farm, stopping often to indulge our curiosity and observe species and ecological relationships. These walks are for those folks who make terrible hiking partners– you’re in good company here! Binoculars and hand lenses will be available to borrow. Folks are welcome to leave early or stay after 10:00 to use field guides in our Education Resource Center.\nEvery other Tuesday starting Sept. 2, 8-10 am",
        "email_address": "",
        "location": "Time:\n8:00 AM to 10:00 AM",
        "start_time": "",
        "end_time": "",
        "date": "November 25, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/nature-walks-at-gilsland-farm/10756/",
        "title": "Nature Walks at Gilsland Farm",
        "descriptionTab": "On these walks, we’ll explore the woods, meadows, tidal marsh, and pond at Gilsland Farm, stopping often to indulge our curiosity and observe species and ecological relationships. These walks are for those folks who make terrible hiking partners– you’re in good company here! Binoculars and hand lenses will be available to borrow. Folks are welcome to leave early or stay after 10:00 to use field guides in our Education Resource Center.\nEvery other Tuesday starting Sept. 2, 8-10 am",
        "email_address": "",
        "location": "Time:\n8:00 AM to 10:00 AM",
        "start_time": "",
        "end_time": "",
        "date": "December 9, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/nature-walks-at-gilsland-farm/10757/",
        "title": "Nature Walks at Gilsland Farm",
        "descriptionTab": "On these walks, we’ll explore the woods, meadows, tidal marsh, and pond at Gilsland Farm, stopping often to indulge our curiosity and observe species and ecological relationships. These walks are for those folks who make terrible hiking partners– you’re in good company here! Binoculars and hand lenses will be available to borrow. Folks are welcome to leave early or stay after 10:00 to use field guides in our Education Resource Center.\nEvery other Tuesday starting Sept. 2, 8-10 am",
        "email_address": "",
        "location": "Time:\n8:00 AM to 10:00 AM",
        "start_time": "",
        "end_time": "",
        "date": "December 23, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/nature-walks-at-gilsland-farm/10758/",
        "title": "Nature Walks at Gilsland Farm",
        "descriptionTab": "On these walks, we’ll explore the woods, meadows, tidal marsh, and pond at Gilsland Farm, stopping often to indulge our curiosity and observe species and ecological relationships. These walks are for those folks who make terrible hiking partners– you’re in good company here! Binoculars and hand lenses will be available to borrow. Folks are welcome to leave early or stay after 10:00 to use field guides in our Education Resource Center.\nEvery other Tuesday starting Sept. 2, 8-10 am",
        "email_address": "",
        "location": "Time:\n8:00 AM to 10:00 AM",
        "start_time": "",
        "end_time": "",
        "date": "January 6, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/nature-walks-at-gilsland-farm/10759/",
        "title": "Nature Walks at Gilsland Farm",
        "descriptionTab": "On these walks, we’ll explore the woods, meadows, tidal marsh, and pond at Gilsland Farm, stopping often to indulge our curiosity and observe species and ecological relationships. These walks are for those folks who make terrible hiking partners– you’re in good company here! Binoculars and hand lenses will be available to borrow. Folks are welcome to leave early or stay after 10:00 to use field guides in our Education Resource Center.\nEvery other Tuesday starting Sept. 2, 8-10 am",
        "email_address": "",
        "location": "Time:\n8:00 AM to 10:00 AM",
        "start_time": "",
        "end_time": "",
        "date": "January 20, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/navigating-your-way-through-grief%3a-a-healing-retreat/10525/",
        "title": "Navigating Your Way through Grief: A Healing Retreat",
        "descriptionTab": "Finding Clarity while Recovering from Loss\nLife’s inevitable challenges and losses can be overwhelming. Join end-of-life doula, yoga instructor, astrologer, and reiki master Tess Clarkson for a retreat that provides a nurturing environment where you can connect with your inner guru and navigate the path of healing. Our blend of gentle yoga, guided meditation, astrology, and creative writing will help you find clarity, acceptance, and a renewed sense of purpose.\nSessions include:\nGrief & The Body: Gentle Vinyasa for Creating Space\nCosmic Compass: Astrology for Navigating Life’s Changes\nWriting Through Loss: Creative Writing as a Tool for Healing\nAbout Tess Clarkson\nAfter 20 years in New York City first as an Irish dancer performing in Broadway’s Riverdance, then as a lawyer regulating financial markets, Tess now is a writer and life optimizer based in Missouri. As a trained end-of-life doula, yoga teacher (500-hours), certified astrologer, and Reiki master, she helps people tap into their inner guru and tackle taboos. Tess has traveled extensively: first as a dancer with Michael Flatley’s Lord of the Dance, then as a seeker going to an ashram in India, and later with her husband on their quest to visit all 63 U.S. national parks. Her greatest travels have been inward through a broad spectrum of practices and modalities. Tess is a past participant in the self-guided retreat at Sewall House and is thrilled to return as a teacher and to share tools for creating space for grief and living with more connection to the body, mind, and spirit and Universal flow.",
        "email_address": "info@sewallhouse.com",
        "location": "Sewall House - Yoga Retreat\n1027 Crystal Rd.\nIsland Falls, ME 04747",
        "start_time": "",
        "end_time": "",
        "date": "August 19, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/north-pole-express/9350/",
        "title": "North Pole Express",
        "descriptionTab": "Start your trip inside historic 1912 Freeport Station (the main train station at the Museum) by writing your letter to Santa near the warmth of the wood stove.\nTrain conductors will call “All Aboard” and everyone, young and old, will board the train to the North Pole. A special keepsake (that will help spark the magic leap to the North Pole) will be given to each child. Settle into a comfortable seat in the classic passenger car or our open-air “Little Red Caboose” No. 551, built in 1904. As you round the tracks, enjoy the winter wonderland of forest frosted with white snow (weather permitting, of course.)\nThe train will carry you through the Village and arrive at the North Pole (Thorndike Station) where a special guest wearing a red suit with a jolly belly will jump aboard to greet you! Yes, Santa himself will attend!  After meeting the “big guy” in person the train will whisk you back to the station where multiple opportunities await.\nWeather permitting, the exhibits on the Museum’s lower campus will be open for exploring. Visit the Town Hall building for arts and crafts, a hot cocoa bar, and other sweet treats. Grab your s’mores kit and head out to the fire pit, then go on a scavenger hunt around the village!",
        "email_address": "",
        "location": "Boothbay Railway Village\n586 Wiscasset Rd., Rt. 27\nBoothbay, ME 04537",
        "start_time": "10:45 AM",
        "end_time": "4:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/north-pole-express/9351/",
        "title": "North Pole Express",
        "descriptionTab": "Start your trip inside historic 1912 Freeport Station (the main train station at the Museum) by writing your letter to Santa near the warmth of the wood stove.\nTrain conductors will call “All Aboard” and everyone, young and old, will board the train to the North Pole. A special keepsake (that will help spark the magic leap to the North Pole) will be given to each child. Settle into a comfortable seat in the classic passenger car or our open-air “Little Red Caboose” No. 551, built in 1904. As you round the tracks, enjoy the winter wonderland of forest frosted with white snow (weather permitting, of course.)\nThe train will carry you through the Village and arrive at the North Pole (Thorndike Station) where a special guest wearing a red suit with a jolly belly will jump aboard to greet you! Yes, Santa himself will attend!  After meeting the “big guy” in person the train will whisk you back to the station where multiple opportunities await.\nWeather permitting, the exhibits on the Museum’s lower campus will be open for exploring. Visit the Town Hall building for arts and crafts, a hot cocoa bar, and other sweet treats. Grab your s’mores kit and head out to the fire pit, then go on a scavenger hunt around the village!",
        "email_address": "",
        "location": "Boothbay Railway Village\n586 Wiscasset Rd., Rt. 27\nBoothbay, ME 04537",
        "start_time": "10:45 AM",
        "end_time": "4:00 PM",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/north-pole-express/9352/",
        "title": "North Pole Express",
        "descriptionTab": "Start your trip inside historic 1912 Freeport Station (the main train station at the Museum) by writing your letter to Santa near the warmth of the wood stove.\nTrain conductors will call “All Aboard” and everyone, young and old, will board the train to the North Pole. A special keepsake (that will help spark the magic leap to the North Pole) will be given to each child. Settle into a comfortable seat in the classic passenger car or our open-air “Little Red Caboose” No. 551, built in 1904. As you round the tracks, enjoy the winter wonderland of forest frosted with white snow (weather permitting, of course.)\nThe train will carry you through the Village and arrive at the North Pole (Thorndike Station) where a special guest wearing a red suit with a jolly belly will jump aboard to greet you! Yes, Santa himself will attend!  After meeting the “big guy” in person the train will whisk you back to the station where multiple opportunities await.\nWeather permitting, the exhibits on the Museum’s lower campus will be open for exploring. Visit the Town Hall building for arts and crafts, a hot cocoa bar, and other sweet treats. Grab your s’mores kit and head out to the fire pit, then go on a scavenger hunt around the village!",
        "email_address": "",
        "location": "Boothbay Railway Village\n586 Wiscasset Rd., Rt. 27\nBoothbay, ME 04537",
        "start_time": "10:45 AM",
        "end_time": "4:00 PM",
        "date": "December 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/northern-lights-opening-night-%26-tree-lighting/10778/",
        "title": "Northern Lights Opening Night & Tree Lighting",
        "descriptionTab": "Free Activities, 4-8 p.m.\nCelebrate the start of Northern Lights with Santa sightings, free hot cocoa, live acapella music, and so much more!\nTree Lighting Ceremony, 5:45 p.m.\nThe countdown is on! Join our holiday emcees, Blake, Kelly, and Todd from Maine’s Coast 93.1 morning show, for our famous tree lighting ceremony.\nL.L.Bean Winter Spectacular, 6-8 p.m.\nDon’t miss the special premiere of our fantastically festive new projection show, every half hour on the Camp L.L.Bean tent.",
        "email_address": "",
        "location": "L.L. Bean\n15 Casco St.\nFreeport, ME 04033",
        "start_time": "4:00 PM",
        "end_time": "8:00 PM",
        "date": "November 21, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/northern-lights/10776/",
        "title": "Northern Lights",
        "descriptionTab": "Free Daily Activities\nHoliday fun is always on the schedule!\nL.L.Bean Winter Spectacular\n4-8 p.m. | Shows every 30 minutes\nCamp L.L.Bean Tent\nOur dazzling new projection show is a visual spectacle for all ages, taking you on a light-filled journey that will make you believe in magic!\nGET A SNEAK PREVIEW\nFire Pits and Heated Seats\n1-7 p.m. | Discovery Park\nTake a break from all the fun and warm up around one of our fire pits. We’ll save you an L.L.Bean Adirondack, kept cozy courtesy of\nHüga Heated Cushions,\nmade right here in Maine.\nLetters to Santa\nSanta’s Cabin | Discovery Park Stage\nSanta loves getting letters from Northern Lights! Kids can place their holiday wishes in our big red mailbox and we’ll make sure they get to the North Pole.\nFestive Photo Ops\nVarious Locations\nNorthern Lights is made for memories! Grab photo ops in front of our lights, trees, murals, and more—then share them and see other pics with hashtag #BeanOutsider.\nFree Weekly Activities\nWonder is waiting for you seven days a week!\nAll activities below take place in Santa’s Cabin, located on Discovery Park stage, unless otherwise noted.\nPaws with Claus\nMondays, 4-7 p.m.\nBring your pet for a pic with jolly St. Nick.\nHoliday Screen Printing\nTuesdays, 4-7 p.m.\nCraft your own keepsake tea towel.\nKids’ Fireside Stories\nWednesdays, 5-7 p.m.\nWe’ll snack on s’mores and learn about a different cultural celebration each week.\nLive Music & Food Trucks\nThursdays, 5-7 p.m. | Discovery Park\nFeaturing acoustic sets from some of our favorite local musicians.\nNo live music on Thanksgiving Day, 11/27\nMeet Santa Claus\nFridays, 4-8 p.m.\nSat. & Sun., 11 a.m.-5 p.m.\nWith free hot cocoa to warm your spirit.",
        "email_address": "",
        "location": "L.L. Bean\n15 Casco St.\nFreeport, ME 04033",
        "start_time": "",
        "end_time": "",
        "date": "November 21, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/notorious%3a-maine-crime-in-the-public-eye-1690%26%238211%3b1940/9446/",
        "title": "Notorious: Maine Crime in the Public Eye, 1690–1940",
        "descriptionTab": "Experience Maine's fascination with true crime through history from early American printing to the dawn of photojournalism. Explore media sensationalism, public consumption, and the social impact of high-profile Maine crimes.\nNotorious examines the differences and commonalities across sensationalized crimes, the ways in which they captured the public's imagination, and what contemporary media coverage tells us about perception and societal norms.\nThrough case study vignettes from over two and half centuries of Maine history visitors will explore different angles and perspectives of true crime reporting and media consumption—ranging from responsible public information and community crime solving, to perpetuating stereotypes and voyeuristic interest. Visitors will reflect on what drives true crime consumption—throughout history and today.\nMarch 14–December 31, 2025",
        "email_address": "",
        "location": "Maine Historical Society\n489 Congress St. Wadsworth-Longfellow House\nPortland, ME 04101",
        "start_time": "",
        "end_time": "",
        "date": "March 14, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/open-house-at-highland-green/9169/",
        "title": "Open House at Highland Green",
        "descriptionTab": "Join us at Highland Green’s beautiful, new Quarry Cottage Model Home for an informal Open House opportunity:\n- to see the latest in New Construction, Quarry Cottages, Custom Homes and Building Sites\n- to explore any new Available Now homes and\n- to learn more about the benefits of living in the Highland Green community.\nWe also offer individual appointments at your convenience. To schedule an appointment please send an email to: info@highlandgreenlifestyle.com\nRegister online: https://highlandgreenlifestyle.com/events/highland-green-open-house-schedule/",
        "email_address": "info@highlandgreenlifestyle.com",
        "location": "Highland Green\n7 Evergreen Cir.\nTopsham, ME 04086",
        "start_time": "10:00 AM",
        "end_time": "1:00 PM",
        "date": "November 22, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/open-house-at-highland-green/9170/",
        "title": "Open House at Highland Green",
        "descriptionTab": "Join us at Highland Green’s beautiful, new Quarry Cottage Model Home for an informal Open House opportunity:\n- to see the latest in New Construction, Quarry Cottages, Custom Homes and Building Sites\n- to explore any new Available Now homes and\n- to learn more about the benefits of living in the Highland Green community.\nWe also offer individual appointments at your convenience. To schedule an appointment please send an email to: info@highlandgreenlifestyle.com\nRegister online: https://highlandgreenlifestyle.com/events/highland-green-open-house-schedule/",
        "email_address": "info@highlandgreenlifestyle.com",
        "location": "Highland Green\n7 Evergreen Cir.\nTopsham, ME 04086",
        "start_time": "10:00 AM",
        "end_time": "1:00 PM",
        "date": "December 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/ornament-workshop%3a-snowy-owl/10748/",
        "title": "Ornament Workshop: Snowy Owl",
        "descriptionTab": "Use carving tools and wood-burning to create an owl ornament this December in a  workshop at the Wendell Gilley Museum. The class is suitable for beginners but carvers of all levels are welcome. Participants will start with a pre-cut wooden blank, then shape and woodburn it. Students must be at least 12 years old.\nThe workshop will be offered twice: Saturday, Dec. 6 from noon to 3pm, and Thursday, Dec. 11 from 5:30 to 8:30 pm. It will be led by Lynda Millar, who teaches woodburning, carving and papercutting at the Gilley. The cost is $32 for Museum members, and $39 for non-members.  Class size is limited.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "12:00 PM",
        "end_time": "3:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/ornament-workshop%3a-snowy-owl/10749/",
        "title": "Ornament Workshop: Snowy Owl",
        "descriptionTab": "Use carving tools and wood-burning to create an owl ornament this December in a  workshop at the Wendell Gilley Museum. The class is suitable for beginners but carvers of all levels are welcome. Participants will start with a pre-cut wooden blank, then shape and woodburn it. Students must be at least 12 years old.\nThe workshop will be offered twice: Saturday, Dec. 6 from noon to 3pm, and Thursday, Dec. 11 from 5:30 to 8:30 pm. It will be led by Lynda Millar, who teaches woodburning, carving and papercutting at the Gilley. The cost is $32 for Museum members, and $39 for non-members.  Class size is limited.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "5:30 PM",
        "end_time": "8:30 PM",
        "date": "December 11, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/paint-n-sip%3a-circular-winter-scene/10747/",
        "title": "Paint 'n' Sip: Circular Winter Scene",
        "descriptionTab": "Join us for our monthly evening paint ‘n’ sip workshops with instructor Erika Elizabeth at the Gilley for a fun evening of learning and art. Students are guided step by step through the process of painting, with plenty of explanation and instruction along the way.\nEach month has a different theme and inspiration-painting. For December it's a winter nature scene suitable for a holiday card. Skills taught include wet into wet watercolor, with use of ink and salt.\nSip on wine, tea or seltzer as part of this adults-only class, which is suitable for artists of all levels who are at least 21 years old. All materials and beverages provided.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "4:30 PM",
        "end_time": "6:30 PM",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/paula-poundstone/10622/",
        "title": "Paula Poundstone",
        "descriptionTab": "Iconic comedian Paula Poundstone is known for her smart, observational humor and a spontaneous wit that has become the stuff of legend.  She regularly plays theaters across the country, hosts a weekly comedy podcast, Nobody Listens to Paula Poundstone, and is a regular panelist on NPR’s Wait, Wait… Don’t Tell Me. She also voiced the character ‘Forgetter Paula’ in the feature films Inside Out and Inside Out 2.\nPaula has starred in several HBO specials, including Cats, Cops and Stuff, which nabbed a cable ACE award for Best Comedy Special. She was the first female comic to host the White House Correspondents Dinner. She filed live coverage of the 1992 Democratic and Republican National Conventions and the Presidential Inaugural for The Tonight Show with Jay Leno and at the 93rd Emmy Awards. Paula has starred in two television series, both entitled The Paula Poundstone Show. Paula’s second book, The Totally Unscientific Study of the Search for Human Happiness, was one of eight semi-finalists for the Thurber Prize For American Humor; the audiobook was one of five finalists for the AUDIE award for Audiobook of the Year. Paula has released five albums and is featured in several documentaries and compendiums noting influential comedians of our time.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "December 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/pbr%3a-pendleton-whiskey-velocity/10607/",
        "title": "PBR: Pendleton Whiskey Velocity",
        "descriptionTab": "Building upon a decade of bringing Bangor the most thrilling 8 seconds in sports, PBR’s (Professional Bull Riders) Pendleton Whisky Velocity Tour series bucks into the city for the 11\nth\n-straight year.\nThe 2026 three-day event at Cross Insurance Center kickstarts the new year, January 2 – 4 as the action plays out through four rounds to crown a new champion. The bull riding action starts at 8 p.m. ET on Friday, 7 p.m. ET Saturday, and 2 p.m. ET Sunday.\nTop bull riders in the sport will be battling for crucial Velocity Global points in Bangor. Velocity Global points contribute to the Velocity Global Standings and determine which PBR riders are added to the Unleash The Beast tour throughout the season in addition to qualifications for the PBR World Finals in May 2026.\nWhen PBR last came to Bangor in 2025, Dawson Gleaves, a 24-year-old cowboy from Texas, claimed the event title with an aggregate score of 242.5.\nOver the course of the event, 40 riders will appear in all three of the initial rounds, taking on some of the sport’s toughest bulls. After three rounds, the top 10 riders with the highest aggregate scores ride for a chance at the title.\nPBR Elite Seats are available for avid fans who want an exclusive VIP experience while enjoying the world’s top bull riding circuit. These tickets, available in two tiers, offer premium seats, personal on-site concierge at the PBR fan loyalty booth, and more. For more on elite seats, visit\nhttps://pbr.com/elite-seats-unleash-the-beast\n, or call (800) 732, 1727.\nStay tuned to PBR.com for the full 2026 Velocity Tour schedule announcement along with the latest news and results. Be sure to follow the sport on all social media platforms at @PBR.\nEVENT FAST FACTS\n750 tons of dirt (1.5 million pounds) are brought in to transform Cross Insurance Center into a bull-riding mecca.\nThe dirt is a special clay-sand blend establishing a firm enough surface for the bulls to buck hard but soft enough so that every rider is not injured when thrown like a rag doll.\nIt takes 7 semi-trucks to haul in the equipment for the event.\nA crew of about 30 works around the clock to prepare the venue.\nOver 75 of the rankest bucking bulls on the planet will be on site.\nPBR bulls are remarkable animal athletes born to buck. Each is a member of a special breed: The American Bucking Bull.\nBy virtue of competing in PBR, they get the best food and care, avoiding a very brief career in the meat packing industry.\nThe average PBR bull weighs 1,800 pounds.\nThe average bull rider? Just 140 lbs.\nAbout the PBR (Professional Bull Riders) Pendleton Whisky Velocity Tour:\nThe PBR’s Pendleton Whisky Velocity Tour (PWVT) began in 2014 as the premier expansion tour for the PBR. The Velocity Tour, the sport’s fastest-growing tour, brings the excitement and top-levels of cowboy and bovine talent that fans have come to expect from the sport to cities across the United States. The PWVT is proudly supported by Pendleton Whisky, Boot Barn, Cooper Tires, Rank 45, South Point Hotel & Casino, Kubota, the United States Border Patrol, Silencer Shop, Camping World, Wal Mart Health and Wellness, Anheuser Busch, Beatbox Wine and GovX. Every Velocity Tour event is carried live on the PBR App and a host of top line providers that carry PBR RidePass – the PBR’s flagship digital network.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "January 2, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/pen-and-ink-workshop-with-mattie-rose-templeton/10746/",
        "title": "Pen-and-ink Workshop with Mattie Rose Templeton",
        "descriptionTab": "Mattie Rose Templeton — the Gilley's People-Nature-Art presenter in December — will teach a two-hour pen-and-ink drawing workshop on Wednesday, Dec. 3, at the Gilley beginning at 10:30 a.m. Participants will draw loons, and have the opportunity to finish them in watercolor. The cost is $31 per person for Museum members and $38 for non-members. All materials will be provided. Space is limited and registration is required at www.wendellgilleymuseum.org/calendar.\nMattie Rose is inspired by the natural world, and through art she explores our connection to nature, including the undeniable fragility that is found there. Her goal is to produce art that moves the viewer beyond the piece itself, and into a place of storytelling.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "10:30 AM",
        "end_time": "1:00 PM",
        "date": "December 3, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/pendelton-whiskey-velocity-tour/3907/",
        "title": "Pendelton Whiskey Velocity Tour",
        "descriptionTab": "The PBR’s (Professional Bull Riders) Pendleton Whisky Velocity Tour (PWVT) is bucking into Maine, one of the tour’s most popular stops, for a three-night event March 11-13, 2022.\nTickets for this and other shows at the Cross Insurance Center can be purchased online at\nticketmaster.com\nor at the Maine Credit Unions Box Office inside the Cross Insurance Center during\nbusiness hours\n.\nGroups of 10+ can save! Contact Chris McGrail at 207-561-8311 or email him at chris.mcgrail@spectraxp.com to purchase group tickets or for more information. Tickets can also be purchased on Ticketmaster.com by clicking the “Group Tickets” link at the top of the page!\nTwo and Three Day Passes available with limited availability. Want to enjoy the Professional Bull Riders for multiple days at a discounted rate and in the same seats? Look no further and buy one of our Two or Three Day Pass options.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/people-nature-art-with-mattie-rose-templeton/10745/",
        "title": "People-Nature-Art with Mattie Rose Templeton",
        "descriptionTab": "Mattie Rose Templeton is inspired by the natural world, and through art she explores our connection to nature, including the undeniable fragility that is found there. Her goal is to produce art that moves the viewer beyond the piece itself, and into a place of storytelling. “Art has always been a way to record history through visual storytelling,” she says.\nUsing an “old-fashioned” ink well, with variously sized nibs, Mattie Rose works with texture and line, often avoiding the use of color, because she finds the contrast of black and white more dramatic. She adds a conceptual quality to her art with geometric shapes and patterns layered into an otherwise realistic piece.\nMattie Rose will be at the Wendell Gilley Museum in person to share her storytelling as the museum’s People-Nature-Art presenter for December on Tuesday, Dec. 2. There will be a 6 p.m. artist’s reception followed by her presentation at 7 p.m. which will happen in person and simultaneously livecast. Both in-person and online attendance is free, but registration is required at www.wendellgilleymuseum.org/calendar.\nMattie Rose is a self-taught artist whose work is now carried in more than 75 stores in New England and beyond. She was born and raised in rural Maine, and lived off the grid with her parents and three siblings. She credits this lifestyle as the foundation of the blooming of her vivid imagination.\nNow she can often be found sitting in front of a big window, pen in hand, looking out at the beautiful mountains of Grafton Notch from her own off-grid home.  She has published a children’s book in collaboration with the Appalachian Mountain Club and is working on a second one.  During the summer she participates in many multi-day art fairs in Maine and New Hampshire; year-round she makes art, is a mom to two young children, and works the land around her home.\nPeople-Nature-Art is a free monthly series that brings artists, writers, carvers, and creative types of all kinds to the Gilley to explore how nature and art interact in their work, and how their art impacts their own approach to nature. It is sponsored by our friends at Bar Harbor Bank & Trust.",
        "email_address": "mel@wendellgilleymuseum.org",
        "location": "Wendell Gilley Museum of Bird Carving\n4 Herrick Rd.\nSouthwest Harbor, ME 04679",
        "start_time": "6:00 PM",
        "end_time": "8:00 PM",
        "date": "December 2, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/portland-beer-%26-spirits-van-tour/10714/",
        "title": "Portland Beer & Spirits Van Tour",
        "descriptionTab": "Raise a Glass to Portland’s Craft Beverage Scene\nCelebrate Portland’s vibrant craft beverage culture with this popular 3-stop tour. Visit a handpicked selection of breweries, wineries, distilleries, and cideries, where you’ll enjoy tastings and gain insight into the artistry behind the drinks. Whether you’re a local or a visitor, this tour is perfect for those eager to sip and savor the best Portland has to offer. Explore the heart of the city’s craft culture, learning about the craftsmanship that defines Maine’s exceptional beer, wine, and spirits scene. Each stop is chosen for its unique contribution to the local beverage landscape, making this tour a must-do for enthusiasts and newcomers alike.\nWhat’s Included\nVisits to three local craft beverage producers.\nTastings of beer, wine, cider, or spirits at each stop.\nBehind-the-scenes insights from experts.\nLocally made Maine snack.\nBottled water in transit and water at partner locations.\nWhat’s Not Included\nAdditional food or drinks.\nGuide gratuities.\nWhat to Bring\nValid ID (21+ required for alcohol).\nComfortable shoes.\nAn appreciation for craft beverages!",
        "email_address": "contact@portlandexplorer.com",
        "location": "Portland Explorer Tours\n320 Fore Street\nPortland, ME 04101",
        "start_time": "1:00 PM",
        "end_time": "2:30 PM",
        "date": "November 1, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/portland-wharf-walk%3a-seafood-stories-%26-history/10713/",
        "title": "Portland Wharf Walk: Seafood, Stories & History",
        "descriptionTab": "Discover Portland’s Maritime and City Heritage\nExplore Portland’s Old Port and waterfront on a guided walk that brings the city’s fascinating past to life. This immersive experience blends local history with maritime culture, offering a deeper look at how Portland grew from a rugged seaport into one of New England’s most vibrant coastal cities. As you stroll the cobblestone streets and working wharfs, your guide will share tales of shipbuilders, merchants, fires, and fishermen who shaped Portland’s story. The tour concludes with a warm bowl of classic New England clam chowder—a delicious taste of Maine’s coast and a comforting way to end your walk through history.\nWhat's Included\nGuided walking tour of Portland’s historic Old Port and working waterfront\nFascinating stories about Portland’s maritime and city history—from shipbuilding to the Great Fire\nA warm cup of classic New England clam chowder from a local favorite\nItinerary\nMeet at Portland Beer Hub\nin the heart of the Old Port for a welcome and introduction to Portland’s history.\nWalk through the city’s historic streets and wharfs\n, discovering how Portland’s past was shaped by maritime trade, shipbuilding, and the resilience of its people after the Great Fire of 1866.\nConclude with a taste of Maine\n— a hearty bowl of classic New England clam chowder at a beloved local spot, the perfect way to end your walk through Portland’s history and culture.\nHighlights\nExperience the heart of Portland’s history\nStep back in time as you explore the Old Port’s cobblestone streets and wharfs with a local guide who brings the city’s maritime and cultural history to life. Learn how shipbuilders, merchants, and immigrants helped shape this iconic coastal community.\nSee the working waterfront up close\nWatch lobster boats unload their catch and stroll past centuries-old wharfs still buzzing with life. This is the real Portland—where the past and present meet along the harbor.\nSavor a taste of Maine tradition\nFinish your walk with a comforting bowl of classic New England clam chowder from a local favorite. Whether it’s cool sea air or crisp autumn weather, it’s the perfect way to warm up and experience Maine’s culinary heritage.\nPerfect for history lovers and coastal explorers\nWhether you’re passionate about Portland’s past or just looking for an authentic local experience, this tour blends storytelling, scenery, and flavor in one unforgettable walk through Maine’s maritime heart.\nFAQ\nWhat type of seafood is included?\nThis tour concludes with a warm bowl of classic New England clam chowder from a beloved local spot—a comforting taste of Maine’s coast.\nHow much walking is involved?\nThe tour covers approximately 1 mile at a relaxed pace through Portland’s Old Port and along historic wharfs. Some uneven surfaces are possible, so comfortable footwear is recommended.\nWhat if I’m allergic to seafood?\nPlease inform us when booking or before your tour. While the chowder is the featured tasting, we’ll do our best to provide an alternative option when possible.\nIs this tour family-friendly?\nYes! The Wharf Walk is a fun and educational experience for guests of all ages, combining Portland’s history, maritime culture, and local flavor in one engaging experience.",
        "email_address": "contact@portlandexplorer.com",
        "location": "Portland Explorer Tours\n320 Fore Street\nPortland, ME 04101",
        "start_time": "11:00 AM",
        "end_time": "12:30 PM",
        "date": "November 1, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/preschool-nature-hour-at-fields-pond/10633/",
        "title": "Preschool Nature Hour at Fields Pond",
        "descriptionTab": "Preschool Nature Hour\nYoung children and their grown-ups are invited to spend an hour exploring nature together through stories, songs, art, and play.\nAges 2-5, d\nrop-ins may be available upon request, please call for availability.\nFridays, 9:30-10:30 am\n9/19, 10/3, 10/17, 10/31, 11/14",
        "email_address": "",
        "location": "Price:\n$14/session member ($70 for the series)\r\n$18/session nonmember ($80 for the series)\nTime:\n9:30 AM to 10:30 AM",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/project-wild-k-12-terrestrial-guide/10640/",
        "title": "Project WIld k-12 Terrestrial Guide",
        "descriptionTab": "Project WILD is an award-winning, hands-on environmental education curriculum that teaches wildlife ecology, conservation, and ecological issues while developing critical thinking skills across multiple disciplines. This experiential learning workshop introduces participants to Maine-specific wildlife activities and provides the exclusive Project WILD K-12 Terrestrial Curriculum & Activity Guide, only available through workshops. Perfect for classroom teachers, homeschoolers, scout leaders, and nature educators, participants will experience sample activities and earn professional development credit hours. The workshop combines indoor and outdoor learning, so dress appropriately for weather conditions.",
        "email_address": "",
        "location": "Price:\n$30 per person\nTime:\n9:00 AM to 3:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "November 17, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/public-supper/7724/",
        "title": "Public Supper",
        "descriptionTab": "On November 15th, 2025 join the Southern Aroostook Agricultural Museum for a roast pork supper with all of the fixings. Try a new entrée each month. Have a great meal and see the showcase of Aroostook County farming memorabilia. Dine in or take-out.\nAll proceeds designated for museum projects.",
        "email_address": "southernaroostookagmuseum@gmail.com",
        "location": "Southern Aroostook Agricultural Museum\n1664 US Hwy Rt. 1\nLittleton, ME 04730",
        "start_time": "4:30 PM",
        "end_time": "6:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/registered-maine-recreation-guide-course/10719/",
        "title": "Registered Maine Recreation Guide Course",
        "descriptionTab": "Have you ever dreamed of becoming a Registered Maine Guide? After graduating from our Maine Guide School and training program, you can sit for the State of Maine Registered Maine Guide test. Our Recreation Maine Guide School is hands down the best training courses in the State of Maine. Take your Registered Maine Guide Course with a company that runs daily trips and knows the industry like no other. A Recreational Maine Guide License allows you to lead non-hunting, non-fishing outdoor trips, which include hiking, biking, skiing, canoeing, kayaking, snowmobiling, ATV, and other day and overnight trips in the State of Maine. Learn and perfect all you need to know to successfully pass the State-administered test, including map & compass, catastrophic event, watercraft laws, trip planning, safety, risk management, camping, outdoor cooking, rules and regulations, and canoeing skills, the business side of guiding, and much more.\nLearn from experienced and working Maine Guides as this course is taught by our very own Registered Maine Guides!",
        "email_address": "info@northeastwhitewater.com",
        "location": "Northeast Whitewater Outdoor Guides\n155 Greenville Rd.\nShirley Mills, ME 04485",
        "start_time": "9:00 AM",
        "end_time": "5:00 PM",
        "date": "February 13, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/rock-the-boat%3a-new-years-eve-at-the-boathouse/10312/",
        "title": "Rock the Boat: New Year's Eve at The Boathouse",
        "descriptionTab": "Bid farewell to 2025 and welcome 2026 at the most electrifying New Year's Eve extravaganza in downtown Kennebunkport at\nThe Boathouse Waterfront Hotel & Restaurant\n! Kick off the night with a delectable array of snacks and sweet treats, all while enjoying our signature cocktail, beer, or wine.\nGet ready to groove as we spin the hottest tracks, keeping the dance floor alive until the early hours. Don’t forget to strike a pose at our enchanting photobooth station, where you can glam up and instantly share your favorite moments. As the clock strikes midnight, join us for a sparkling toast to new beginnings. Dance under the shimmering lights and immerse yourself in a night filled with music, laughter, and pure bliss.\nDon’t miss out on the party of the year—this New Year's Eve, we’re turning the celebration up till\n12:00AM\n! Let’s make unforgettable memories together!\nTickets include:\n🍰 Sweet treats\n🍸 One complimentary drink ticket per person, to be used for our signature cocktail, beer, or wine\n📸 Photobooth Station\n💃 DJ music\n🥂 Complimentary midnight Champagne toast\n🎉 And celebratory vibes all night long!\nThis event is 21 and over. Cash bar available for all beverage purposes.\nThe Boathouse Waterfront Hotel & Restaurant\n21 Ocean Avenue Kennebunkport, ME 04046",
        "email_address": "marketing@krcmaine.com",
        "location": "Kennebunkport Resort Collection\n2 Storer St, Suite 200A\nKennebunk, ME 04043",
        "start_time": "9:00 PM",
        "end_time": "12:00 AM",
        "date": "December 31, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/saco-bucks-saturday/10381/",
        "title": "Saco Bucks Saturday",
        "descriptionTab": "Saco Bucks Saturday is a vibrant downtown shopping event that encourages our community to support local businesses! Taking place on the Saturday after Thanksgiving, this event invites shoppers to explore the heart of Saco as they discover unique shops, special promotions, and exclusive discounts offered by our beloved local retailers – and get to spend their $10 Saco Bucks vouchers that represent a direct re-investment in Saco’s small business economy.\nIn 2024, we distributed 470 $10 Saco Bucks vouchers to shoppers during Saco Bucks Saturday, jumpstarting the holiday shopping season. Shoppers use the vouchers at participating locations and Saco Main Street then re-imburses them for the Saco Bucks they collect.",
        "email_address": "",
        "location": "Saco Main Street\nPO Box 336\nSaco, ME 04072",
        "start_time": "9:00 AM",
        "end_time": "12:00 PM",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/saco-festival-of-lights/10382/",
        "title": "Saco Festival of Lights",
        "descriptionTab": "The Holiday Festival & Parade of lights is a festive Saco tradition, blending festive daytime fun with the dazzling parade in the evening. During the daytime festival, families can enjoy story time with Santa, live carolers on Main Street, winter craft activities, the Festival of Trees at the Saco Museum, and other holiday activities before the Parade of Lights takes center stage. With glowing floats, lively dancers, and holiday displays, Main Street transforms into a winter wonderland.",
        "email_address": "",
        "location": "Saco Main Street\nPO Box 336\nSaco, ME 04072",
        "start_time": "1:00 PM",
        "end_time": "7:00 PM",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/santa-%26-friends-community-tree-lighting-lighted-boat-parade-%26-fireworks/10773/",
        "title": "Santa & Friends, Community Tree Lighting, Lighted Boat Parade & Fireworks",
        "descriptionTab": "🎄 First Saturday in December – The Boothbay Harbor Region\nkicks off the holiday season with one of the\nbest family-friendly Christmas events in Boothbay Harbor\n! This festive day is packed with holiday cheer and activities for all ages.\nSanta & Friends Arrive by Boat 2:00 PM\nSanta Claus and his friends make a grand entrance by boat\nat Whale Park/town landing. Families can enjoy a\nMeet & Greet at the Pot Buoy Tree from 2:30 – 4:00 PM\n, complete with holiday crafts, games, seasonal music, and treats for waiting families waiting to meet the jolly team.\nCaroling & Community Tree Lighting – 4:45 PM\nJoin the\nannual Boothbay Harbor Community Tree Lighting\nat the Memorial Library with caroling before the Big Guy in Red comes to light the library’s tree. Setting the stage for the evening’s festive celebrations\nAnnual Lighted Boat Parade – 6:45\nThen, the beloved\nLighted Boat Parade in Boothbay Harbor\nlights up the water with beautifully decorated boats, creating a magical holiday display for visitors and locals alike. –\nWant to be in the parade?\nWe’d love to have you!\nLight up the harbor and spread holiday cheer as we celebrate the season Boothbay-style — with twinkling lights reflecting off the water, music, and magic all around. Each participating boat receives $50 to help with fuel costs. Deck your boat with fun colors, coastal charm, or creative whimsy; your participation makes this event truly unforgettable for locals and visitors alike.\nAPPLICATION HERE\nPrize money – 1st place – $300, 2nd Place -$200, and 3rd place $100 | To be Judged by the winners of the Lighted Fire Truck & First Responder Parade\nHoliday Fireworks –  Following the Parade\nEnd the evening with\nspectacular fireworks over Boothbay Harbor\n, a perfect finale for this seasonal celebration. The Whale Park, Fisherman’s Memorial, Our Lady Queen of Peace Catholic Church, and the 1901 Footbridge are perfect spots for viewing! OR find a cozy waterfront restaurant and see the show from your table!\nAll events are weather-dependent. In case of rain, activities will move to Sunday, December 7th.\nCheck out all the fun events during the 6 sparkling weeks of Boothbay Lights – Mid November – December – www.boothbaylights.com",
        "email_address": "membership@boothbayharbor.com",
        "location": "30 Commercial Street\nBoothbay Harbor, 04538",
        "start_time": "2:00 PM",
        "end_time": "6:45 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/santa-is-coming-to-mclaughlin-garden-and-homestead/10780/",
        "title": "Santa Is Coming To McLaughlin Garden and Homestead",
        "descriptionTab": "Celebrate the Christmas season with a special visit from Santa at the\nMcLaughlin Garden and Homestead\non Saturday, November 29, from 9:00 AM to 12:00 PM! Families can enjoy free photos with Santa, free parking and free candy canes for the kids in a festive and inviting holiday setting at Santa’s first stop in South Paris on November 29th ahead of the big parade!\nJoin us before heading out to watch Maine’s largest Christmas Parade - now in its 40th year! Held in the towns of South Paris and Norway in the Oxford Hills region, this beloved holiday tradition marches right by the McLaughlin Garden and Homestead.\nAdding to the excitement,\nLuchador’s\nFood Truck will be in the parking lot bringing parade tailgating to a whole new level! They will be serving hot breakfast burritos, breakfast churros, and hot coffee - perfect for keeping warm and festive while you shop and wait for the parade.\nIn addition to Santa’s visit,  the Annual Wreath Sale will be happening all day at the McLaughlin Garden and Homestead, and in November during gift shop hours.  Beautiful wreaths and swags - crafted from locally picked boughs from the property of McLaughlin Garden volunteer Becky Burke - will be available for purchase.   All proceeds benefit the McLaughlin Garden and Homestead.\nThe wreath sale runs from 9:00 AM to 4:00 PM and includes:\n12” Spruce and Fir Wreaths\n9” Holly and Cedar Wreathes\n16” Swags\nAll wreaths are decorated with bows, and pinecone decorations may be added for an additional fee.\nVisitors can shop at the McLaughlin Garden and Homestead Gift Shop, open from 9:00 AM to 4:00 PM, and take part in the holiday raffle featuring six incredible prizes:\n$25 McLaughlin Garden and Homestead Gift Card\nHandcrafted Bluebird House - made by a Garden volunteer\nA Christmas Decoration\nHandcrafted Necklace by local artisan Susan Weiler\nA New Toy\nA Surprise item!\nRaffle tickets are just 6 for $5.00, and all proceeds help support McLaughlin Garden and Homestead.\nThis fun-filled event is free and open to the public - just bring your holiday spirit, enjoy great food while tailgating, do some shopping, and capture a memory with Santa before the parade!\nEvent Details:\nDate: Saturday, November 29, 2025\nTime: 9:00 AM – 12:00 PM (Photos with Santa)\nGift Shop Hours: 9:00 AM – 4:00 PM\nWreath Sale: 9:00 AM – 4:00 PM\nLocation: McLaughlin Garden and Homestead, 97 Main Street, South Paris, Maine\nCost: Free photos, free parking, free candy canes for the kids\nRaffle: 6 tickets for $5 — 6 great prizes!\nFood: Luchador’s Food Truck on site\nThis event is made possible thanks to the generous support of our 2025 season sponsors,\nMaineHealth Stephens Hospital\nand\nNorway Savings Bank\n.\nThose who would like to enjoy more of the holiday season at the McLaughlin Garden and Homestead, may want to partake in our wreath collecting and wreath building opportunities, and our upcoming Annual Wreath Sale.\nCollecting Greens\nNovember 17 from 9:00 AM to 1:00 PM:  Need an excuse to get out into the woods? Meet at the Garden before carpooling to volunteer Becky Burke’s Waterford wood lot to collect greens.\nBuilding Wreaths\nNovember 18 and November 19 from 9:30 AM to 5:00 PM:  Want to learn how to make a wreath or swag? This is your chance! Learn to create vibrant wreaths from our seasoned experts and help support McLaughlin Garden and help assemble festive wreaths and swags for our annual sale.  No experience needed! All materials provided.\nAnnual Wreath Sale\nNovember 21 - November 30 (or until we run out):  this holiday season, furnish your front door with a lovely handmade wreath, crafted by McLaughlin Garden volunteers.  Made with sustainably- harvested, local evergreen tips, these stylish adornments are sure to evoke some holiday cheer.\nSchedule as follows for the Annual Wreath Sale, and our November Gift Shop hours:\nNovember 21st from 10:00 AM to 4:00 PM\nNovember 22nd from 10:00 AM to 4:00 PM\nNovember 28th from 11:00 AM to 6:00 PM\nNovember 29th from 9:00 AM to 4:00 PM\nNovember 30th from 11:00 AM to 4:00 PM\nFor more information, please visit the McLaughlin Garden events page at\nhttps://mclaughlingarden.org\nor call (207) 743-8820 to learn more about this event and other seasonal offerings at the McLaughlin Garden and Homestead.",
        "email_address": "",
        "location": "McLaughlin Garden\n97 Main St.\nSouth Paris, ME 04281",
        "start_time": "9:00 AM",
        "end_time": "12:00 PM",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/scheherazade/10506/",
        "title": "Scheherazade",
        "descriptionTab": "Inspiration comes in all forms—whether it’s the sounds of a neighborhood, a different style of music, or even stories from over one thousand years ago.\nInspired by the tales of\nOne Thousand and One Nights,\nScheherezade\ntakes its name from the legendary heroine who spins adventurous tales to keep the attention of a murderous Sultan and save her life. From those stories springs Rimsky-Korsakov’s symphonic narrative of fairy-tale wonders.\nKicking off the concert is an aural homage to New York’s multicultural palette by modern composer Jessie Montgomery. Also featured on the program is Ravel’s lighthearted and brilliant Piano Concerto with its clear influences from blues and jazz, brought to life by pianist Clayton Stephenson’s joyous charisma and natural ease.",
        "email_address": "",
        "location": "20 Myrtle Street\nPortland, ME 04101",
        "start_time": "2:30 PM",
        "end_time": "",
        "date": "November 16, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/seed-sowing-workshop-at-gilsland-farm/10764/",
        "title": "Seed Sowing Workshop at Gilsland Farm",
        "descriptionTab": "Join Maine Audubon for a hands-on workshop to learn how to grow native plants from seed using the natural process of winter sowing. Participants will explore the benefits of starting native wildflowers, grasses, and shrubs from seed, discover simple techniques for success, and create their own take-home seed containers to nurture through the winter. This workshop is a great way to support pollinators, birds, and biodiversity right in your own backyard.",
        "email_address": "",
        "location": "Price:\n$25 Member, $30 Nonmember\nTime:\n10:00 AM to 12:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/seed-sowing-workshop-at-gilsland-farm/10769/",
        "title": "Seed Sowing Workshop at Gilsland Farm",
        "descriptionTab": "Join Maine Audubon for a hands-on workshop to learn how to grow native plants from seed using the natural process of winter sowing. Participants will explore the benefits of starting native wildflowers, grasses, and shrubs from seed, discover simple techniques for success, and create their own take-home seed containers to nurture through the winter. This workshop is a great way to support pollinators, birds, and biodiversity right in your own backyard.",
        "email_address": "",
        "location": "Price:\n$25 Member, $30 Nonmember\nTime:\n10:00 AM to 12:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/sleigh-%26-sip%3a-holiday-wine-tasting/10374/",
        "title": "Sleigh & Sip: Holiday Wine Tasting",
        "descriptionTab": "Join us for a cozy and elegant evening at Earth at Hidden Pond as we welcome the holiday season with warmth, flavor, and festive cheer. Savor the rich, savory tastes of winter with thoughtfully crafted canapés, perfectly paired with a curated selection of seasonal blends. Come sip, savor, and celebrate the magic of the season in our enchanting winter setting.",
        "email_address": "",
        "location": "Kennebunkport Resort Collection\n2 Storer St, Suite 200A\nKennebunk, ME 04043",
        "start_time": "2:00 PM",
        "end_time": "3:30 PM",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/steve-sweeney-comedy/10616/",
        "title": "Steve Sweeney Comedy",
        "descriptionTab": "Born in Charlestown, Steve Sweeney is a legendary Boston comedian known as a master of dialects and character voices. With his famous Boston accent and great insight into human nature, Steve is so thoroughly Bostonian that he merits his own stop on the MBTA Green Line.\nHe has been a featured on major television shows including David Letterman, Evening at the Improv, Comics Come Home, and Comedy Central, and starred in his own Boston-based sitcom, Park Street Under.\nSteve’s trademark political satire has earned him top host spots on Boston radio stations 100.7FM WZLX (Sweeney’s Neighborhood) and 95.9FM WATD (Jay Mohr and Opie & Anthony.) In addition, Steve is an elite Master of Ceremonies selected by many charitable and political organizations (of both parties, but separately, of course!)\nThis event held inside in our Upstairs Listening Room.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "7:30 PM",
        "end_time": "",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/stitches%3a-quilt-handwork-at-maine-historical-society-(2-part-exhibit)/10314/",
        "title": "Stitches: Quilt Handwork at Maine Historical Society (2-part exhibit)",
        "descriptionTab": "A two-part exhibition exploring Maine's 19th-century quilting traditions through hand-pieced, appliquéd, and embroidered quilts, with a special display for Wadsworth-Longfellow House ticket holders.\nGuest curated by quilt expert Christine Force, this uniquely vibrant exhibit brings Maine’s rich 19th-century quilting heritage to life, from hand-pieced classics to intricate appliqué and embroidery.\nPart One\nspotlights piecing and quilting, while\nPart Two\ndives into complex appliqué and embroidery designs.\nStitches\nshowcases iconic patterns like Log Cabin, Crazy Quilts, Eight-pointed stars, and Album Quilts—each featuring historic fabrics, embellishments, and one-of-a-kind details.\nBut the experience doesn’t stop there! Through October 31, 2025,\nWadsworth-Longfellow House\nticket holders\nwill enjoy a special bonus: exclusive bed coverings, shown in the home’s historic setting. House admission ticket required.\nExhibit Details:\nDates:\nPart One: Jun 24-Sept 20, 2025\nPart Two: Sept 30-Dec 31, 2025\nLocation: King Gallery. Tickets available\nin advance\nor at the door.\nAdmission includes all gallery exhibits on view. Add\nWadsworth-Longfellow House\nadmission to see additional quilts on display.\nPlan Your Visit",
        "email_address": "etselikis@mainehistory.org",
        "location": "Maine Historical Society\n489 Congress St. Wadsworth-Longfellow House\nPortland, ME 04101",
        "start_time": "10:00 AM",
        "end_time": "5:00 PM",
        "date": "June 10, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/stomp/10410/",
        "title": "STOMP",
        "descriptionTab": "Celebrating 30 years! STOMP is explosive, provocative, sophisticated, sexy, utterly unique and appeals to audiences of all ages. The international percussion sensation has garnered an armful of awards and rave reviews, and has appeared on numerous national television shows. The eight-member troupe uses everything but conventional percussion instruments – matchboxes, wooden poles, brooms, garbage cans, Zippo lighters, hubcaps – to fill the stage with magnificent rhythms. The return of the percussive hit also brings some new surprises, with some sections of the show now updated and restructured and the addition of two new full-scale routines, utilizing props like tractor tire inner tubes and paint cans. As\nUSA Today\nsays, “\nSTOMP\nfinds beautiful noises in the strangest places.”\nSTOMP\n. See what all the noise is about.",
        "email_address": "",
        "location": "Cross Insurance Center\n515 Main Street\nBangor, ME 04401",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "March 16, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/sunday-music-jams/3980/",
        "title": "Sunday Music Jams",
        "descriptionTab": "Every Sunday from 1:30 -4:00pm\nFor Sunday Music Jams:  Out of an abundance of caution, we ask that everyone  be vaccinated, and we ask that audience members continue to \"mask-up\" for the season.\nBring your instrument of choice, warm up your vocal cords, and prepare to tap your toes!\nClick Here\nto see a sampling of one of our jams.  (\ncaution - you're gonna want to start dancing!\n)",
        "email_address": "",
        "location": "Sail, Power, and Steam Museum\n75 Mechanic Street\nRockland, ME 04841",
        "start_time": "1:30 PM",
        "end_time": "4:00 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/tails-of-the-city%3a-urban-nature-walks/10765/",
        "title": "Tails of the City: Urban Nature Walks",
        "descriptionTab": "Cities are habitats too! In these programs, Maine Audubon Field Naturalist Stacia Brezinski will introduce participants to the wildlife in three unique urban habitats: Parks, Waterfront, and Preserves. This series is a collaboration with the City of Portland Sustainability Office and the Equality Community Center.\nBinoculars are encouraged, but not necessary, and some pairs will be available to borrow. This program is free, registration is required.\nTo participate in the stewardship of our urban habitats, we’ll collect litter that we see during our Parks and Waterfront walks using cleanup kits provided by the Sustainability Office. Celebrate sustainable transit by riding the bus with our naturalist to the Preserves walk at Gilsland Farm.\nTails of the City: Parks\nEquality Community Center\nSaturday, December 6, 1-3 pm\nTails of the City: Waterfront\nPortland Fish Pier\nSaturday, January 24, 1-3 pm\nTails of the City: Preserves\nGilsland Farm\nSaturday, February 7, 1:15-3:15 pm\nTaking the bus to this walk is encouraged! Gilsland Farm is a Greater Portland Metro Route 7 stop.",
        "email_address": "",
        "location": "Time:\n1:00 PM to 3:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/tails-of-the-city%3a-urban-nature-walks/10766/",
        "title": "Tails of the City: Urban Nature Walks",
        "descriptionTab": "Cities are habitats too! In these programs, Maine Audubon Field Naturalist Stacia Brezinski will introduce participants to the wildlife in three unique urban habitats: Parks, Waterfront, and Preserves. This series is a collaboration with the City of Portland Sustainability Office and the Equality Community Center.\nBinoculars are encouraged, but not necessary, and some pairs will be available to borrow. This program is free, registration is required.\nTo participate in the stewardship of our urban habitats, we’ll collect litter that we see during our Parks and Waterfront walks using cleanup kits provided by the Sustainability Office. Celebrate sustainable transit by riding the bus with our naturalist to the Preserves walk at Gilsland Farm.\nTails of the City: Parks\nEquality Community Center\nSaturday, December 6, 1-3 pm\nTails of the City: Waterfront\nPortland Fish Pier\nSaturday, January 24, 1-3 pm\nTails of the City: Preserves\nGilsland Farm\nSaturday, February 7, 1:15-3:15 pm\nTaking the bus to this walk is encouraged! Gilsland Farm is a Greater Portland Metro Route 7 stop.",
        "email_address": "",
        "location": "Time:\n1:00 PM to 3:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "January 24, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/tails-of-the-city%3a-urban-nature-walks/10767/",
        "title": "Tails of the City: Urban Nature Walks",
        "descriptionTab": "Cities are habitats too! In these programs, Maine Audubon Field Naturalist Stacia Brezinski will introduce participants to the wildlife in three unique urban habitats: Parks, Waterfront, and Preserves. This series is a collaboration with the City of Portland Sustainability Office and the Equality Community Center.\nBinoculars are encouraged, but not necessary, and some pairs will be available to borrow. This program is free, registration is required.\nTo participate in the stewardship of our urban habitats, we’ll collect litter that we see during our Parks and Waterfront walks using cleanup kits provided by the Sustainability Office. Celebrate sustainable transit by riding the bus with our naturalist to the Preserves walk at Gilsland Farm.\nTails of the City: Parks\nEquality Community Center\nSaturday, December 6, 1-3 pm\nTails of the City: Waterfront\nPortland Fish Pier\nSaturday, January 24, 1-3 pm\nTails of the City: Preserves\nGilsland Farm\nSaturday, February 7, 1:15-3:15 pm\nTaking the bus to this walk is encouraged! Gilsland Farm is a Greater Portland Metro Route 7 stop.",
        "email_address": "",
        "location": "Time:\n1:00 PM to 3:00 PM",
        "start_time": "",
        "end_time": "",
        "date": "February 7, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/the-american-patchwork-quartet/10599/",
        "title": "The American Patchwork Quartet",
        "descriptionTab": "American Patchwork Quartet vocalist Falu Shah; guitarist and vocalist Clay Ross; drummer Clarence Penn; and bassist Moto Fukushima reimagine traditional American folk songs through the lens of four U.S. citizens with different cultural backgrounds. APQ weaves dynamic guitar work, Indian classical vocals, and a jazz-driven rhythm section into a richly textured sound. Musical storytelling at its finest, APQ is a deliberately designed homage to America’s past and a showcase of its dynamic present, celebrating our shared identity and the musical threads that bind us. Sponsored by Camden Maine Stay Inn and 40 Paper. Choose-your-own reserved tickets are $36 in advance, $40 day-of-show, via\ncamdenoperahouse.com\nand (207) 236-3154.",
        "email_address": "",
        "location": "Camden Opera House\n29 Elm Street\nCamden, ME 04843",
        "start_time": "7:30 PM",
        "end_time": "9:00 PM",
        "date": "November 15, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/the-garbologists/10418/",
        "title": "The Garbologists",
        "descriptionTab": "So much of who we are can be discovered in what we throw away, and no one knows that better than a city sanitation worker.  Danny, gruff and opinionated, is tasked with showing the ropes to his new highly educated but inexperienced partner Marlowe.  The two could not be more different and naturally sparks fly in both hilarious and harrowing ways as they work their route.   Two essential workers from opposite worlds discover there’s more that binds them together than the shared task of taking out the trash.",
        "email_address": "",
        "location": "Penobscot Theatre Company\n131 Main Street\nBangor, ME 04401",
        "start_time": "",
        "end_time": "",
        "date": "April 23, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/the-little-prince-at-the-childrens-museum-%26-theatre-of-maine/10741/",
        "title": "THE LITTLE PRINCE at the Children's Museum & Theatre of Maine",
        "descriptionTab": "THE LITTLE PRINCE\nat the Children’s Museum & Theatre of Maine\nNovember 28 - December 28, 2025\nTickets: $20. Members receive a 10% discount. www.kitetails.org/thelittleprince\nAbout: Blast off on a magical, starry-eyed adventure with THE LITTLE PRINCE!\nWhen a pilot crash-lands in the desert, he meets an unexpected new friend—a mysterious boy from a faraway asteroid with stories that sparkle like the stars. From lighting lamps with a speedy Lamplighter to puzzling over grown-ups and befriending a clever, tail-twitching Fox, the Little Prince takes audiences on a whimsical journey through the universe.\nFilled with wonder, laughter, and heart, this enchanting tale invites young dreamers to see the world through new eyes. With imaginative storytelling, playful surprises, and a message that shines bright—what matters most is invisible to the eye—THE LITTLE PRINCE is a tender, timeless treat for children and their grown-ups.\nSo open your heart, follow the stars, and come explore the galaxy with a prince like no other!\nBest enjoyed by: This production is perfect for children ready to explore deeper themes of friendship, love, and adventure—while still being full of wonder and magic for audiences of all ages.\nCummins and Scoullar’s\nTHE LITTLE PRINCE\nBy Rick Cummins and John Scoullar\nBased on the book by Antoine de Saint-Exupery\nCopyright © 1943 and renewed 1971 by Harcourt Brace & Co.\nOriginally produced off-Broadway by Chrysalis Productions at the John Houseman Theatre Complex. Earlier version produced and directed by Michael Harron at Playhouse by the River, Mt. Bethel, PA.\nProduced by special arrangement with THE DRAMATIC PUBLISHING COMPANY of Woodstock, Illinois.\nArt by Jenna Gutierrez\nDirected by Allison McCall\nDates and times are subject to change. The Theatre lobby opens 30 minutes prior to each show, and the doors to the Theatre open 20 minutes prior to showtime. Tickets to theatre shows are non-refundable and transferable pending space and availability in other performances.\nASL-Interpreted Performance: CMTM is pleased to offer an ASL-Interpreted performance on Saturday, December 13 at 11 am, through the generous support of the Margaret E. Burnham Charitable Foundation.\nCMTM offers additional discount options including AAA, Military, EBT, Seniors, and more: kitetails.org/accessibility\nPlease note: there will be no performances December 22 - 25.",
        "email_address": "boxoffice@kitetails.org",
        "location": "Children's Museum & Theatre of Maine\n250 Thompson's Point Road\nPortland, ME 04102",
        "start_time": "11:00 AM",
        "end_time": "12:30 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/tree-of-life-how-a-holocaust-sapling-inspired-the-world-childrens-book-launch-read-aloud-and-family-tu-bshevat-activity/7897/",
        "title": "Tree of Life, How a Holocaust sapling inspired the world. Children's book launch, read aloud, and family Tu B'Shevat activity",
        "descriptionTab": "Sunday, January 21 – 2 – 3:30 PM\nCome paint a pot and plant seeds of hope in honor of the upcoming Tu B’Shevat holiday in this family-friendly event featuring local author Elisa Boxer reading and signing her newest children’s book, Tree of Life: How a Holocaust Sapling Inspired the World.",
        "email_address": "nosborne@mainetourism.com",
        "location": "1,100 Route 1, 169 Prospect Street\nPortland, ME 04101",
        "start_time": "2:00 PM",
        "end_time": "3:30 PM",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/vicki-monroe-psychic-medium-%26-spiritual-messenger/10617/",
        "title": "Vicki Monroe, Psychic Medium & Spiritual Messenger",
        "descriptionTab": "\"If you've ever wondered or felt like a passed love one is trying to deliever you a message....wondered what death is like?  Are they happy Can they see me? How can I hear them?\"\nCome and experience an evening of Spirit Communication with Vicki Monroe.\nPsychic Medium, Spirit Messenger, Vicki Monroe is one of the top 100 psychic mediums in the world today.  She is a published author, radio personality, and the star of her own documentary series, \"Cell Block Psychic\" on Investigation Discovery!  She has been sharing her talents for over 2 decades.\nThis event held inside in our Upstairs Listening Room.",
        "email_address": "",
        "location": "Jonathan's Ogunquit\n92 Bourne Lane\nOgunquit, ME 03907",
        "start_time": "7:00 PM",
        "end_time": "",
        "date": "November 20, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/victorian-christmas-train-%2b-market/10788/",
        "title": "Victorian Christmas Train + Market",
        "descriptionTab": "Board your Victorian Christmas train at Sheepscot station (97 Cross Road, Alna) for a 15-minute steam-powered ride through the wild pine forests, farmlands and hamlets of the Sheepscot Valley to Alna Center where Santa Claus and a Christmas Market await.\nAs you disembark from the train, family fun and yuletide joy fills the air. All youngsters will be treated to a visit with St. Nicholas himself, Santa Claus. Then explore the Holiday Market while enjoying a nice, relaxed, family-friendly Christmas Fête - filled with the best local products. The entire experience takes approximately 1.5 hours.\nTicket price includes your journey aboard the historic steam train, a visit with Santa, hot beverages, ornament making, as well as parking at Sheepscot and admission to the SeaLyon Christmas Market. Additional refreshments and other farm products are sold separately by SeaLyon Farm and their partners. Note that due to the nature of this event, wheelchairs can not be accommodated.\nWe look forward to seeing you on the narrow gauge!\nAt Alna Center enjoy:\n-A visit with Santa Claus. Bring your list, and be sure to be \"nice!\"\n-Making a Christmas ornament by the potbelly stove in Alna Center Station.\n-A bonfire to keep everyone toasty and filled with cheer.\n-Hot chocolate and coffee co-sponsored by Sum’Battus BBQ.\n-The SeaLyon Christmas Market.\nAbout the SeaLyon Christmas Market:\nSponsored by SeaLyon Farm the market will be held rain, snow, or shine under the spacious pavilion at Alna Center.\nActivities and vendors at the SeaLyon Christmas Market may include:\n-A Farm Store selling jams, salsas, lavender products, baked goods, the best whoopie pies in Maine and other tasty treats.\n-An old-fashioned Christmas market filled with the best handmade and home-cooked gifts sure to make the season bright.\n-Great hot food from Sum’Battus BBQ.\n-Homemade and delicious Kettle Corn from Poppies Kettle Corn.\n-Maple syrup products from Marcoux Family Farm.\n-There will be a 50 minute stopover at Alna Center to enjoy the Market and all activities before the narrow gauge train returns you to Sheepscot station.",
        "email_address": "",
        "location": "Wiscasset, Waterville & Farmington Railway Museum\n97 Cross Rd.\nAlna, ME 04535",
        "start_time": "",
        "end_time": "",
        "date": ""
    },
    {
        "url": "https://www.mainetourism.com/event/villages-of-light/9636/",
        "title": "Villages of Light",
        "descriptionTab": "Villages Of Light\nThe Villages of Light\ncelebration is an annual event that takes place Thanksgiving weekend every year.  The event brings the spirit of the holidays to the Twin Villages of Damariscotta and Newcastle and kicks off the Christmas season. Upward to 70 decorated Christmas trees line Main Street in the Twin Villages, and two 20-foot decorated Christmas trees bookend the towns.  The bridge connecting the two towns is draped with garland and lights and wreaths are hung on poles throughout town. On Saturday of Thanksgiving weekend, children gather in Skidompha Library to enjoy cookies and treats and make crafts to take home. Mid-day, Santa arrives at Lincoln Theater to listen to the children’s wishes which is followed by a free Christmas movie. The Parade of Lights begins around dark (4:30) and Santa & Mrs. Clause arrive in a horse-drawn sleigh followed by decorated floats, fire trucks, cars, dancers and elves, bringing the spirit of Christmas to the Twin Villages.  After the parade, visitors enjoy a local meal in town or a festive holiday drink called “cup of cheer.” In Newcastle at Milling Around Antiques & Gifts a special holiday tradition welcomes you after dark.  Jake Day, a beloved local artist, created enchanting carved dioramas depicting a variety of holiday scenes that is magical for the young and old alike. Come spark your spirit during this annual holiday celebration.\nFor more information, check them out on\nFacebook\n.",
        "email_address": "",
        "location": "Damariscotta Region Chamber of Commerce\n67A Main St.\nNewcastle, ME 04553",
        "start_time": "",
        "end_time": "",
        "date": "November 29, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wee-ones-wednesdays/10707/",
        "title": "Wee Ones Wednesdays",
        "descriptionTab": "Join Miss Xanthi at the Children’s Museum of New Hampshire for this interactive weekly program for children ages 2–4. Designed as a PRE pre-school program for children and a parent or caregiver, we will enjoy art, music, movement, and conceptual learning together! This program is limited to 10 children, and caregivers or adults are welcome to sign up multiple children within their family. Pre-reservation/payment is required and does not include museum admission.",
        "email_address": "neva@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street\nDover, NH 03820",
        "start_time": "9:15 AM",
        "end_time": "10:00 AM",
        "date": "November 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wild-botanical-wreath-workshop-with-rachel-alexandrou/10728/",
        "title": "Wild Botanical Wreath Workshop with Rachel Alexandrou",
        "descriptionTab": "Join us for a hands-on wreath-making workshop, a longstanding traditional craft in Maine. In this class, participants will learn which botanicals in our landscape make beautiful wreaths beyond just balsam. Forager, artist and wreath maker Rachel Alexandrou will guide students in how to use the form, texture and color of wild natural materials to compose an artful wreath.  Each attendee will make their own 18”-24” wreath to bring home a bit of the natural charm and refreshing scent of Maine’s woodlands. All materials and tools will be provided, including wreath rings, wire, gloves, clippers, and an array of evergreens, berries, and other wild plants. This workshop is open to all skill levels and promises a fun, festive experience for everyone!\nRachel Alexandrou (she/her) is an interdisciplinary artist who uses her education in plant science to create experiential work about innovating human relationships to the natural landscape. She has been making wreaths and garlands for a decade. Her botanical work has been featured at the Venice Biennale, Space Gallery (Portland, ME) She teaches foraging and craft workshops around Maine including Haystack Mountain School of Crafts and The Bernard Langlais Preserve and The Seguinland Institute. Her wreath practice was featured in The New York Times.\nLearn more about Rachel and her seasonal, botanical and art practice at: (Instagram) @giantdaughter,\nGiantdaughter.com\nand\nrachelalexandrou.com\n.\nREGISTER",
        "email_address": "",
        "location": "Farnsworth Art Museum and Wyeth Center\n16 Museum St.\nRockland, ME 04841",
        "start_time": "1:00 PM",
        "end_time": "4:00 PM",
        "date": "December 3, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wilderness-first-aid-and-cpr/10720/",
        "title": "Wilderness First Aid and CPR",
        "descriptionTab": "American Red Cross course covering all the bases of first aid and CPR, and of course how to handle these emergency situations while you're in a wilderness setting! Course topics include: Primary and Secondary Assessments, Head (Brain), Neck and Spinal Injuries, Heat-Related Emergencies, Wounds and Wound Infection, Allergies and Anaphylaxis, Altitude-Related Illnesses, Bone and Joint Injuries, Hypothermia, Burns of all degrees And more!",
        "email_address": "info@northeastwhitewater.com",
        "location": "Northeast Whitewater Outdoor Guides\n155 Greenville Rd.\nShirley Mills, ME 04485",
        "start_time": "9:00 AM",
        "end_time": "5:00 PM",
        "date": "February 15, 2026"
    },
    {
        "url": "https://www.mainetourism.com/event/win-free-burgers-for-a-year!/10725/",
        "title": "Win Free Burgers for A Year!",
        "descriptionTab": "Wild Willy's Burgers invites you to visit their York Maine or Rochester New Hampshire locations between Wednesday, November 5th and Tuesday, December 30th to be entered to win free burgers for a year (a ~$600 value equivalent to one burger a week).  One winner will be drawn per location on 12/31/2025.",
        "email_address": "info@wildwillysburgers.com",
        "location": "Wild Willy's Burgers\n765 US-Rte 1\nYork, ME 03909",
        "start_time": "11:00 AM",
        "end_time": "8:00 AM",
        "date": "November 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/winter-ecology/10770/",
        "title": "Winter Ecology",
        "descriptionTab": "In this in-person companion to our December 11, Winter Ecology online program, we’ll explore Maine Audubon’s Gilsland Farm sanctuary and witness the incredible ways that Maine wildlife survive winter.\nWebinar attendance is not necessary to enjoy this walk. If attending both programs, please register separately for each.\nRegistration coming soon!",
        "email_address": "",
        "location": "Time:\n10:30 AM to 12:30 PM",
        "start_time": "",
        "end_time": "",
        "date": "December 13, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wiscasset-holiday-marketfest/10065/",
        "title": "Wiscasset Holiday Marketfest",
        "descriptionTab": "Wiscasset Holiday Marketfest\nOn the first full weekend in December, launch your holiday season with a weekend full of joyful activities. Santa and crafts for families; shopping and wine tasting for grown-ups; horse-drawn carriage rides, music, and good cheer for all!",
        "email_address": "http://wiscassetcreativealliance@gmail.com",
        "location": "Main Street\nWiscasset, ME 04578",
        "start_time": "9:00 AM",
        "end_time": "5:00 PM",
        "date": "December 5, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wiscasset-holiday-marketfest/10066/",
        "title": "Wiscasset Holiday Marketfest",
        "descriptionTab": "Wiscasset Holiday Marketfest\nOn the first full weekend in December, launch your holiday season with a weekend full of joyful activities. Santa and crafts for families; shopping and wine tasting for grown-ups; horse-drawn carriage rides, music, and good cheer for all!",
        "email_address": "http://wiscassetcreativealliance@gmail.com",
        "location": "Main Street\nWiscasset, ME 04578",
        "start_time": "9:00 AM",
        "end_time": "5:00 PM",
        "date": "December 6, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wiscasset-holiday-marketfest/10067/",
        "title": "Wiscasset Holiday Marketfest",
        "descriptionTab": "Wiscasset Holiday Marketfest\nOn the first full weekend in December, launch your holiday season with a weekend full of joyful activities. Santa and crafts for families; shopping and wine tasting for grown-ups; horse-drawn carriage rides, music, and good cheer for all!",
        "email_address": "http://wiscassetcreativealliance@gmail.com",
        "location": "Main Street\nWiscasset, ME 04578",
        "start_time": "9:00 AM",
        "end_time": "5:00 PM",
        "date": "December 7, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/wonder-%26-wellness-speaker-series-with-behavioral-health-provider-gina-apgar-regulate-relate-reason/10676/",
        "title": "Wonder & Wellness Speaker Series with Behavioral Health Provider Gina Apgar Regulate-Relate-Reason",
        "descriptionTab": "Feeling overwhelmed by your child’s big emotions? Join us for this workshop where we’ll introduce Dr. Bruce Perry’s Regulate-Relate-Reason framework, a neuro-science informed approach to foster emotional regulation. Gina Apgar, LICSW is a clinical social worker with 20 years’ experience working with children and families in various roles including early education, home visiting, family support, healthcare, and advocacy. This free workshop is organized by and hosted at the Children’s Museum of NH as part of their Wonder & Wellness Speaker Series, sponsored by Kennebunk Savings Bank. Pre-registration is required for these workshops, which include a simple pizza dinner (5–5:30pm) as well as limited free childcare for ages 4 and up (must use bathroom independently) for participating families during the speaker presentation (5:30–6:30pm).\nhttps://childrens-museum.org/programs/wonder-and-wellness/",
        "email_address": "neva@childrens-museum.org",
        "location": "Children's Museum of New Hampshire\n6 Washington Street\nDover, NH 03820",
        "start_time": "5:00 PM",
        "end_time": "6:30 PM",
        "date": "November 19, 2025"
    },
    {
        "url": "https://www.mainetourism.com/event/working-granite%3a-italian-stonecutters-and-their-union-(exhibit)/10320/",
        "title": "Working Granite: Italian Stonecutters and Their Union (Exhibit)",
        "descriptionTab": "Working Granite\nexplores the work of Italian immigrant stonecutters in Hallowell, Maine, and the labor union they created in the late 1800s.\nLearn about the people, labor, and legacy behind one of Maine's earliest labor unions, founded by granite workers in 1877.\nWorking Granite\nhighlights the community of Italian immigrants who came to Hallowell, Maine, in the late 1800s to work in the booming granite industry. These expert carvers—many from Carrara, Italy—helped turn Maine granite into everything from paving stones and bridges to monuments and statues.\nDive into historic photographs and personal stories drawn from the rich collections of Maine Memory Network contributors, including Hubbard Free Library, Maine Historic Preservation Committee, and the Maine Granite Industry Historical Society, and step into the world of Hallowell's granite past.\nExhibit details:\nDates:\nJuly 29, 2025–July 25, 2026\nLocation: Showcase Gallery\nTickets available\nin advance\nor at the door. Admission includes all gallery exhibits on view.\nPlan Your Visit",
        "email_address": "etselikis@mainehistory.org",
        "location": "Maine Historical Society\n489 Congress St. Wadsworth-Longfellow House\nPortland, ME 04101",
        "start_time": "10:00 AM",
        "end_time": "5:00 PM",
        "date": "July 29, 2025"
    }
]