[
  {
    "title": "4th Annual Festivals of Baskets",
    "desc": "Join us for the Chamber's largest fundraiser!Donate a basket of at least $50 in value to be raffled off to the lucky winner. Or buy tickets for a chance to win!Winners chosen at random and do not need to be present to win.November 11 - December 13Tuesday-Friday 9-4:30pmwith two Saturdays Dec. 6 and 13, 10-1pmTickets$1 each, 3/$2, or 10/$5drawing held on Dec. 13",
    "date": "12-13-2025",
    "start_time": "09:00 AM",
    "end_time": "04:30 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/4th-annual-festivals-of-baskets-01-10-2025-14-19-25",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Illustration in the Great State of Maine: An Art Exhibit at the Falmouth Memorial Library",
    "desc": "Falmouth Memorial Library is pleased to announce that Illustration Institute's The Great State of Illustration in Maine will be on display at the Library from November 8, 2025, through January 31, 2026. This exhibition celebrates the rich, diverse cultural heritage of over 80 Maine-connected illustrators such as Ashley Bryan, Barbara Cooney, Dahlov Ipcar, Melissa Sweet, Chris Van Dusen, N.C. Wyeth, and more. The Great State of Illustration in Maine will showcase illustration as an art form in the very place where books are easily and publicly accessed. \"We are thrilled to welcome Illustration Institute to Falmouth Memorial Library and offer an exhibition of this depth and breadth to our community. We hope visitors from around our State will come enjoy this collection of incredible illustrations, and take advantage of exciting, related programming over the next three months,\" commented Jenna Mayotte, Library Director.",
    "date": "01-31-2026",
    "start_time": "09:00 AM",
    "end_time": "05:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/illustration-in-the-great-state-of-maine-an-art-exhibit-at-the-falmouth-memorial-library-12-11-2025-14-47-06",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Rockport Library’s Fiber Arts Collective Exhibits New Work",
    "desc": "The Rockport Public Library will host a show of handmade works by members of the library’s fiber arts collective, November 6-24. Members will display new works of embroidery, felting, quilting, knitting, paper art, and more in the upper and lower levels of the library.This is the twelfth year that the group of midcoast-based crafters has been meeting at the library. “This show is one of our favorite annual traditions,” says Rockport Library Director Ben Blackmon. “The library staff watch the members progress on fiber art projects all year long, and then we get to spotlight their finished works and celebrate their immense talents!”The fiber arts group meets on the 1st, 3rd, and 5th Tuesday of each month, from 3:00 to 5:00 p.m. in the lower level of the Rockport Library. Gatherings are usually informal, but mini workshops are also occasionally conducted. The group is open to everyone and welcomes new members. For more information, visit rockportlibrary.net.",
    "date": "11-24-2025",
    "start_time": "09:30 AM",
    "end_time": "05:30 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/rockport-librarys-fiber-arts-collective-exhibits-new-work-30-10-2025-08-54-53",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Fiber Art Exhibit: Threaded Together: A Stitch Social Experiment",
    "desc": "Waterfall Arts Presents: Threaded Together: A Stitch Social ExperimentOctober 4 – November 21, 2025BELFAST, ME — Waterfall Arts is proud to present Threaded Together: A Stitch Social Experiment, on view from October 4 through November 21, 2025. The exhibition celebrates the artists of Stitch Social, a twice-monthly fiber arts community group that began in early 2023 and has become a vibrant thread in the tapestry of Waterfall Arts.The show features work by 17 artists who use fiber-based materials and techniques—such as embroidery, knitting, crochet, felting, and weaving—to tell deeply personal stories, reflect on shared experiences, and build connections through craft. Whether traditional or experimental, functional or sculptural, each piece demonstrates the expressive power of fiber art.“This exhibition is about much more than stitches,” says Program Director Amy Tingle, who helped found the group after the 2022 exhibition Radical Acts with Shannon Downey. “It’s about community care, storytelling, and creating space for voices that are often quieted. It’s a radical act to center yourself in your own narrative—and that’s exactly what this group has been doing.”Stitch Social members gather on the 2nd and 4th Saturdays of each month to share techniques, materials, and meals, as well as mutual support and friendship. Their work and their stories are woven into this powerful exhibition, which invites visitors to witness the strength of slow, intentional making.Opening Reception: Saturday, October 4, 12–3PM at Waterfall Arts. Free and open to all.Participating Artists:Amy Tingle, Conni Whittaker, Deborah Diemer, Grace Johnston-Fennell, Jackie Dunham, Juniper Ziegner, Kelly Schroeder, Laura Goodwin, Laura Cahalane, Lisa Cohn, Lissa Widoff, LuLu, Martha Kempe, Maya Stein, Pettina Harden, Roberta Bailey, Sally Kirkpatrick, Valerie Schurer Christle",
    "date": "11-21-2025",
    "start_time": "10:00 AM",
    "end_time": "05:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/fiber-art-exhibit-threaded-together-a-stitch-social-experiment-09-10-2025-09-56-47",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Nose-to-Tail Pig Butchery",
    "desc": "Join us for a three-day workshop that will bring you through the process of slaughtering and butchering a pig, so that you can do so confidently, humanely, and safely with pigs at home or on-farm. On Day 1, participants will learn from Jason Tessier, of Tessiers Farm. Jason will offer an introduction to the process of pig butchery, including safety practices, equipment, and humane slaughter. He will then demonstrate slaughter of the pig, and work with participants on the initial steps of butchery to follow.On days two and three, Frank Giglio, of Farm & Forage Kitchen, will lead participants through the process of butchery and processing meat into value-added goods such as sausage, with a focus on using the whole pig in creative and delicious ways. Participants will have opportunities to be as directly involved as they would like to be during this section of the workshop.The pig for this workshop is sourced from Misty Brook Farm — a MOFGA certified organic farm just down the road in Albion, ME.What’s included?-Three days of workshop time, with necessary supplies provided for the duration of the class-2 meals per day, plus snacks and beverages-Reference and reading materials on pig butchery and raising livestock-A recipe packet developed by Frank Giglio-On-site bunkhouse-style lodging or camping-A share of the finished meat products to enjoy at home!",
    "date": "11-14-2025",
    "start_time": "10:00 AM",
    "end_time": "05:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/nose-to-tail-pig-butchery-30-09-2025-14-13-17",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Made: Maine Makers at Ticonic Gallery",
    "desc": "Formerly known as the Holiday Bazaar, Made is a curated seasonal marketplace that highlights the artistry and craftsmanship of Maine makers, offering visitors a unique selection of locally handmade goods.Thank you to our sponsors Kennebec Savings Bank, the City of Waterville, Central Maine Newspapers, and Back Office Solutions!",
    "date": "01-26-2026",
    "start_time": "11:00 AM",
    "end_time": "07:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/made-maine-makers-at-ticonic-gallery-22-10-2025-09-23-33",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Seasonal STEAM for Homeschoolers",
    "desc": "Homeschooling families are invited to join us at Libby Library in OOB on Friday, November 14 from 1:00-2:00 pm for the first of our new Seasonal STEAM for Homeschoolers!This seasonal program is structured much like our monthly STEAM Saturday program, but with homeschoolers in mind! Science, Technology, Engineering, Art, and Math come together to make for one fun program—come to learn and play and socialize with other homeschoolers this fall, winter, & spring! Each program will have a different theme that the stories, projects, and experiments will focus on, all with a seasonal twist.This program is free, open to the public, and no registration is required.",
    "date": "11-14-2025",
    "start_time": "01:00 PM",
    "end_time": "02:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/seasonal-steam-for-homeschoolers-20-10-2025-08-59-37",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "The Great Solar System Adventure",
    "desc": "Explore the wonders and perils of our Solar System! Join “The Great Schiaparelli”; as hetakes the audience on a space-time adventure within his wondrous Observatorium. From thesun-scorched surface of Mercury to the icy expanses of Pluto and beyond, prepare to besubjected to the myriad wonders of our Solar System, on a breathtaking tour that reveals justhow precious our home planet Earth really is. Narrated by Adam Longworth. Program includes a tour of Maine's night sky!",
    "date": "11-30-2025",
    "start_time": "02:00 PM",
    "end_time": "03:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/the-great-solar-system-adventure-06-11-2025-09-32-00",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "A Christmas Carol",
    "desc": "SHOWTIMES: Friday - 11/14 7pm, Saturday - 11/15 2pm & 7pm, Sunday - 11/16 2pmDickens’s Christmas fairytale offers a message of hope and redemption.Rich miser Ebenezer Scrooge hates Christmas and all it entails. On Christmas Eve, spirits appear and take Scrooge to see poignant scenes from his past, joyful holiday celebrations in the present, and horrifying future events. In response, Scrooge changes his life to embody the holiday spirit all year round.",
    "date": "11-16-2025",
    "start_time": "02:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/a-christmas-carol-03-11-2025-20-23-09",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Signature Beer & Barrels Experience",
    "desc": "Sample a variety of seasonal specialty beers while enjoying the incredible ambiance of The Cellars at Allagash, our wild and sour barrel aging space. If you are looking for a traditional brewery tour, check out our \"The highlights:6 samples60 minutesIn-depth barrel room exploration and chance to see the Coolship$38 before tax/fees21+Please read on before booking:Tour-goers must be 21 or older. Infant-wearing is welcome - the tour path through our manufacturing plant is not suitable for young children or strollers.Guests who are not drinking beer can purchase a Designated Driver ticket and will have a choice of NA beverage.Dogs are not allowed on this manufacturing plant tour.",
    "date": "11-30-2025",
    "start_time": "02:30 PM",
    "end_time": "03:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/signature-beer-barrels-experience-20-10-2025-08-57-48",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Sidle House Exhibition: ‘S.N.O.W. ‘25’",
    "desc": "Sidle House Gallery’s third annual small new original works exhibition,  ‘S.N.O.W. ‘25,’ will be on view November 6 thru 30.The exhibition includes 92 pieces selected from more than 200 submissions, featuring artists from within and outside of Maine - all works made in 2025. Highlighting both emerging artists and those with well-established studio followings; the show includes painters, ceramicists, photographers, and multimedia artists. Recurring themes in this collection evoke foraging, time, place, patterns, elements, companions loved and forgotten, oracles, and warnings.  Featuring small works at the end of the season is an opportunity for collectors and enthusiasts to acquire pieces at a more accessible scale and price. Visitors will see work by artists Cynthia J. Ahlstrin, Diana Arcadipone, Emily Barton, Jaden Kyung-Moon Bauch, Diana Baumbach, Amy Belleza, Charles Beneke, Amy Bernhardt, Eben Blaney, Emily Blashke, Carter Blease,  Ben Boothby, Toby Bottorf,  Jess Brayboy, Jessyca Broekman, Marcie Jan Bronstein,  Alex Bruehl, Annie Buchholz, Tim Christensen, Debra Claffey, Kenny Cole, Jodi Colella, Shanna Compton, Lindsay Deifik, Matt Demer, Ross Dener, Anna Dibble, Molly Dillon, Tara Dixon, Michel Droge, Christopher Dudle, Ingrid Ellison, Alicia Ines Etheridge, Josh Ferry, Julie Fischer McCarter, Emily Freeman, Lea Freni, Jessica Gandolf, Leah Gauthier, Kate Gerwig, Eileen Gillespie, Jenna Girolamo, Eva Rose Goetz, Eliza Goodwin, Candice Gosta, Jose Gouveia, Abigail Gray Swartz, Frances Hamilton, Chloe Hammond, Anne Hebebrand, Joe Hemes, Emily Hopkins, Tom Hubbard, Deanna Jacome, Nina Jerome, Jon Kashner, Kate Katomski, Jim Kelly, Keri Kimura, Lydia Kinney, Michele Kirchner, Amy Kustra, Justine Lasdin, Jeanne Maguire, Cathleen Mahan, Kristin Malin, Kelly McConnell, Jordann McKenna, Janice L. Moore, Marjorie Moore, Haley Nannig, Heather Newton Brown, Court Normandin, Rachael O’Shaughnessy, Isabella Pardales, Roxanne Pizzuto, Redford Reece, Michael Rich, Emily Sabino, Chloe Sailor, Bronwyn Sale, Jennifer Schmitt, Susan Smith, Alecia Sudmeyer, Caroline Sulzer, Sharon Townshend, Carlie Trosclair,  David Wade, Keita Annie Whitten Foster, Jennifer Lee Wiebe, Holden Willard, Sherre Wilson Liljegren, and Annie Lloyd Witte.This exhibition is on view for a limited time. Gallery hours have been extended to include Thursdays, Fridays, Saturdays and Sundays through November 30. Visitors are encouraged to arrange a viewing appointment during off hours by calling or texting gallerist Maddy Vertenten at 512-771-1149.   Contact:Maddy Vertenten, Sidle House GalleryEmail: maddy@sidlehouse.comPhone: 512.771.1149",
    "date": "11-30-2025",
    "start_time": "03:00 PM",
    "end_time": "06:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/sidle-house-exhibition-s-n-o-w-25-06-11-2025-15-13-53",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Sidle House Exhibition: ‘S.N.O.W. ‘25’",
    "desc": "Sidle House Gallery’s third annual small new original works exhibition,  ‘S.N.O.W. ‘25,’ will be on view November 6 thru 30.The exhibition includes 92 pieces selected from more than 200 submissions, featuring artists from within and outside of Maine - all works made in 2025. Highlighting both emerging artists and those with well-established studio followings; the show includes painters, ceramicists, photographers, and multi-media artists. Recurring themes in this collection evoke foraging, time, place, patterns, elements, companions loved and forgotten, oracles, and warnings.  Featuring small works at the end of the season is an opportunity for collectors and enthusiasts to acquire pieces at a more accessible scale and price. Visitors will see work by artists Cynthia J. Ahlstrin, Diana Arcadipone, Emily Barton, Jaden Kyung-Moon Bauch, Diana Baumbach, Amy Belleza, Charles Beneke, Amy Bernhardt, Eben Blaney, Emily Blashke, Carter Blease,  Ben Boothby, Toby Bottorf,  Jess Brayboy, Jessyca Broekman, Marcie Jan Bronstein,  Alex Bruehl, Annie Buchholz, Tim Christensen, Debra Claffey, Kenny Cole, Jodi Colella, Shanna Compton, Lindsay Deifik, Matt Demer, Ross Dener, Anna Dibble, Molly Dillon, Tara Dixon, Michel Droge, Christopher Dudle, Ingrid Ellison, Alicia Ines Etheridge, Josh Ferry, Julie Fischer McCarter, Emily Freeman, Lea Freni, Jessica Gandolf, Leah Gauthier, Kate Gerwig, Eileen Gillespie, Jenna Girolamo, Eva Rose Goetz, Eliza Goodwin, Candice Gosta, Jose Gouveia, Abigail Gray Swartz, Frances Hamilton, Chloe Hammond, Anne Hebebrand, Joe Hemes, Emily Hopkins, Tom Hubbard, Deanna Jacome, Nina Jerome, Jon Kashner, Kate Katomski, Jim Kelly, Keri Kimura, Lydia Kinney, Michele Kirchner, Amy Kustra, Justine Lasdin, Jeanne Maguire, Cathleen Mahan, Kristin Malin, Kelly McConnell, Jordann McKenna, Janice L. Moore, Marjorie Moore, Haley Nannig, Heather Newton Brown, Court Normandin, Rachael O’Shaughnessy, Isabella Pardales, Roxanne Pizzuto, Redford Reece, Michael Rich, Emily Sabino, Chloe Sailor, Bronwyn Sale, Jennifer Schmitt, Susan Smith, Alecia Sudmeyer, Caroline Sulzer, Sharon Townshend, Carlie Trosclair,  David Wade, Keita Annie Whitten Foster, Jennifer Lee Wiebe, Holden Willard, Sherre Wilson Liljegren, and Annie Lloyd Witte.This exhibition is on view for a limited time. Gallery hours have been extended to include Thursdays, Fridays, Saturdays and Sundays through November 30. Visitors are encouraged to arrange a viewing appointment during off hours by calling or texting gallerist Maddy Vertenten at 512-771-1149.",
    "date": "11-30-2025",
    "start_time": "03:00 PM",
    "end_time": "06:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/sidle-house-exhibition-s-n-o-w-25-02-11-2025-22-27-49",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "The Witching Hour with Joyce Halliburton",
    "desc": "Something Witchy Presents The Witching Hour each Friday from 3-6 pm.  Happy Hour Tarot Readings with Joyce Halliburton 15 minutes for $25 in the Basement of the Old Port.  Call Joyce to book at 207-494-0205 or walk in day of event.",
    "date": "01-02-2026",
    "start_time": "03:00 PM",
    "end_time": "06:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/the-witching-hour-with-joyce-halliburton-12-11-2025-10-26-21",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Taste of Allagash: The Origin Tour",
    "desc": "Guests will enjoy the freshest Allagash White while walking through our world-class brewery. If you're looking for a more in-depth experience with more info on our wild and sour barrel room and coolship program, check out our Signature Tour & Tasting.The highlights:16 oz of beer (or N/A option)30 minutes$18 before tax/fees21+Please read on before booking:Tour-goers must be 21 or older. Infant-wearing is welcome - the tour path through our manufacturing plant is not suitable for young children or strollers.Guests who are not drinking beer can purchase a Designated Driver ticket and will have a choice of NA beverage.Dogs are not allowed on this manufacturing plant tour.",
    "date": "11-30-2025",
    "start_time": "05:00 PM",
    "end_time": "05:30 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/taste-of-allagash-the-origin-tour-20-10-2025-08-59-16",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Form + Function Artisan Fair",
    "desc": "Form + FunctionArtisan FairFriday, November 145pm - 10pmFree to attendJoin us at 3S Artspace for our 7th annual Form + Function artisan fair!Visit 3S November 14th for a night market and November 15th during the day to find inspired gifts for you and yours this holiday season. Form + Function is a curated showcase of unique, hand-crafted work by skilled artisans and makers. Shop textiles, housewares, jewelry, metal work, leather accessories, glass vases, ceramics, prints, and more at this festive event!Featured artisans:Amy Vander Els • Bare Bones Handsewn • Bloodroot Metalworks • Emily Percival Jewelry • Emily Wernig Ceramics • Essex Junction • Gordo Glass • Holmes + Hudson • Kim Ferreira ~ Joie de Vivre • Larkin and Larkin • Light-Q Creations • Loveline Baskets • LucasLandGlass • Michelle Phaneuf Ceramics • Rooted & Rendered • Wave Bait • YAM Collective----RSVP is not required but helps us get an idea of # of attendees. Plus, we'll send you a reminder about the fair a few days prior to the event!",
    "date": "11-14-2025",
    "start_time": "05:00 PM",
    "end_time": "10:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/form-function-artisan-fair-30-10-2025-08-58-01",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "UpRouted: 2025 Senior Capstone Exhibition Opening Reception",
    "desc": "Lord Hall Gallery proudly introduces UpRouted: 2025 Senior Capstone Exhibition, a culminating exhibition from the University of Maine Art Department’s graduating class. The exhibition will be on view from November 14, 2025 - January 23, 2026. A reception will be held on November 14th from 5:00-7:00 pm and will include food and refreshments. All events are free, accessible, and open to the public. Please join us in celebrating the work of these seniors! The artists on display will include: Miguel A. Camacho (Metepec, MX), Kaity Sawicki (Damariscotta, ME), Anthony Belenger (Bangor, ME), Haley Metzger (Bangor, ME), Piper Galipeau (Presque Isle, ME), Vi Nelson (Howland, ME), Ruby Day (Belfast, ME), Sarina Martin (Bucksport, ME), Allison Bishop (Gorham, ME), Josh Smith (Bradford, ME), Leanor Jordon (Parsonfield, ME), and Lior Nachtigal (Brookline, MA). Lord Hall Gallery (5743 Lord Hall, Orono, ME 04469) is open Monday-Friday from 9am-4pm. Please direct questions to Diana Baumbach: diana.baumbach@maine.edu. More information is available on Instagram: @umaine_lordhallgallery and @uprouted.exhibitionSupport was provided by the McGillicuddy Humanities Center and UMaine Dining.",
    "date": "11-14-2025",
    "start_time": "05:00 PM",
    "end_time": "07:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/uprouted-2025-senior-capstone-exhibition-opening-reception-31-10-2025-15-00-41",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Treasure Sale",
    "desc": "Rummage sale in South Freeport to support Tedford Housing and UN Famine Relief. Early preview Friday night with $5 cover charge, 5:30 -7:30 November 14. Then on Saturday, November 15, 9 am to 3 pm, no cover charge on Saturday. An out door tent, a large Community Hall and two more indoor rooms of items, including boutique clothing, jewelry, small antiques, and more.  Everyone's invited.  Find unique gifts and ....treasures!",
    "date": "11-14-2025",
    "start_time": "05:30 PM",
    "end_time": "07:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/treasure-sale-01-11-2025-10-01-17",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Fridays: Trivia in the Brewhouse!",
    "desc": "Join us for (one hour) Trivia in the brewhouse with our friend Megh. The questions will commence every Friday starting promptly at 6 pm. We recommend arriving early to get settled as missed questions are not repeated. Tickets are free but reservations are strongly recommended as we've been packed recently! Walk-ins are not guaranteed a seat, but we'll absolutely do our best to squeeze you in, if we can. If you are making a reservation for your team, please account for all the members of your team. Groups can be up to six players. Bite Into Maine will be here for all of your tasty dinner or snacking needs. As always we’ll have delicious beer, wine, cider, and n/a bevs flowing. We can’t wait to see you and your fantastic team names!FYI, as our brewhouse is a food production space, sadly dogs must stay on our covered patio.The prizes are:First - $75 gift cardSecond - Fun merch packThird - Rotating \"prize pack\"",
    "date": "11-28-2025",
    "start_time": "06:00 PM",
    "end_time": "07:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/fridays-trivia-in-the-brewhouse-08-09-2025-08-50-05",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Open Mic with Paul Connor at Cherished Possessions & Pub",
    "desc": "Open Mic hosted every Friday evening with Paul Connor. Great musicians, great music. You will see a wide variety of musicians each week. Paul is a very organized and talented musician. He always draws lots of new and seasoned talents. You will enjoy the family of musicians. Cherished Pub has great food & beverages available. Come enjoy all of the great music, have fun and relax. Come early to sign-up to perform. See you there!",
    "date": "12-26-2025",
    "start_time": "06:00 PM",
    "end_time": "08:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/open-mic-with-paul-connor-at-cherished-possessions-pub-06-02-2025-14-53-18",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Paint and Pat",
    "desc": "Paint a purrfect masterpiece - come enjoy a creative, fun painting workshop while surrounded by kitties for inspiration. This event is hosted by Wicked Illustrations Studio. All materials are provided.",
    "date": "11-14-2025",
    "start_time": "06:00 PM",
    "end_time": "08:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/paint-and-pat-11-10-2025-11-30-26",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Maine Needs Five Year Party!",
    "desc": "Join Maine Needs as we celebrate five years of coming together in the spirit of solidarity and support. This is an event to recognize and honor our collective efforts and impact and to share space with those who make this community everything that it is. All are welcome!There will be food, drinks, music and dancing!",
    "date": "11-14-2025",
    "start_time": "06:00 PM",
    "end_time": "10:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/maine-needs-five-year-party-14-10-2025-09-18-13",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "First Light at The Halo at the Point",
    "desc": "First Light is a bold new creation by 3AM Theatre (NYC) blending contemporary circus, physical theatre, and modern dance with kinetic sculpture, immersive lighting, and an original soundscape to deliver a singular, genre-defying experience.Visually striking and emotionally charged, the work draws audiences into a journey of explorers set out to ascend the tallest mountain known to exist. Their ambition soon becomes a reckoning with memory, loss, and the unseen forces that shape our fate.Guided by six virtuosic performers, First Light explores the human condition through themes of ambition, loss, transcendence, and empathy. As the characters rise and falter, are lost and found, their physical odyssey becomes a meditation on perseverance, connection, and acceptance. The production challenges the boundaries of live performance, merging world-class circus artists with live musicians and a site-specific stage design that fully integrates the unique architecture of The Halo at Thompson's Point, transforming its space into an immersive theatrical environment that blurs the line between audience and performer.Join us for a pre-show cocktail at 6:30 PM, featuring a live music set by Book Kennison, whose sound shapes the atmosphere of the evening. The performance begins promptly at 7:00 PM and runs approximately one hour and fifteen minutes, including a twenty-minute intermission. After the performance, stay for a meet-and-greet with the artists, accompanied by a DJ set by Kyle Driggs.",
    "date": "11-16-2025",
    "start_time": "06:30 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/first-light-at-the-halo-at-the-point-21-10-2025-09-24-34",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Side Door Coffeehouse November Edition",
    "desc": "The Side Door Coffeehouse is a venue for local musicians and others (professional and amateur) to share their talents, and for residents and visitors of the Midcoast community to enjoy great entertainment and conversation in a relaxed setting. Organized by a group of volunteers from the Unitarian Universalist Church of Brunswick, the Side Door Coffeehouse operates on the second Friday of every month except August.Admission is $12 for adults and free for children 17 and under.The Friday, November 14th installment will feature:Open Mic signup at 6:45 pmOpen Mic at 7:00Tom Clukey – 8:30-9:30 pm.Singer-songwriter and Saco resident, Tom Clukey, is originally from the small town of St. Albans. He was introduced to music at an early age and played in the school band in elementary school through college.Clukey won a karaoke contest at Spare Time Entertainment in Portland. “I never fancied myself a singer,” but the win sparked a confidence and a new interest in singing, and with the prize money he purchased a guitar.He started performing in local venues, and then a few years ago decided to take making music more seriously and began writing songs. As the winner of the Wildwood Studio Songwriting Contest, he was awarded $500 in studio time, and as the winner of The Studio Portland Singer/Songwriter Contest he was awarded a live recording session.His style is rooted in country and folk, with relatable lyrics that reflect working through the struggles and challenges of everyday life. Among his musical influences are Chris Stapleton, Tyler Childers and John Denver.",
    "date": "11-14-2025",
    "start_time": "06:45 PM",
    "end_time": "09:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/side-door-coffeehouse-november-edition-16-10-2025-08-58-25",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "After Hours",
    "desc": "Come hang with the Osher School of Music’s jazz faculty for a laid-back night of great tunes and killer solos. From swing standards to contemporary works, you’ll hear the pros do what they do best—play, jam, and have a good time.Tickets go on-sale September 5th.Tickets available through PortTIX, the official box office for the Osher School of Music.PHONE 207-842-0800ONLINE www.porttix.comIN-PERSON 400 Congress St Suite A, Portland, ME 04101Event DetailsParkingDue to limited resources, parking is not free on our Portland and Gorham campuses. You must purchase a parking permit or paid parking session to park on campus. We recommend reserving your parking in advance at https://events.parkengage.com/usm.For easy access to the Crewe Center for the Arts, choose either Parking Garage 1 (attached to the Abromson Community Education Center), Lot P1 (off of Bedford St. by Luther Bonney) or Lot P6 (off of Exeter St. or Deering Ave by the former Maine Law building).Disability Access and AccommodationsIf you have questions about disability access or need to request disability accommodations (e.g. sign language interpreters, materials in electronic format, etc.), please contact Hanna Flewelling at (207) 780-5256 or hanna.flewelling@maine.edu. Requests should be made as soon as possible to allow sufficient time for the accommodation process.",
    "date": "11-14-2025",
    "start_time": "07:00 PM",
    "end_time": "09:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/after-hours-07-08-2025-12-25-38",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Poets & Fools Costume Ball",
    "desc": "Join us for a kaleidoscopic, costumed celebration of 25 vibrant years of Waterfall Arts! Expect a night of delightful oddities, creative nostalgia, and community joy as we honor our quarter-century of artistic magic.Expect a dazzling, interactive celebration filled with:Live music by The Sugar SnapsCostume contest with fabulous prizesSpontaneous art-making & play areasPhoto ops and nostalgic slideshowDoor prize: Waterfall Arts swag + membershipCash barDancing, doodling, poetry, and moreFree treats & snacks (courtesy of local donations)Costumes highly encouraged! Come as a poet, a fool, or whatever inspires your imagination.Let’s dance, create, and celebrate 25 years of Waterfall Arts — together.",
    "date": "11-14-2025",
    "start_time": "07:00 PM",
    "end_time": "10:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/poets-fools-costume-ball-22-10-2025-12-44-30",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "WHS Fall Musical: Grease",
    "desc": "Windham High School Drama is excited to present Grease, the high energy musical set at Rydell High in 1959. Join the Pink Ladies and Burger Boys for a fun evening of classic songs that we all know and love like Summer Nights and Greased Lightening.",
    "date": "11-16-2025",
    "start_time": "02:00 PM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Nov 16, 2025 on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/whs-fall-musical-grease-21-10-2025-09-26-28",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Gospel Messiah: A Refugee Oratorio",
    "desc": "This event runs Friday, November 14 - Sunday, November 16. (2:00 p.m. matinee and 7:00 p.m. evening show on Saturday, November 15). Talk-back with performers on Saturday, November 15 at 8:30 p.m.Portland and Los Angeles-based arranger/organist Jack Maeby, with support from theatrical director Carol Tanzman, reimagines The Messiah, Handel's masterpiece, as a secular gospel music oratorio from the lens of immigrants and refugees in crisis zones. By using the experiences and talents of local refugee students and adults, as well as musicians and singers conversant with gospel music, the program aims to present an inclusive vision of the immigrant/refugee journey that is also an enlightening and dynamic musical experience.The Gospel Messiah is more relevant than ever, given the ever-increasing number of refugees seeking shelter worldwide. Enjoy an integrated performance created by the local artistic community, including musicians, singers, actors, and spoken word poet Moon Machar. The power of Handel's music in a dynamic gospel interpretation will create a riveting theatrical experience you won't soon forget! The project will be produced and performed at The Hill Arts.",
    "date": "11-16-2025",
    "start_time": "07:00 PM",
    "end_time": "08:15 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/gospel-messiah-a-refugee-oratorio-02-11-2025-01-32-46",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Cosmogenesis: The Story of Us (True North Theatre)",
    "desc": "True North Theatre is proud to announce a very special fall 2025 presentation: the world premiere of COSMOGENESIS: THE STORY OF US by Rebecca-Sophia Strong and directed by Angela Bonacasa. This fulldome, immersive multi-media event will be presented at the Versant Power Astronomy Center and Maynard Jordan Planetarium in November.Lotus, a Chinese-born college student, embarks on a journey of self-discovery as she grows more and more curious about who her biological mother was and wants to embrace her own culture more. Along the way, she is joined by a new group of friends – students and instructors – who encourage her to unravel the mysteries of her life against the backdrop of astronomy and the universe around her.This world-premiere event runs November 7th - November 15th, with performances Fridays at 7:00pm and Saturdays at 2:00pm and 7:00pm. [Please note there will be no Sunday performances for this production.] Performances will be held at the Versant Power Astronomy Center and Maynard Jordan Planetarium, 167 Rangely Road, on the University of Maine Campus in Orono.For more information, or to pre-order your tickets, visit our Linktree (linktree.com/TrueNorthTheatre).COSMOGENESIS: THE STORY OF US is proudly supported by our season sponsors, Griffin & Jordan, Attorneys at Law.True North Theatre was founded in October of 2016 in Orono, Maine, by a group of people committed to high quality productions and a positive working environment.  Our mission is to entertain, educate, and inspire through high quality productions that highlight the breadth, depth, and complexity of the human experience. We strive to be recognized as an active, vibrant place for actors and designers to experiment, learn, and share their love of theatre while producing professional quality productions that encompass a variety of genres and styles.  As theatre artists, our company strives to embody joy, inclusiveness, tradition, innovation, and respect. True North Theatre is a 501(c)(3) non-profit organization.",
    "date": "11-15-2025",
    "start_time": "07:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Nov 15, 2025 on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/cosmogenesis-the-story-of-us-true-north-theatre-22-10-2025-09-22-35",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Dirty Deeds Downeast",
    "desc": "Mainers tend to take care of their own business, much to the chagrin of Gerard, the only cop on the island. When he finds evidence of foul play surrounding a recent death, things go hilariously amok and Gerard finds there's something sinister hiding behind the cozy vacation town he grew up in. Join us for this side-splitting comedy about murder and mayhem in Maine!\"[Askari] keeps the laughs coming fast and furiously in his new work.\" – Bangor Daily NewsTICKETS ON SALE SEPTEMBER 16, 2025",
    "date": "11-23-2025",
    "start_time": "07:30 PM",
    "end_time": "02:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/dirty-deeds-downeast-02-09-2025-10-05-04",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Irving Berlin’s White Christmas",
    "desc": "ALL PERFORMANCES OF Irving Berlin's White Christmas ARE IN 2025Show dates are November 14, 15, 21, 28, 29, 2025 at 7:30pm + November 16, 22, 23, 30, 2025 at 2pmBased on the timeless and beloved film, White Christmas follows Veterans Bob Wallace and Phil Davis, who have a successful song-and-dance act after World War II. With romance in mind, the two follow a duo of beautiful singing sisters en route to their Christmas show at a Vermont lodge, which just happens to be owned by Bob and Phil's former army commander. White Christmas is an uplifting, wholesome musical that will delight audiences of all ages.Irving Berlin's White ChristmasBased Upon the Paramount Pictures FilmWritten For the Screen by Norman Krasna, Norman Panama and Melvin FrankMusic and Lyrics by Irving BerlinBook by David Ives and Paul BlakeOriginal stage production directed by Walter RobbieOrchestrations by Larry BlankVocal and Dance Arrangements by Bruce PomahacPresented by arrangement with Concord Theatricals www.concordtheatricals.comTickets: $36 - $38Prices include a per ticket handling fee. A portion of all ticket fees are designated to support the Youth Arts Access Fund. Tickets are nonrefundable.This event is eligible for the Youth Arts Access Fund.ASL interpreted performance on November 16, 2025. Seats marked \"L\" (orchestra right) have an excellent sightline to the interpreter(s).2025 Season Pass: Receive a 20% discount when you purchase tickets to all four 2025 stage shows in the same order! (The Cottage, Matilda, Deathtrap, White Christmas)",
    "date": "11-30-2025",
    "start_time": "02:00 PM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/irving-berlins-white-christmas-24-02-2025-09-28-10",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Mad Horse Theatre presents The Squirrels",
    "desc": "The Squirrels is a tragi-comical epic of prejudice and greed among squirrels living in a very divided tree.",
    "date": "11-23-2025",
    "start_time": "02:00 PM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/mad-horse-theatre-presents-the-squirrels-08-10-2025-10-24-57",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "ACAT: Becky Nurse of Salem, by Sarah Ruhl",
    "desc": "What does Latin, ritual dance, sound engineering, and film making have to do with Becky Nurse? Come find out, and see what our cast and crew have been up to in ACAT's upcoming production of Becky Nurse of Salem by Sarah Ruhl!Performance Dates: November 14, 15 & 21, 22 @ 7:30PMNovember 16 & 23 @ 2:00PM$15 for adults, $12 for seniors and studentsTickets available online or at the door!Ticket link: https://www.eventbrite.com/e/acat-becky-nurse-of-salem-by-sarah-ruhl-tickets-1874479270959?aff=oddtdtcreator\"Becky Nurse of Salem\" is presented by arrangement with Concord Theatricals on behalf of Samuel French, Inc.",
    "date": "11-21-2025",
    "start_time": "07:30 PM",
    "end_time": "09:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Friday",
    "url": "https://www.mainepublic.org/community-calendar/event/acat-becky-nurse-of-salem-by-sarah-ruhl-06-11-2025-09-21-58",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "MARGARET CHASE SMITH: Mrs. Smith Goes To Washington",
    "desc": "Coming NOVEMBER 13-22 to Footlights Theatre: MRS. SMITH GOES TO WASHINGTON by Linda Britt and starring Jackie Oliveri as Margaret Chase Smith. RESERVATIONS: (207) 747-5434. $25. ABOUT: A bold and timely play starring Jackie Oliveri as Margaret Chase Smith—Maine’s trailblazing congresswoman and senator who stood tall in a time of political fear and silence. The first woman elected to both the U.S. House and Senate, Smith was a proud Republican, a Skowhegan native, and a centrist who believed in consensus over chaos. This tour-de-force celebrates a political pioneer who brought out the best in people… and in politics. THU 7, FRI 730, SAT 2 & 730",
    "date": "11-22-2025",
    "start_time": "07:00 PM",
    "end_time": "08:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Thursday",
    "url": "https://www.mainepublic.org/community-calendar/event/margaret-chase-smith-mrs-smith-goes-to-washington-04-11-2025-09-35-21",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Trad\"fecta\"~ A great night of traditional music featuring David Francey, House of Hamill, and Craig Werth",
    "desc": "great night of traditional music featuring David Francey, House of Hamill, and Craig Werth. About these three great acts:David Francey :David is a Scottish-born Canadian songwriter, who has become known as “one of Canada’s most revered folk poets and singers. He is the recipient of four Juno Awards and three Canadian Folk Music Awards.House of Hamill:House of Hamill is Rose Baldino and Brian Buchanan (of Enter the Haggis) and Caroline Browning. Whether they’re ripping through a set of original jigs and reels, adding lush three-part harmonies into traditional folk ballads, or cracking up an audience with stories from the road, House of Hamill puts on a show that captivates audiences from the very first note.Craig Werth:Craig Werth excels in the live concert setting. A multi instrumentalist, humorist and troubadour, Craig Werth excels in the live concert setting. After two decades of performing part-time and regionally, Craig served as the full-time accompanist/co-arranger for Juno Award winner David Francey, starting in the fall of 2006.",
    "date": "11-14-2025",
    "start_time": "08:00 PM",
    "end_time": "10:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/tradfecta-a-great-night-of-traditional-music-featuring-david-francey-house-of-hamill-and-craig-werth-06-11-2025-09-30-42",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Annual 2-day Makers Market Christmas Arts and Craft Show",
    "desc": "Join us Maine Made Crafts and newenglandcraftfairs.com for the Annual 2-day Christmas Makers Market Arts & Craft Show at our South Portland holiday shopping bonanza this year with our exciting event taking place at the South Portland High School Saturday & Sunday Nov 15 & 16, 2025, 9-4 PM both days.This show brings together a wide variety of talented artists and crafters, showcasing their unique creations. From handmade jewelry and home decor to original artwork, personalized gifts, & fresh made cheeses, wood products, to soaps and rubs, you'll find something special for everyone on your holiday shopping list, all at prices you can afford.Mark your calendar for the Annual Makers Market Arts & Craft Show, South Portland High School, 637 Highland Ave, South Portland, Me 04106 Saturday & Sunday Nov 15 & 16, 2025 9-4 PM both Saturday & Sunday.Explore the Cafeteria & hall filled with creativity and inspiration, chat with the artists themselves, and discover one-of-a-kind treasures that you won't find anywhere else. Whether you wish to support local artisans and makers, find an ideal holiday gift, or simply enjoy a pleasant day out, the Annual 2-day Christmas Makers Market Arts & Craft Show on November 15 & 16, 2025, from 9:00 AM to 4:00 PM on both days, is the perfect destination. Don't miss out on this fantastic opportunity for holiday shopping at the South Portland High School. We stay open until 4PM for all our customers.For more information call Steven or Lois @ 706-843-9188, STpromo37@aol.com or LTpromo@aol.com",
    "date": "11-16-2025",
    "start_time": "09:00 AM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/annual-2-day-makers-market-christmas-arts-and-craft-show-07-02-2025-17-49-41",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Stained Glass for Beginners with Dave and Lisa Roy",
    "desc": "In this beginner’s class, participants will learn all of the techniques used in making a full sized, copper foiled stained glass panel, but in a smaller context. Participants choose one of 6 introductory projects. Steps include pattern cutting, glass selection and cutting, grinding, foiling, soldering, and finishing with patina and wax. Please bring a packed lunch.",
    "date": "11-15-2025",
    "start_time": "09:00 AM",
    "end_time": "04:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/stained-glass-for-beginners-with-dave-and-lisa-roy-19-06-2025-09-13-17",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "APL Used Bookstore",
    "desc": "Stock up on BOOKS at great prices — 50¢ to $3!  Shop Saturday mornings at the APL Bookstore 9:00-12:30 for gently used books, ever-changing inventory, wide selection of children’s, fiction and non-fiction books, plus DVDs and puzzles.  Auburn Public Library, lower level, 46 Spring Street, Auburn.",
    "date": "12-27-2025",
    "start_time": "09:00 AM",
    "end_time": "12:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/apl-used-bookstore-23-09-2025-08-56-00",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Sports card Benefit show",
    "desc": "Benefit Sports card and Pokémon Show Saturday, November 15th 9AM to 2PM. in the Bath Rec Gym located on 4 Sheridan Rd Bath, Maine We will have an Autograph Guest and we will also have show raffles, Door prizes and 50/50. Admission is Free (Donations are Accepted) Dealer Tables are $30 each for an 8FT table, Dealers can signup for this by either visiting WWW.bathrecreation.com>programs to make an account and reserve your table(s)! or you can contact Bill Mckellar @ 339-226-1179 or diehard72@comcast.net",
    "date": "11-15-2025",
    "start_time": "09:00 AM",
    "end_time": "02:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/sports-card-benefit-show-07-10-2025-08-38-07",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Treasure Sale",
    "desc": "Rummage sale in South Freeport to support Tedford Housing and UN Famine Relief.  Saturday, November 15, 9 am to 3 pm,  FREE.  An outdoor tent, a large Community Hall and two more indoor rooms of items, including boutique clothing, jewelry, small antiques, and more.  Everyone's invited.  Find unique gifts and ....treasures!",
    "date": "11-15-2025",
    "start_time": "09:00 AM",
    "end_time": "03:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/treasure-sale-01-11-2025-10-04-58",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Cobblestone Quilters Holiday Market",
    "desc": "This holiday market includes non-quilting crafters as well as all things quilting! Quilt raffle, Bake sale, quilted items for sale, fabric sale and craft vendors. Something for everyone!",
    "date": "11-15-2025",
    "start_time": "09:00 AM",
    "end_time": "02:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/cobblestone-quilters-holiday-market-12-11-2025-10-16-19",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Bird Chatter: Wintering Birds of Western Mount Desert Island",
    "desc": "This session of Bird Chatter will begin indoors at Wendell Gilley Museum. After a brief update on the latest bird news, participants will car caravan to a local hotspot or two, led by field ornithologist Seth Benz. The destination depends upon area bird activity – tentative stops include the Southwest Harbor Coast Guard Station and Seawall Beach/Picnic Area. Grebes, loons, and sea ducks are likely species to share the spotlight. And at least one prediction, from the Finch Research Network, forecasts a good finch incursion in 2025 – think Crossbills!Bring binoculars; a spotting scope will be provided. Binoculars are available to borrow from the Gilley with advance notice; make a note in the comments section when you sign up. Be sure to dress in layers suitable for the weather. Group size is limited to 14.",
    "date": "11-15-2025",
    "start_time": "09:00 AM",
    "end_time": "12:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/bird-chatter-wintering-birds-of-western-mount-desert-island-12-11-2025-10-34-51",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "KCCV's 5th Annual Holiday Craft Fair",
    "desc": "Join us for a festive two-day shopping event featuring over 80 local sellers offering a wide variety of products, including handcrafted items, baked goods, jewelry, home décor, and more. Whether you're looking for unique holiday gifts or something special for yourself, you're sure to find it here.Event Features: • Photos with Santa • 50/50 Cash Raffle • Item Raffles • On-Site ConcessionsShow Dates: November 15th - 16th | 9 AM - 4 PMAdmission: FREELooking to be a vendor? Click the following link to learn more: https://www.kccvmaine.org/seller-application",
    "date": "11-16-2025",
    "start_time": "09:00 AM",
    "end_time": "04:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/kccvs-5th-annual-holiday-craft-fair-23-10-2025-15-09-21",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Christmas Craft Fair and Caroling",
    "desc": "Redeemer Lutheran Church at 410 Main Street in Gorham invites you to Christmas Fair fun! Shop our Homemade Crafts and Food Market. Enjoy festive foods and get in the Christmas spirit as you join in our Christmas Carol sing along. Saturday, November 15, 9am - 3pm. Visit us at RedeemerMaine.org or at facebook.com/RedeemerMaine",
    "date": "11-15-2025",
    "start_time": "09:30 AM",
    "end_time": "02:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/christmas-craft-fair-and-caroling-20-10-2025-09-00-59",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Cary Memorial Library Used Book Sale",
    "desc": "The Book Sale features gently used books, CDs, DVDs and audio books - most priced at 50 cents to a dollar.  The sale is held on the third Saturday of every month.  All proceeds fund Cary Memorial  Library scholarships awarded to Maranacook  High School graduating seniors.",
    "date": "11-15-2025",
    "start_time": "09:30 AM",
    "end_time": "12:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/cary-memorial-library-used-book-sale-31-01-2025-08-05-13",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Cat Pebble Art",
    "desc": "Learn how to use natural stones/pebbles to create pieces of cat art! The event is hosted by Tammy from Nature Creations - all materials are provided and you will make two pictures to take home with you.",
    "date": "11-15-2025",
    "start_time": "10:00 AM",
    "end_time": "12:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/cat-pebble-art-11-10-2025-11-31-57",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Form + Function Artisan Fair (day 2!)",
    "desc": "Form + FunctionArtisan FairSaturday, November 1510am - 5pmFree to attendJoin us at 3S Artspace for our 7th annual Form + Function artisan fair!Visit 3S November 14th for a night market and November 15th during the day to find inspired gifts for you and yours this holiday season. Form + Function is a curated showcase of unique, hand-crafted work by skilled artisans and makers. Shop textiles, housewares, jewelry, metal work, leather accessories, glass vases, ceramics, prints, and more at this festive event!Featured artisans:Amy Vander Els • Bare Bones Handsewn • Bloodroot Metalworks • Emily Percival Jewelry • Emily Wernig Ceramics • Essex Junction • Gordo Glass • Holmes + Hudson • Kim Ferreira ~ Joie de Vivre • Larkin and Larkin • Light-Q Creations • Loveline Baskets • LucasLandGlass • Michelle Phaneuf Ceramics • Rooted & Rendered • Wave Bait • YAM Collective----RSVP is not required but helps us get an idea of # of attendees. Plus, we'll send you a reminder about the fair a few days prior to the event!",
    "date": "11-15-2025",
    "start_time": "10:00 AM",
    "end_time": "05:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/form-function-artisan-fair-day-2-30-10-2025-08-57-46",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Wood Fired Kiln Opening Show with Guest Artists",
    "desc": "We'll be celebrating the 17th wood firing with hundreds of new pieces, hot out of the kiln. There will be new designs and some 'old' favorites. Our guest artists are also created new pieces to share. Gifts for everyone! Pottery, Jewelry, Graphic ArtGlynis Dixon, Earth Metalworks \"My mixed metal and torch fired enamel jewelry is made for any and every wild heart out there. Each earthy, rustic beauty has its own unique character, just like its wearer, and will proudly bear marks of being handcrafted.\"Danielle Lehoux, Lehoux Art\"My passion is creating graphic artwork in a block print style, loosely inspired by the vintage “See America” posters of the National Parks.\" Amy Clark, Ocean Fire Pottery\"The pottery I make is earthy and substantial, designed and created to be used and enjoyed. I want each piece to be special, but not limited to special occasions. I create simple forms with natural colors in hopes of evoking serene, effortless emotions from the user.\"There will be fires blazing, hot drinks and snacks to enjoy.",
    "date": "11-15-2025",
    "start_time": "10:00 AM",
    "end_time": "04:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/wood-fired-kiln-opening-show-with-guest-artists-01-11-2025-09-05-58",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Preschool Playdate",
    "desc": "The Lewiston Public Library will be offering drop-in Preschool Playdates from 10:30am-12:30pm on Saturdays* in the Children’s program room.*(The Library will be closed on Saturday, 8/30 in observance of Labor Day & Saturday, 11/29 in observance of Thanksgiving.)Drop-in and join us for Preschool Playdates! Preschoolers and their families are invited to stop in during our Preschool Playdates to engage in imaginative play and build friendships. A variety of toys, games, and crafts will be available during all sessions.The programs will take place in the Children’s Program Room on the 3rd floor.The programs are free and there is no registration required. All families with children between the ages of 2-6 are welcome to attend. Siblings are also welcome.The Lewiston Public Library is located downtown at 200 Lisbon Street at the corner of Pine Street. For more information on children’s programming contact the Children’s Department at 513-3133 or LPLKids@lewistonmaine.gov.",
    "date": "12-27-2025",
    "start_time": "10:30 AM",
    "end_time": "12:30 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/preschool-playdate-28-07-2025-09-33-03",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Chair Yoga for Adults",
    "desc": "Join us at Libby Library in OOB on Saturday, November 15 at 11:00 am for Chair Yoga with instructor Jessy Lynn Ostara!This is a one-time class that will give you an introduction to Chair Yoga, a class that instructor Jessy Lynn Ostara offers through OOB/Saco Adult Education. Chair yoga offers all of the benefits of yoga without the need to get down to (and up from) the floor. Yoga postures are adapted for practicing seated or standing using the chair for support when needed. You will be guided through yoga postures and breathing/relaxation techniques with a focus on releasing tension, improving flexibility, and creating mindfulness.All levels welcome, no prior experience necessary. Wear comfortable clothing that allows movement.This program is free, open to the public, and no registration is required.",
    "date": "11-15-2025",
    "start_time": "11:00 AM",
    "end_time": "12:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/chair-yoga-for-adults-29-10-2025-14-58-17",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Cranksgiving Portland Maine",
    "desc": "Cranksgiving is a food drive on two wheels. Part bike ride, part madcap scavenger hunt. All you need is a bicycle, a lock, and a bag! This event is FREE, but you'll need $15-$20 to purchase food. Donations will support The Westbrook Food Pantry. We will meet at the Portland Gear Hub and, from there, pedal around Portland, visiting the stops on the list. You can make it a race or go at your own pace. Visit all the stops or just a couple. At the end, we will meet at a Orange Bike brewery to collect the donations and celebrate each other and the fun of riding bikes in November. Visit www.cranksgiving.org for more locations.",
    "date": "11-15-2025",
    "start_time": "11:00 AM",
    "end_time": "02:15 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/cranksgiving-portland-maine-07-11-2025-09-36-28",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Amy Hunter | Noonday Concerts Saturday Edition",
    "desc": "Solo piano concert featuring the music of JS Bach, Franz Schubert, and more.From Amy:I am thrilled to share this program with you! I have always thoroughly enjoyed listening to, learning, and performing the music of J.S. Bach. This particular Suite is a lesser-known piece – performed far less frequently than his Partitas, English Suites, or French Suites – and is a recent addition to my repertoire. Schubert’s B Flat Major Sonata has been on my list of pieces to learn for years. Ever since undergrad I have adored the Schubert Sonatas. I performed the C Minor, D. 958 as part of my undergraduate recital, and over the years have constantly tinkered with many of the other Sonatas for fun. The B Flat Major Sonata is Schubert’s last piano sonata, composed just months before his death, and was not published until 10 years after his death. It is a perfect example of Schubert’s extraordinary gift for lyricism with moments of breathtaking beauty and dark drama contrast.Johann Sebastian Bach (1685-1750)Keyboard Suite in A Minor, BWV 818a1. Prélude2. Allemande3. Courante4. Sarabande5. Menuet6. GigaFranz Schubert (1797-1828)Piano Sonata No. 21 in B Flat Major, D 9601. Molto moderato2. Andante sostenuto3. Scherzo, Allegro vivace con delicatezza4. Allegro, ma non troppoAmy Hunter is a native of the lake and foothills region of Maine where she began her piano studies. She holds both a Bachelor of Music and Master of Music in Piano Performance, magna cum laude, from Temple University’s Esther Boyer School of Music in Philadelphia, PA where she studied under Dr. Charles Abramovic. She also has had the privilege of participating in masterclasses and additional studies with renowned artists including Arnaldo Cohen, David Finko, Alexander Fiorillo, Laura Kargul, Oleg Koshelev, and Wu Han.Amy has performed as a soloist throughout Maine, Philadelphia, Washington D.C., and California including performances of Mendelssohn Piano Concerto No. 1 and Beethoven Piano Concerto No. 3 as well as Handel’s Messiah on pipe organ, and J.S. Bach’s Brandenburg Concerto No. 4 BWV 1049 on harpsichord. A devoted collaborator, Amy has served as accompanist for collegiate choirs at Villanova University, Gwynedd-Mercy College, Rosemont College, and Temple University, as well as for church and community choirs in Philadelphia, Washington D.C., and San Jose, California.Deeply committed to music education, Amy has worked with organizations such as Washington Performing Arts Society (D.C.) in their education outreach department, with the non-profit, Music for Minors (CA), teaching general music in schools throughout the Bay Area that lack formal music programs. She has also taught classes and private lessons at Montgomery Community College (PA), and Colby College (ME), as well as numerous private music schools. In 2015, she founded The Hunter School of Music in San Jose, CA – a studio employing six teaching artists and offering instruction in piano, guitar, ukulele, theory, and composition.Amy loves teaching piano to students of all ages and abilities, tailoring lessons to each students’ musical interests and individual goals. She strives to instill not only technical skill and musical understanding but also the dedication, confidence, and patience that come with learning an instrument.",
    "date": "11-15-2025",
    "start_time": "12:15 PM",
    "end_time": "01:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/amy-hunter-noonday-concerts-saturday-edition-11-09-2025-15-11-18",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Haiku Workshop with Kristen Lindquist",
    "desc": "Poet and naturalist Kristen Lindquist will be with us at the Gilley in April and again in November to teach an introductory haiku workshop. She’ll share a brief history of this intriguing art form, which originated in Japan more than 500 years ago and evolved as a nature poem. Kristen will share what makes a poem a haiku (it’s probably not what you think), and how haiku are written today in the United States. Then she will guide students through writing their own haiku.",
    "date": "11-15-2025",
    "start_time": "01:00 PM",
    "end_time": "03:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/haiku-workshop-with-kristen-lindquist-02-09-2025-09-54-33",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Craft Your Own Handroll at Rosella",
    "desc": "Embark on a culinary journey and discover the artistry behind sushi making at Rosella! Join us for an exclusive behind-the-scenes experience where our expert chefs will guide you step-by-step through the process of crafting your very own handroll.A handroll, is a unique and delicious way to enjoy sushi. Unlike traditional rolls, handrolls are served in a cone-shaped seaweed wrap, making them perfect for a fun, interactive experience. You'll get to select from an array of the freshest, highest-quality ingredients — from rich, buttery tuna, salmon, and scallops to crisp vegetables — and roll your creation with your own hands.The art of crafting the perfect handroll is in the balance: the right ratio of rice, filling, and that signature crunch of nori. You'll observe the techniques our chefs use to achieve that flawless combination, all while learning about the ingredients' origins and flavor profiles.Whether you're a sushi enthusiast or a curious beginner, this hands-on experience will deepen your appreciation for the craft of sushi making and leave your taste buds craving more!",
    "date": "11-15-2025",
    "start_time": "01:00 PM",
    "end_time": "02:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/craft-your-own-handroll-at-rosella-03-09-2025-09-05-09",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Autumn Sips & Spirits: A Cozy Fall Cocktail Class",
    "desc": "Get ready to shake things up with our Autumn Sips & Spirits: A Cozy Fall Cocktail Class at The Burleigh! Join us for a hands-on experience as we dive into the art of crafting two (2) of our favorite seasonal cocktails. You’ll receive recipe cards for each cocktail, making it easy to recreate the magic at home. Plus, enjoy a selection of light snacks to complement your drinks and enhance your tasting experience. Whether you're a cocktail connoisseur or a curious newbie, this class promises a delightful and delicious time!Tickets include:Two(2) cocktailsLight bites & snacksTake home recipe cardPart of The Burleigh's Hotel Week Programming.",
    "date": "11-15-2025",
    "start_time": "01:00 PM",
    "end_time": "02:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/autumn-sips-spirits-a-cozy-fall-cocktail-class-05-09-2025-09-33-55",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Maple Syrup: The Original Liquid Gold",
    "desc": "Join Sean Eager, Proprietor of York, Maine-based Porcupine Hill Maple Syrup, to learn about sugar making. Sean will discuss all aspects of making maple syrup, including how you can do it in your own backyard with just a few trees  You will learn about identifying and tapping trees, collecting and boiling sap, and more.Porcupine Hill Maple Syrup has been operating from Eager’s family-owned land since 2015. Recent leases with the York Land Trust and abutting land owners have allowed for increased production and expansion.After the talk, Porcupine Hill Maple Syrup will be available for purchase. Just in time for the holidays!",
    "date": "11-15-2025",
    "start_time": "01:00 PM",
    "end_time": "03:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/maple-syrup-the-original-liquid-gold-16-10-2025-08-52-38",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Make a Triptych Photo Frame",
    "desc": "Create a tri-fold, standing  photo frame. A simple & elegant structure with a lot of decorative versatility. In this class we will gain experience with gluing book cloth to book board. Learning how to emboss and inset frames into book board, and the importance of hinge gap jigs when making book cloth hinges. Materials & tools provided.",
    "date": "11-15-2025",
    "start_time": "01:00 PM",
    "end_time": "04:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/make-a-triptych-photo-frame-03-11-2025-12-09-35",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Seasoned Spirits Mixology at Ocean",
    "desc": "Celebrate the bold, warming character of rye whiskey with an evening of elevated cocktail crafting. As the crisp air of autumn settles in, there's no better way to savor the season than through the spice-forward complexity of this timeless spirit.Join expert mixologists as they guide you through the art of three classic rye-based cocktails:The BoulevardierThe Vieux CarréThe SazeracPerfect for both seasoned enthusiasts and curious newcomers, this hands-on experience brings together history, technique, and seasonal flavor for an unforgettable evening of cocktail exploration.Tickets include: Three(3) cocktails Light bites & snacks Take home recipe cards",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "03:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/seasoned-spirits-mixology-at-ocean-03-09-2025-10-58-56",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Mixology at Earth",
    "desc": "Join us at Earth and learn how to prepare classic cocktails with our team of skilled bartenders. From infusing liquors with farm fresh ingredients from our gardens to dehydrating fruit wheels for garnish to making delicious shrubs, Earth at Hidden Pond’s cocktails are some of the best around! Includes three (3) cocktail tastings and light bites.More Information about Earth at Hidden Pond in Kennebunkport, Maine.__Class is open to adults 21 years of age or older. Proper ID is required at door. We look forward to seeing you.Part of Earth at Hidden Pond's Hotel Week Programming.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "03:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/mixology-at-earth-05-09-2025-09-33-38",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Osher Wind Ensemble",
    "desc": "The Osher Wind Ensemble, under the direction of Dr. Will Kinne, presents an afternoon of music for large ensemble. Featuring a wide-ranging program—from contemporary works to timeless wind band classics—this performance showcases the depth, versatility, and artistry of the Osher School of Music’s talented student musicians.Tickets go on-sale September 5th.Tickets available through PortTIX, the official box office for the Osher School of Music.PHONE 207-842-0800ONLINE www.porttix.comIN-PERSON 400 Congress St Suite A, Portland, ME 04101Event DetailsParkingDue to limited resources, parking is not free on our Portland and Gorham campuses. You must purchase a parking permit or paid parking session to park on campus. We recommend reserving your parking in advance at https://events.parkengage.com/usm.For easy access to the Crewe Center for the Arts, choose either Parking Garage 1 (attached to the Abromson Community Education Center), Lot P1 (off of Bedford St. by Luther Bonney) or Lot P6 (off of Exeter St. or Deering Ave by the former Maine Law building).Disability Access and AccommodationsIf you have questions about disability access or need to request disability accommodations (e.g. sign language interpreters, materials in electronic format, etc.), please contact Hanna Flewelling at (207) 780-5256 or hanna.flewelling@maine.edu. Requests should be made as soon as possible to allow sufficient time for the accommodation process.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "03:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/osher-wind-ensemble-07-08-2025-12-26-10",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Lyric Music Theater Presents Pride & Prejudice",
    "desc": "Pride and Prejudice explores themes of pride, prejudice, social class, and the complexities of love, highlighting the struggles of overcoming initial misunderstandings and societal expectations. Finding a husband is hardly Elizabeth Bennet’s most urgent priority. But with four sisters, an overzealous match-making mother, and a string of unsuitable suitors, it’s difficult to escape the subject. When the independent-minded Elizabeth meets the handsome but enigmatic Mr. Darcy, all feelings of attraction are muted by his pride and her prejudice. As their worlds keep colliding, their attraction increases. But they first must overcome their own weaknesses and many other obstacles before the most famous courtship in history can begin.",
    "date": "11-15-2025",
    "start_time": "02:00 PM",
    "end_time": "04:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/lyric-music-theater-presents-pride-prejudice-03-11-2025-19-54-02",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Magic Mutt Holiday Strut - Event to celebrate our pooches!",
    "desc": "Magic Mutt Holiday Strut – Event to Celebrate our pooches!Gardiner Waterfront ParkSaturday, November 15th at 3:30pm Join us for a magical pet parade! The First Magic Mutt Holiday Strut will be happening at the Gardiner Waterfront Park on Saturday, November 15th at 3:30 pm. Bring your canine best friend to Gardiner's Waterfront to see and be seen!  Leashes and good manners are mandatory, with costumes highly encouraged!  Pre-registration is preferred, with check-in and same day registration beginning at 3:00 pm at Gardiner Waterfront. At 3:30 pm we will strut with the mutts along the perimeter of Waterfront Park to a doggy playlist.  No contest this year; just a laid-back opportunity for humans and dogs to mingle and celebrate their special bond.  Plus, a photo booth for selfies and holiday portraits.  This event is free of charge; registration and signed liability waiver required. For sign up:  https://form.jotform.com/253056953882164For more information: HolidayMuttStrut@gmail.com.  For more information on Gardiner Main Street’s holiday activities contact Tamara Whitmore at Tamara@gardinermainstreet.org (207) 582-3100",
    "date": "11-15-2025",
    "start_time": "03:30 PM",
    "end_time": "05:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/magic-mutt-holiday-strut-event-to-celebrate-our-pooches-06-11-2025-15-12-52",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "The FLUKES benefit concert for St. Elizabeth's Essentials Pantry",
    "desc": "The FLUKES, an ensemble of enthusiastic ukulele musicians along with singer/songwriter Eileen Rose, and special guest The Grateful Hearts present a family friendly concert to benefit St. Elizabeth's Essentials Pantry, a low-barrier pantry serving non-food essentials to all those in need, including new Mainers and Mainers whose families have been here for generations.",
    "date": "11-15-2025",
    "start_time": "04:00 PM",
    "end_time": "05:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/the-flukes-benefit-concert-for-st-elizabeths-essentials-pantry-19-09-2025-10-43-58",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Baroque Orchestra of Maine",
    "desc": "Baroque Orchestra of Maine (BOOM) will present a concert on Saturday, November 15 at 4pm, Brooklin Inn. Heidi Powell, baroque violin and Max Treitler, baroque cello will perform Antonio Vivaldi's Violin Concerto 'Il Favorito' as well as sonatas by Bach, Corelli, Biber and more. Tickets are available at the door for adults, students are free. For more information visit: baroqueorchestraofmaine.org, call 207-479-2845 or e-mail fiddleheadheidi@gmail.com.",
    "date": "11-15-2025",
    "start_time": "04:00 PM",
    "end_time": "05:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/baroque-orchestra-of-maine-06-11-2025-09-26-48",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "An Evening of Tarot and Typewriter Poetry",
    "desc": "Please join Stevie Trevino, creator of Stevie’s Poem Store, for an evening of tarot and typewriter poetry at Something Witchy58 Exchange Street ~ PortlandSaturday Nov 15 from 4 - 7pm",
    "date": "11-15-2025",
    "start_time": "04:00 PM",
    "end_time": "07:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/an-evening-of-tarot-and-typewriter-poetry-12-11-2025-10-29-22",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Gardens Aglow",
    "desc": "November 15, 2025 through January 3, 2026All Day EventNovember 15–January 3, Thursday–Sunday, plus select datesfrom 4–9 p.m.(Closed Thanksgiving, Christmas Eve, Christmas Day, New Years Eve, and New Years Day)The planning for our next Gardens Aglow is well underway, and we can’t wait to see you there! Experience this year’s theme, Nature in Motion, and see the Gardens come alive after dark. See the landscape transformed into a glowing journey through scenes depicting the flora and fauna of Maine’s forests, shorelines, and meadows—and don’t miss some fun new surprises in this year’s display!Tickets should be purchased online or over the phone, 207-633-8000.",
    "date": "01-03-2026",
    "start_time": "04:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/gardens-aglow-12-11-2025-10-35-41",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Cafe USCA - Games, Food, Storytelling",
    "desc": "Upper Saco Cultural Alliance (USCA) serves the Fryeburg area with community gathering activities.  Cafe USCA is an afternoon of drop-in activities including board games, a light fare potluck dinner and adult story time where we share personal tales on a theme.  November 15th theme is \"Experiences with a Flat Tire\".",
    "date": "12-20-2025",
    "start_time": "04:00 PM",
    "end_time": "08:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/cafe-usca-games-food-storytelling-14-11-2025-09-24-49",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Winter Wonders at Sandy Hill Farm",
    "desc": "New England's largest walk-through light show. 1 mile trail, over 2 million lights and trees wrapped heights of over 90 feet.Note: our schedule varies and does not operate daily. It is on our website. Thanks!",
    "date": "03-01-2026",
    "start_time": "04:15 PM",
    "end_time": "08:30 PM",
    "event_type": "recurring",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/winter-wonders-at-sandy-hill-farm-09-09-2025-08-57-36",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Black Mountain of Maine Fundraiser: Dinner, Silent & Live Auction!",
    "desc": "Join us for Friends of Black Mountain of Maine’s Annual Fundraising Auction — now bigger & better than ever! This year, we’re kicking things off with a fundraising dinner & silent auction featuring special items you won’t want to miss, followed by a live auction!Dinner by Mainely Plates & Platters* Limited tickets available — guarantee your seat with dinner! * Includes VIP seating for the live auction & a chance to bid on exclusive silent auction items.* Tickets: $30 per person / $50 per couple (live auction paddle not included).* Dinner tickets in advance only. Tickets will not be available at the door.Schedule:4:30 PM – Doors open for Dinner & Silent Auction guests.5:00–6:30 PM – Dinner & Silent Auction6:30 PM – Doors open for Live Auction guests. Free admission.7:00 PM – Live Auction begins (paddles $2)All Evening: Last Run Pub Open & Sweet Treats available for purchase.Don’t miss this fun night of amazing food, bidding, & community — all to support Black Mountain of Maine!Tickets on Sale Soon!",
    "date": "11-15-2025",
    "start_time": "04:30 PM",
    "end_time": "09:30 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/black-mountain-of-maine-fundraiser-dinner-silent-live-auction-03-09-2025-09-23-04",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Saturdays: Live Music in the Brewhouse! (FREE)",
    "desc": "Come on out to our tasting room to enjoy great music, tasty bevs & good vibes. No ticket required, but we'd love to know you're coming! Here's the current lineup:8/23 Skip BaileySkip Bailey is a Maine singer songwriter who plays salt of the earth music for salt of the earth people. His unique place-based sound combines folk, country, and maritime influences into tunes that you'll find yourself humming for days!8/30 Dan CloutierThis guitar-strumming storyteller is aiming to steal your heart with lyrical honesty. Dan Cloutier has sold out shows throughout New England. Expect beloved covers and originals too! He just released an album called, \"The Iceberg\" - spending the last year traveling to Greenland, and Newfoundland to record music and make videos about these adventures.9/6 This or BetterOne of Portland's most popular duos, Natalie and Max are “This or Better.” A folk acoustic duo with beautiful harmonies, fingerstyle guitar picking and a charismatic vibe that have stolen the hearts of many. Their repertoire includes original music and prime selections from the classics: John Prine, Dolly Parton, Buck Owens, Johnny Cash, June Carter, Willie Nelson, Townes Van Zandt and so many more. They are a heart-filled act any audience will enjoy!9/13 Sam CutlerSam Cutler is a singer songwriter who spent his formative years in New York City before moving to Portland in 2022. His music bounces between genres, sometimes more folk, sometimes more blues, with lyrics that reflect his humor and wit.",
    "date": "11-29-2025",
    "start_time": "05:00 PM",
    "end_time": "07:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Weekly on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/saturdays-live-music-in-the-brewhouse-free-25-08-2025-09-39-25",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Basic D&D: Caverns of Thracia",
    "desc": "*Owlbear’s Rest & Cthulhu Present…* The Caverns of Thraciaby Jennell JaquaysCome and experience one of the classic early D&D adventure modules. Explore a branching, non-linear, reactive dungeon inhabited by multiple factions and loot their stuff ! Utilizing Basic D&D for simple character creation and a rules light approach.Casual drop-in/drop-out play — come when you can! No RPG experience necessary!📅 Every other Saturday, 5–9 PM (No session 8/9)💲 $10 per player per session📍 In the Druid's Grove at Owlbear’s RestGrab your dice. Explore the depths. Steal from lizard cultists.The Caverns await…",
    "date": "08-08-2026",
    "start_time": "05:00 PM",
    "end_time": "09:00 PM",
    "event_type": "recurring",
    "frequency_notes": "Every 2 weeks through Aug 08, 2026 on Saturday",
    "url": "https://www.mainepublic.org/community-calendar/event/basic-d-d-caverns-of-thracia-08-08-2025-15-40-31",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "Ryan Blotnick Quartet",
    "desc": "Tinder Hearth is so excited to host dear friend and frequent collaborator Ryan Blotnick for an evening of original compositions and improvisations with his quartet. Guitarist and composer Ryan Blotnick has long balanced a searching intelligence with a natural lyricism, whether navigating open improvisation, writing for film, or sculpting finely wrought original tunes. His quartet-featuring Tyler Wood on keyboards, Adam Chilenski on bass, and Otto Hauser on drums-extends that sensibility into a collective conversation that's as fluid as it is grounded. Their music, spacious yet deeply rooted, thrives on close listening and collective interplay.Blotnick first emerged in New York's modern jazz scene, praised by Jazz Times as \"one of the bright lights\" of his generation, and has since built a career that bridges jazz, world music traditions, and cinematic soundscapes. His playing—at once lyrical and daring-has graced stages from Copenhagen to New York and found its way into award-winning films at Sundance, SXSW, and DOC NYC. Now based in Maine, he continues to compose and perform widely, exploring new sonic terrain with his quartet and local groups such as SOULBENDERS, Katherine Perkins and Danny Fisher-Lochhead's Large Ensemble.Wood, originally from Presque Isle, Maine, has carved out a multifaceted career as a musician, producer, and recording engineer. After early forays into piano, trumpet, and drums, he landed in Brooklyn, where he toured and recorded with artists such as Luke Temple, Glass Ghost, Chester French, and Joan As Police Woman. A co-founder of the indie-soul project Oh My Goodness, Wood also works internationally as an audio engineer, capturing folkloric traditions around the globe with Remix <-> Culture.Chilenski brings a deep groove and inventive sensibility honed in New York's vibrant scene, where he has performed with the exotica band Kolumbo, Groove Collective, and songwriters such as Jonah Smith, Luke Temple (Here We Go Magic) and Mikael Jorgensen (Wilco).Hauser, a versatile and sought-after drummer, has worked with an extraordinary range of-from folk icons Vashti Bunyan and Michael Hurley to rock luminaries like Jeff Tweedy and The War on Drugs. With over a hundred albums to his credit, his drumming is celebrated forTogether, the quartet creates music that is nuanced, melodic and spontaneous-drawing from jazz, folk, rock, and improvised traditions.",
    "date": "11-15-2025",
    "start_time": "05:00 PM",
    "end_time": "09:00 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/ryan-blotnick-quartet-02-11-2025-23-42-56",
    "max_capacity": null,
    "attendees": null
  },
  {
    "title": "The Black & White Ball",
    "desc": "Returning once again to the stunning Mechanics' Hall Ballroom, Prismatic Productions & Mechanics’ Hall present The Black & White Ball. Coming off the heels of the sold-out Prismatic Ball, we are thrilled to bring the second large-scale ballroom event in 2025. This edition features 8 high-impact categories, with a special performance by a recently departed local favorite who will be returning to shut down the catwalk!This time, we are looking for show-stopping effects in full black and white - no color on the runway! Each category is calling for something specific, so make sure you come correct and deliver what the judges will be looking for. Every category calls for a black and white effect unless mentioned otherwise, so stun us with your coordination and creativity!Hosted by Aquarius Funkk & VegadonnaDJs: Red Tide & Disco DungeonJUDGES: TBACHECK THE DETAILED CATEGORY DESCRIPTIONS HERE!SCHEDULEBlock 1:Roll CallBest DressedBizarreBlock 2:FaceBodyHands PerformanceBlock 3:Tag Team RunwayFoot & EyewearVogue Performance----This event is created for and by Black & Brown Trans, Queer & Gender Non-conforming people. Ballroom has historically been a space for this community to gather and express themselves freely, to provide support and mutual aid, and to ensure our survival.In the spirit of community, we invite spectators and participants of all identities to attend. We encourage attendees who have the means to sponsor a ticket for a member of the QTBIPOC community to contribute using our donation option or directly buy a ticket for someone they know who would benefit from attending. You can make a suggested donation of $25-$50+ to support the attendance of those who need it most.If you are a community member who is unable to afford a full-price ticket, please contact @prismatic.prod on IG or hello@prismatic.productions for information about free and sliding-scale ticketsPARKING & TRANSPORTATIONThe Greater Portland Metro’s Congress & Casco Street Stop is directly in front of our building, served by routes 1, 7, 8, and 9B.Parking is available at the Arts District Garage, which has entrances on Casco and Brown Street, with a rate of $5 per hour. Metered street parking is available on Congress, Casco, Cumberland, Free Street, and other nearby streets. Free hourly street parking is available between Parris and Alder Street.ACCESSIBILITYTo enter our building, patrons will need to navigate a single step, or use a modular ramp. There is a wheelchair-accessible elevator (33\" wide),If you need accessibility accommodations/questions please contact us at programming@mainemechanics.org or 207-773-8396.",
    "date": "11-15-2025",
    "start_time": "07:00 PM",
    "end_time": "11:59 PM",
    "event_type": "single",
    "frequency_notes": null,
    "url": "https://www.mainepublic.org/community-calendar/event/the-black-white-ball-02-10-2025-09-13-21",
    "max_capacity": null,
    "attendees": null
  }
]
